let city = {

    cityTree: [{
        "title": "北京",
        "code": "110000",
        "children": [{
            "title": "东城区",
            "code": "110101"
        },
        {
            "title": "西城区",
            "code": "110102"
        },
        {
            "title": "朝阳区",
            "code": "110105"
        },
        {
            "title": "丰台区",
            "code": "110106"
        },
        {
            "title": "石景山区",
            "code": "110107"
        },
        {
            "title": "海淀区",
            "code": "110108"
        },
        {
            "title": "门头沟区",
            "code": "110109"
        },
        {
            "title": "房山区",
            "code": "110111"
        },
        {
            "title": "通州区",
            "code": "110112"
        },
        {
            "title": "顺义区",
            "code": "110113"
        },
        {
            "title": "昌平区",
            "code": "110114"
        },
        {
            "title": "大兴区",
            "code": "110115"
        },
        {
            "title": "怀柔区",
            "code": "110116"
        },
        {
            "title": "平谷区",
            "code": "110117"
        },
        {
            "title": "密云县",
            "code": "110228"
        },
        {
            "title": "延庆县",
            "code": "110229"
        }
        ]
    },
    {
        "title": "天津",
        "code": "120000",
        "children": [{
            "title": "和平区",
            "code": "120101"
        },
        {
            "title": "河东区",
            "code": "120102"
        },
        {
            "title": "河西区",
            "code": "120103"
        },
        {
            "title": "南开区",
            "code": "120104"
        },
        {
            "title": "河北区",
            "code": "120105"
        },
        {
            "title": "红桥区",
            "code": "120106"
        },
        {
            "title": "东丽区",
            "code": "120110"
        },
        {
            "title": "西青区",
            "code": "120111"
        },
        {
            "title": "津南区",
            "code": "120112"
        },
        {
            "title": "北辰区",
            "code": "120113"
        },
        {
            "title": "武清区",
            "code": "120114"
        },
        {
            "title": "宝坻区",
            "code": "120115"
        },
        {
            "title": "滨海新区",
            "code": "120116"
        },
        {
            "title": "宁河县",
            "code": "120221"
        },
        {
            "title": "静海县",
            "code": "120223"
        },
        {
            "title": "蓟县",
            "code": "120225"
        }
        ]
    },
    {
        "title": "河北",
        "code": "130000",
        "children": [{
            "title": "石家庄",
            "code": "130100",
            "children": [{
                "title": "长安区",
                "code": "130102"
            },
            {
                "title": "桥西区",
                "code": "130104"
            },
            {
                "title": "新华区",
                "code": "130105"
            },
            {
                "title": "井陉矿区",
                "code": "130107"
            },
            {
                "title": "裕华区",
                "code": "130108"
            },
            {
                "title": "藁城区",
                "code": "130109"
            },
            {
                "title": "鹿泉区",
                "code": "130110"
            },
            {
                "title": "栾城区",
                "code": "130111"
            },
            {
                "title": "井陉县",
                "code": "130121"
            },
            {
                "title": "正定县",
                "code": "130123"
            },
            {
                "title": "行唐县",
                "code": "130125"
            },
            {
                "title": "灵寿县",
                "code": "130126"
            },
            {
                "title": "高邑县",
                "code": "130127"
            },
            {
                "title": "深泽县",
                "code": "130128"
            },
            {
                "title": "赞皇县",
                "code": "130129"
            },
            {
                "title": "无极县",
                "code": "130130"
            },
            {
                "title": "平山县",
                "code": "130131"
            },
            {
                "title": "元氏县",
                "code": "130132"
            },
            {
                "title": "赵县",
                "code": "130133"
            },
            {
                "title": "辛集市",
                "code": "130181"
            },
            {
                "title": "晋州市",
                "code": "130183"
            },
            {
                "title": "新乐市",
                "code": "130184"
            }
            ]
        },
        {
            "title": "唐山",
            "code": "130200",
            "children": [{
                "title": "路南区",
                "code": "130202"
            },
            {
                "title": "路北区",
                "code": "130203"
            },
            {
                "title": "古冶区",
                "code": "130204"
            },
            {
                "title": "开平区",
                "code": "130205"
            },
            {
                "title": "丰南区",
                "code": "130207"
            },
            {
                "title": "丰润区",
                "code": "130208"
            },
            {
                "title": "曹妃甸区",
                "code": "130209"
            },
            {
                "title": "滦县",
                "code": "130223"
            },
            {
                "title": "滦南县",
                "code": "130224"
            },
            {
                "title": "乐亭县",
                "code": "130225"
            },
            {
                "title": "迁西县",
                "code": "130227"
            },
            {
                "title": "玉田县",
                "code": "130229"
            },
            {
                "title": "遵化市",
                "code": "130281"
            },
            {
                "title": "迁安市",
                "code": "130283"
            }
            ]
        },
        {
            "title": "秦皇岛",
            "code": "130300",
            "children": [{
                "title": "海港区",
                "code": "130302"
            },
            {
                "title": "山海关区",
                "code": "130303"
            },
            {
                "title": "北戴河区",
                "code": "130304"
            },
            {
                "title": "青龙满族自治县",
                "code": "130321"
            },
            {
                "title": "昌黎县",
                "code": "130322"
            },
            {
                "title": "抚宁县",
                "code": "130323"
            },
            {
                "title": "卢龙县",
                "code": "130324"
            }
            ]
        },
        {
            "title": "邯郸",
            "code": "130400",
            "children": [{
                "title": "邯山区",
                "code": "130402"
            },
            {
                "title": "丛台区",
                "code": "130403"
            },
            {
                "title": "复兴区",
                "code": "130404"
            },
            {
                "title": "峰峰矿区",
                "code": "130406"
            },
            {
                "title": "邯郸县",
                "code": "130421"
            },
            {
                "title": "临漳县",
                "code": "130423"
            },
            {
                "title": "成安县",
                "code": "130424"
            },
            {
                "title": "大名县",
                "code": "130425"
            },
            {
                "title": "涉县",
                "code": "130426"
            },
            {
                "title": "磁县",
                "code": "130427"
            },
            {
                "title": "肥乡县",
                "code": "130428"
            },
            {
                "title": "永年县",
                "code": "130429"
            },
            {
                "title": "邱县",
                "code": "130430"
            },
            {
                "title": "鸡泽县",
                "code": "130431"
            },
            {
                "title": "广平县",
                "code": "130432"
            },
            {
                "title": "馆陶县",
                "code": "130433"
            },
            {
                "title": "魏县",
                "code": "130434"
            },
            {
                "title": "曲周县",
                "code": "130435"
            },
            {
                "title": "武安市",
                "code": "130481"
            }
            ]
        },
        {
            "title": "邢台",
            "code": "130500",
            "children": [{
                "title": "桥东区",
                "code": "130502"
            },
            {
                "title": "桥西区",
                "code": "130503"
            },
            {
                "title": "邢台县",
                "code": "130521"
            },
            {
                "title": "临城县",
                "code": "130522"
            },
            {
                "title": "内丘县",
                "code": "130523"
            },
            {
                "title": "柏乡县",
                "code": "130524"
            },
            {
                "title": "隆尧县",
                "code": "130525"
            },
            {
                "title": "任县",
                "code": "130526"
            },
            {
                "title": "南和县",
                "code": "130527"
            },
            {
                "title": "宁晋县",
                "code": "130528"
            },
            {
                "title": "巨鹿县",
                "code": "130529"
            },
            {
                "title": "新河县",
                "code": "130530"
            },
            {
                "title": "广宗县",
                "code": "130531"
            },
            {
                "title": "平乡县",
                "code": "130532"
            },
            {
                "title": "威县",
                "code": "130533"
            },
            {
                "title": "清河县",
                "code": "130534"
            },
            {
                "title": "临西县",
                "code": "130535"
            },
            {
                "title": "南宫市",
                "code": "130581"
            },
            {
                "title": "沙河市",
                "code": "130582"
            }
            ]
        },
        {
            "title": "保定",
            "code": "130600",
            "children": [{
                "title": "新市区",
                "code": "130602"
            },
            {
                "title": "北市区",
                "code": "130603"
            },
            {
                "title": "南市区",
                "code": "130604"
            },
            {
                "title": "满城县",
                "code": "130621"
            },
            {
                "title": "清苑县",
                "code": "130622"
            },
            {
                "title": "涞水县",
                "code": "130623"
            },
            {
                "title": "阜平县",
                "code": "130624"
            },
            {
                "title": "徐水县",
                "code": "130625"
            },
            {
                "title": "定兴县",
                "code": "130626"
            },
            {
                "title": "唐县",
                "code": "130627"
            },
            {
                "title": "高阳县",
                "code": "130628"
            },
            {
                "title": "容城县",
                "code": "130629"
            },
            {
                "title": "涞源县",
                "code": "130630"
            },
            {
                "title": "望都县",
                "code": "130631"
            },
            {
                "title": "安新县",
                "code": "130632"
            },
            {
                "title": "易县",
                "code": "130633"
            },
            {
                "title": "曲阳县",
                "code": "130634"
            },
            {
                "title": "蠡县",
                "code": "130635"
            },
            {
                "title": "顺平县",
                "code": "130636"
            },
            {
                "title": "博野县",
                "code": "130637"
            },
            {
                "title": "雄县",
                "code": "130638"
            },
            {
                "title": "涿州市",
                "code": "130681"
            },
            {
                "title": "定州市",
                "code": "130682"
            },
            {
                "title": "安国市",
                "code": "130683"
            },
            {
                "title": "高碑店市",
                "code": "130684"
            }
            ]
        },
        {
            "title": "张家口",
            "code": "130700",
            "children": [{
                "title": "桥东区",
                "code": "130702"
            },
            {
                "title": "桥西区",
                "code": "130703"
            },
            {
                "title": "宣化区",
                "code": "130705"
            },
            {
                "title": "下花园区",
                "code": "130706"
            },
            {
                "title": "宣化县",
                "code": "130721"
            },
            {
                "title": "张北县",
                "code": "130722"
            },
            {
                "title": "康保县",
                "code": "130723"
            },
            {
                "title": "沽源县",
                "code": "130724"
            },
            {
                "title": "尚义县",
                "code": "130725"
            },
            {
                "title": "蔚县",
                "code": "130726"
            },
            {
                "title": "阳原县",
                "code": "130727"
            },
            {
                "title": "怀安县",
                "code": "130728"
            },
            {
                "title": "万全县",
                "code": "130729"
            },
            {
                "title": "怀来县",
                "code": "130730"
            },
            {
                "title": "涿鹿县",
                "code": "130731"
            },
            {
                "title": "赤城县",
                "code": "130732"
            },
            {
                "title": "崇礼县",
                "code": "130733"
            }
            ]
        },
        {
            "title": "承德",
            "code": "130800",
            "children": [{
                "title": "双桥区",
                "code": "130802"
            },
            {
                "title": "双滦区",
                "code": "130803"
            },
            {
                "title": "鹰手营子矿区",
                "code": "130804"
            },
            {
                "title": "承德县",
                "code": "130821"
            },
            {
                "title": "兴隆县",
                "code": "130822"
            },
            {
                "title": "平泉县",
                "code": "130823"
            },
            {
                "title": "滦平县",
                "code": "130824"
            },
            {
                "title": "隆化县",
                "code": "130825"
            },
            {
                "title": "丰宁满族自治县",
                "code": "130826"
            },
            {
                "title": "宽城满族自治县",
                "code": "130827"
            },
            {
                "title": "围场满族蒙古族自治县",
                "code": "130828"
            }
            ]
        },
        {
            "title": "沧州",
            "code": "130900",
            "children": [{
                "title": "新华区",
                "code": "130902"
            },
            {
                "title": "运河区",
                "code": "130903"
            },
            {
                "title": "沧县",
                "code": "130921"
            },
            {
                "title": "青县",
                "code": "130922"
            },
            {
                "title": "东光县",
                "code": "130923"
            },
            {
                "title": "海兴县",
                "code": "130924"
            },
            {
                "title": "盐山县",
                "code": "130925"
            },
            {
                "title": "肃宁县",
                "code": "130926"
            },
            {
                "title": "南皮县",
                "code": "130927"
            },
            {
                "title": "吴桥县",
                "code": "130928"
            },
            {
                "title": "献县",
                "code": "130929"
            },
            {
                "title": "孟村回族自治县",
                "code": "130930"
            },
            {
                "title": "泊头市",
                "code": "130981"
            },
            {
                "title": "任丘市",
                "code": "130982"
            },
            {
                "title": "黄骅市",
                "code": "130983"
            },
            {
                "title": "河间市",
                "code": "130984"
            }
            ]
        },
        {
            "title": "廊坊",
            "code": "131000",
            "children": [{
                "title": "安次区",
                "code": "131002"
            },
            {
                "title": "广阳区",
                "code": "131003"
            },
            {
                "title": "固安县",
                "code": "131022"
            },
            {
                "title": "永清县",
                "code": "131023"
            },
            {
                "title": "香河县",
                "code": "131024"
            },
            {
                "title": "大城县",
                "code": "131025"
            },
            {
                "title": "文安县",
                "code": "131026"
            },
            {
                "title": "大厂回族自治县",
                "code": "131028"
            },
            {
                "title": "霸州市",
                "code": "131081"
            },
            {
                "title": "三河市",
                "code": "131082"
            }
            ]
        },
        {
            "title": "衡水",
            "code": "131100",
            "children": [{
                "title": "桃城区",
                "code": "131102"
            },
            {
                "title": "枣强县",
                "code": "131121"
            },
            {
                "title": "武邑县",
                "code": "131122"
            },
            {
                "title": "武强县",
                "code": "131123"
            },
            {
                "title": "饶阳县",
                "code": "131124"
            },
            {
                "title": "安平县",
                "code": "131125"
            },
            {
                "title": "故城县",
                "code": "131126"
            },
            {
                "title": "景县",
                "code": "131127"
            },
            {
                "title": "阜城县",
                "code": "131128"
            },
            {
                "title": "冀州市",
                "code": "131181"
            },
            {
                "title": "深州市",
                "code": "131182"
            }
            ]
        }
        ]
    },
    {
        "title": "山西",
        "code": "140000",
        "children": [{
            "title": "太原",
            "code": "140100",
            "children": [{
                "title": "小店区",
                "code": "140105"
            },
            {
                "title": "迎泽区",
                "code": "140106"
            },
            {
                "title": "杏花岭区",
                "code": "140107"
            },
            {
                "title": "尖草坪区",
                "code": "140108"
            },
            {
                "title": "万柏林区",
                "code": "140109"
            },
            {
                "title": "晋源区",
                "code": "140110"
            },
            {
                "title": "清徐县",
                "code": "140121"
            },
            {
                "title": "阳曲县",
                "code": "140122"
            },
            {
                "title": "娄烦县",
                "code": "140123"
            },
            {
                "title": "古交市",
                "code": "140181"
            }
            ]
        },
        {
            "title": "大同",
            "code": "140200",
            "children": [{
                "title": "城区",
                "code": "140202"
            },
            {
                "title": "矿区",
                "code": "140203"
            },
            {
                "title": "南郊区",
                "code": "140211"
            },
            {
                "title": "新荣区",
                "code": "140212"
            },
            {
                "title": "阳高县",
                "code": "140221"
            },
            {
                "title": "天镇县",
                "code": "140222"
            },
            {
                "title": "广灵县",
                "code": "140223"
            },
            {
                "title": "灵丘县",
                "code": "140224"
            },
            {
                "title": "浑源县",
                "code": "140225"
            },
            {
                "title": "左云县",
                "code": "140226"
            },
            {
                "title": "大同县",
                "code": "140227"
            }
            ]
        },
        {
            "title": "阳泉",
            "code": "140300",
            "children": [{
                "title": "城区",
                "code": "140302"
            },
            {
                "title": "矿区",
                "code": "140303"
            },
            {
                "title": "郊区",
                "code": "140311"
            },
            {
                "title": "平定县",
                "code": "140321"
            },
            {
                "title": "盂县",
                "code": "140322"
            }
            ]
        },
        {
            "title": "长治",
            "code": "140400",
            "children": [{
                "title": "城区",
                "code": "140402"
            },
            {
                "title": "郊区",
                "code": "140411"
            },
            {
                "title": "长治县",
                "code": "140421"
            },
            {
                "title": "襄垣县",
                "code": "140423"
            },
            {
                "title": "屯留县",
                "code": "140424"
            },
            {
                "title": "平顺县",
                "code": "140425"
            },
            {
                "title": "黎城县",
                "code": "140426"
            },
            {
                "title": "壶关县",
                "code": "140427"
            },
            {
                "title": "长子县",
                "code": "140428"
            },
            {
                "title": "武乡县",
                "code": "140429"
            },
            {
                "title": "沁县",
                "code": "140430"
            },
            {
                "title": "沁源县",
                "code": "140431"
            },
            {
                "title": "潞城市",
                "code": "140481"
            }
            ]
        },
        {
            "title": "晋城",
            "code": "140500",
            "children": [{
                "title": "城区",
                "code": "140502"
            },
            {
                "title": "沁水县",
                "code": "140521"
            },
            {
                "title": "阳城县",
                "code": "140522"
            },
            {
                "title": "陵川县",
                "code": "140524"
            },
            {
                "title": "泽州县",
                "code": "140525"
            },
            {
                "title": "高平市",
                "code": "140581"
            }
            ]
        },
        {
            "title": "朔州",
            "code": "140600",
            "children": [{
                "title": "朔城区",
                "code": "140602"
            },
            {
                "title": "平鲁区",
                "code": "140603"
            },
            {
                "title": "山阴县",
                "code": "140621"
            },
            {
                "title": "应县",
                "code": "140622"
            },
            {
                "title": "右玉县",
                "code": "140623"
            },
            {
                "title": "怀仁县",
                "code": "140624"
            }
            ]
        },
        {
            "title": "晋中",
            "code": "140700",
            "children": [{
                "title": "榆次区",
                "code": "140702"
            },
            {
                "title": "榆社县",
                "code": "140721"
            },
            {
                "title": "左权县",
                "code": "140722"
            },
            {
                "title": "和顺县",
                "code": "140723"
            },
            {
                "title": "昔阳县",
                "code": "140724"
            },
            {
                "title": "寿阳县",
                "code": "140725"
            },
            {
                "title": "太谷县",
                "code": "140726"
            },
            {
                "title": "祁县",
                "code": "140727"
            },
            {
                "title": "平遥县",
                "code": "140728"
            },
            {
                "title": "灵石县",
                "code": "140729"
            },
            {
                "title": "介休市",
                "code": "140781"
            }
            ]
        },
        {
            "title": "运城",
            "code": "140800",
            "children": [{
                "title": "盐湖区",
                "code": "140802"
            },
            {
                "title": "临猗县",
                "code": "140821"
            },
            {
                "title": "万荣县",
                "code": "140822"
            },
            {
                "title": "闻喜县",
                "code": "140823"
            },
            {
                "title": "稷山县",
                "code": "140824"
            },
            {
                "title": "新绛县",
                "code": "140825"
            },
            {
                "title": "绛县",
                "code": "140826"
            },
            {
                "title": "垣曲县",
                "code": "140827"
            },
            {
                "title": "夏县",
                "code": "140828"
            },
            {
                "title": "平陆县",
                "code": "140829"
            },
            {
                "title": "芮城县",
                "code": "140830"
            },
            {
                "title": "永济市",
                "code": "140881"
            },
            {
                "title": "河津市",
                "code": "140882"
            }
            ]
        },
        {
            "title": "忻州",
            "code": "140900",
            "children": [{
                "title": "忻府区",
                "code": "140902"
            },
            {
                "title": "定襄县",
                "code": "140921"
            },
            {
                "title": "五台县",
                "code": "140922"
            },
            {
                "title": "代县",
                "code": "140923"
            },
            {
                "title": "繁峙县",
                "code": "140924"
            },
            {
                "title": "宁武县",
                "code": "140925"
            },
            {
                "title": "静乐县",
                "code": "140926"
            },
            {
                "title": "神池县",
                "code": "140927"
            },
            {
                "title": "五寨县",
                "code": "140928"
            },
            {
                "title": "岢岚县",
                "code": "140929"
            },
            {
                "title": "河曲县",
                "code": "140930"
            },
            {
                "title": "保德县",
                "code": "140931"
            },
            {
                "title": "偏关县",
                "code": "140932"
            },
            {
                "title": "原平市",
                "code": "140981"
            }
            ]
        },
        {
            "title": "临汾",
            "code": "141000",
            "children": [{
                "title": "尧都区",
                "code": "141002"
            },
            {
                "title": "曲沃县",
                "code": "141021"
            },
            {
                "title": "翼城县",
                "code": "141022"
            },
            {
                "title": "襄汾县",
                "code": "141023"
            },
            {
                "title": "洪洞县",
                "code": "141024"
            },
            {
                "title": "古县",
                "code": "141025"
            },
            {
                "title": "安泽县",
                "code": "141026"
            },
            {
                "title": "浮山县",
                "code": "141027"
            },
            {
                "title": "吉县",
                "code": "141028"
            },
            {
                "title": "乡宁县",
                "code": "141029"
            },
            {
                "title": "大宁县",
                "code": "141030"
            },
            {
                "title": "隰县",
                "code": "141031"
            },
            {
                "title": "永和县",
                "code": "141032"
            },
            {
                "title": "蒲县",
                "code": "141033"
            },
            {
                "title": "汾西县",
                "code": "141034"
            },
            {
                "title": "侯马市",
                "code": "141081"
            },
            {
                "title": "霍州市",
                "code": "141082"
            }
            ]
        },
        {
            "title": "吕梁",
            "code": "141100",
            "children": [{
                "title": "离石区",
                "code": "141102"
            },
            {
                "title": "文水县",
                "code": "141121"
            },
            {
                "title": "交城县",
                "code": "141122"
            },
            {
                "title": "兴县",
                "code": "141123"
            },
            {
                "title": "临县",
                "code": "141124"
            },
            {
                "title": "柳林县",
                "code": "141125"
            },
            {
                "title": "石楼县",
                "code": "141126"
            },
            {
                "title": "岚县",
                "code": "141127"
            },
            {
                "title": "方山县",
                "code": "141128"
            },
            {
                "title": "中阳县",
                "code": "141129"
            },
            {
                "title": "交口县",
                "code": "141130"
            },
            {
                "title": "孝义市",
                "code": "141181"
            },
            {
                "title": "汾阳市",
                "code": "141182"
            }
            ]
        }
        ]
    },
    {
        "title": "内蒙古",
        "code": "150000",
        "children": [{
            "title": "呼和浩特",
            "code": "150100",
            "children": [{
                "title": "新城区",
                "code": "150102"
            },
            {
                "title": "回民区",
                "code": "150103"
            },
            {
                "title": "玉泉区",
                "code": "150104"
            },
            {
                "title": "赛罕区",
                "code": "150105"
            },
            {
                "title": "土默特左旗",
                "code": "150121"
            },
            {
                "title": "托克托县",
                "code": "150122"
            },
            {
                "title": "和林格尔县",
                "code": "150123"
            },
            {
                "title": "清水河县",
                "code": "150124"
            },
            {
                "title": "武川县",
                "code": "150125"
            }
            ]
        },
        {
            "title": "包头",
            "code": "150200",
            "children": [{
                "title": "东河区",
                "code": "150202"
            },
            {
                "title": "昆都仑区",
                "code": "150203"
            },
            {
                "title": "青山区",
                "code": "150204"
            },
            {
                "title": "石拐区",
                "code": "150205"
            },
            {
                "title": "白云鄂博矿区",
                "code": "150206"
            },
            {
                "title": "九原区",
                "code": "150207"
            },
            {
                "title": "土默特右旗",
                "code": "150221"
            },
            {
                "title": "固阳县",
                "code": "150222"
            },
            {
                "title": "达尔罕茂明安联合旗",
                "code": "150223"
            }
            ]
        },
        {
            "title": "乌海",
            "code": "150300",
            "children": [{
                "title": "海勃湾区",
                "code": "150302"
            },
            {
                "title": "海南区",
                "code": "150303"
            },
            {
                "title": "乌达区",
                "code": "150304"
            }
            ]
        },
        {
            "title": "赤峰",
            "code": "150400",
            "children": [{
                "title": "红山区",
                "code": "150402"
            },
            {
                "title": "元宝山区",
                "code": "150403"
            },
            {
                "title": "松山区",
                "code": "150404"
            },
            {
                "title": "阿鲁科尔沁旗",
                "code": "150421"
            },
            {
                "title": "巴林左旗",
                "code": "150422"
            },
            {
                "title": "巴林右旗",
                "code": "150423"
            },
            {
                "title": "林西县",
                "code": "150424"
            },
            {
                "title": "克什克腾旗",
                "code": "150425"
            },
            {
                "title": "翁牛特旗",
                "code": "150426"
            },
            {
                "title": "喀喇沁旗",
                "code": "150428"
            },
            {
                "title": "宁城县",
                "code": "150429"
            },
            {
                "title": "敖汉旗",
                "code": "150430"
            }
            ]
        },
        {
            "title": "通辽",
            "code": "150500",
            "children": [{
                "title": "科尔沁区",
                "code": "150502"
            },
            {
                "title": "科尔沁左翼中旗",
                "code": "150521"
            },
            {
                "title": "科尔沁左翼后旗",
                "code": "150522"
            },
            {
                "title": "开鲁县",
                "code": "150523"
            },
            {
                "title": "库伦旗",
                "code": "150524"
            },
            {
                "title": "奈曼旗",
                "code": "150525"
            },
            {
                "title": "扎鲁特旗",
                "code": "150526"
            },
            {
                "title": "霍林郭勒市",
                "code": "150581"
            }
            ]
        },
        {
            "title": "鄂尔多斯",
            "code": "150600",
            "children": [{
                "title": "东胜区",
                "code": "150602"
            },
            {
                "title": "达拉特旗",
                "code": "150621"
            },
            {
                "title": "准格尔旗",
                "code": "150622"
            },
            {
                "title": "鄂托克前旗",
                "code": "150623"
            },
            {
                "title": "鄂托克旗",
                "code": "150624"
            },
            {
                "title": "杭锦旗",
                "code": "150625"
            },
            {
                "title": "乌审旗",
                "code": "150626"
            },
            {
                "title": "伊金霍洛旗",
                "code": "150627"
            }
            ]
        },
        {
            "title": "呼伦贝尔",
            "code": "150700",
            "children": [{
                "title": "海拉尔区",
                "code": "150702"
            },
            {
                "title": "扎赉诺尔区",
                "code": "150703"
            },
            {
                "title": "阿荣旗",
                "code": "150721"
            },
            {
                "title": "莫力达瓦达斡尔族自治旗",
                "code": "150722"
            },
            {
                "title": "鄂伦春自治旗",
                "code": "150723"
            },
            {
                "title": "鄂温克族自治旗",
                "code": "150724"
            },
            {
                "title": "陈巴尔虎旗",
                "code": "150725"
            },
            {
                "title": "新巴尔虎左旗",
                "code": "150726"
            },
            {
                "title": "新巴尔虎右旗",
                "code": "150727"
            },
            {
                "title": "满洲里市",
                "code": "150781"
            },
            {
                "title": "牙克石市",
                "code": "150782"
            },
            {
                "title": "扎兰屯市",
                "code": "150783"
            },
            {
                "title": "额尔古纳市",
                "code": "150784"
            },
            {
                "title": "根河市",
                "code": "150785"
            }
            ]
        },
        {
            "title": "巴彦淖尔",
            "code": "150800",
            "children": [{
                "title": "临河区",
                "code": "150802"
            },
            {
                "title": "五原县",
                "code": "150821"
            },
            {
                "title": "磴口县",
                "code": "150822"
            },
            {
                "title": "乌拉特前旗",
                "code": "150823"
            },
            {
                "title": "乌拉特中旗",
                "code": "150824"
            },
            {
                "title": "乌拉特后旗",
                "code": "150825"
            },
            {
                "title": "杭锦后旗",
                "code": "150826"
            }
            ]
        },
        {
            "title": "乌兰察布",
            "code": "150900",
            "children": [{
                "title": "集宁区",
                "code": "150902"
            },
            {
                "title": "卓资县",
                "code": "150921"
            },
            {
                "title": "化德县",
                "code": "150922"
            },
            {
                "title": "商都县",
                "code": "150923"
            },
            {
                "title": "兴和县",
                "code": "150924"
            },
            {
                "title": "凉城县",
                "code": "150925"
            },
            {
                "title": "察哈尔右翼前旗",
                "code": "150926"
            },
            {
                "title": "察哈尔右翼中旗",
                "code": "150927"
            },
            {
                "title": "察哈尔右翼后旗",
                "code": "150928"
            },
            {
                "title": "四子王旗",
                "code": "150929"
            },
            {
                "title": "丰镇市",
                "code": "150981"
            }
            ]
        },
        {
            "title": "兴安盟",
            "code": "152200",
            "children": [{
                "title": "乌兰浩特市",
                "code": "152201"
            },
            {
                "title": "阿尔山市",
                "code": "152202"
            },
            {
                "title": "科尔沁右翼前旗",
                "code": "152221"
            },
            {
                "title": "科尔沁右翼中旗",
                "code": "152222"
            },
            {
                "title": "扎赉特旗",
                "code": "152223"
            },
            {
                "title": "突泉县",
                "code": "152224"
            }
            ]
        },
        {
            "title": "锡林郭勒盟",
            "code": "152500",
            "children": [{
                "title": "二连浩特市",
                "code": "152501"
            },
            {
                "title": "锡林浩特市",
                "code": "152502"
            },
            {
                "title": "阿巴嘎旗",
                "code": "152522"
            },
            {
                "title": "苏尼特左旗",
                "code": "152523"
            },
            {
                "title": "苏尼特右旗",
                "code": "152524"
            },
            {
                "title": "东乌珠穆沁旗",
                "code": "152525"
            },
            {
                "title": "西乌珠穆沁旗",
                "code": "152526"
            },
            {
                "title": "太仆寺旗",
                "code": "152527"
            },
            {
                "title": "镶黄旗",
                "code": "152528"
            },
            {
                "title": "正镶白旗",
                "code": "152529"
            },
            {
                "title": "正蓝旗",
                "code": "152530"
            },
            {
                "title": "多伦县",
                "code": "152531"
            }
            ]
        },
        {
            "title": "阿拉善盟",
            "code": "152900",
            "children": [{
                "title": "阿拉善左旗",
                "code": "152921"
            },
            {
                "title": "阿拉善右旗",
                "code": "152922"
            },
            {
                "title": "额济纳旗",
                "code": "152923"
            }
            ]
        }
        ]
    },
    {
        "title": "辽宁",
        "code": "210000",
        "children": [{
            "title": "沈阳",
            "code": "210100",
            "children": [{
                "title": "和平区",
                "code": "210102"
            },
            {
                "title": "沈河区",
                "code": "210103"
            },
            {
                "title": "大东区",
                "code": "210104"
            },
            {
                "title": "皇姑区",
                "code": "210105"
            },
            {
                "title": "铁西区",
                "code": "210106"
            },
            {
                "title": "苏家屯区",
                "code": "210111"
            },
            {
                "title": "浑南区",
                "code": "210112"
            },
            {
                "title": "沈北新区",
                "code": "210113"
            },
            {
                "title": "于洪区",
                "code": "210114"
            },
            {
                "title": "辽中县",
                "code": "210122"
            },
            {
                "title": "康平县",
                "code": "210123"
            },
            {
                "title": "法库县",
                "code": "210124"
            },
            {
                "title": "新民市",
                "code": "210181"
            }
            ]
        },
        {
            "title": "大连",
            "code": "210200",
            "children": [{
                "title": "中山区",
                "code": "210202"
            },
            {
                "title": "西岗区",
                "code": "210203"
            },
            {
                "title": "沙河口区",
                "code": "210204"
            },
            {
                "title": "甘井子区",
                "code": "210211"
            },
            {
                "title": "旅顺口区",
                "code": "210212"
            },
            {
                "title": "金州区",
                "code": "210213"
            },
            {
                "title": "长海县",
                "code": "210224"
            },
            {
                "title": "瓦房店市",
                "code": "210281"
            },
            {
                "title": "普兰店市",
                "code": "210282"
            },
            {
                "title": "庄河市",
                "code": "210283"
            }
            ]
        },
        {
            "title": "鞍山",
            "code": "210300",
            "children": [{
                "title": "铁东区",
                "code": "210302"
            },
            {
                "title": "铁西区",
                "code": "210303"
            },
            {
                "title": "立山区",
                "code": "210304"
            },
            {
                "title": "千山区",
                "code": "210311"
            },
            {
                "title": "台安县",
                "code": "210321"
            },
            {
                "title": "岫岩满族自治县",
                "code": "210323"
            },
            {
                "title": "海城市",
                "code": "210381"
            }
            ]
        },
        {
            "title": "抚顺",
            "code": "210400",
            "children": [{
                "title": "新抚区",
                "code": "210402"
            },
            {
                "title": "东洲区",
                "code": "210403"
            },
            {
                "title": "望花区",
                "code": "210404"
            },
            {
                "title": "顺城区",
                "code": "210411"
            },
            {
                "title": "抚顺县",
                "code": "210421"
            },
            {
                "title": "新宾满族自治县",
                "code": "210422"
            },
            {
                "title": "清原满族自治县",
                "code": "210423"
            }
            ]
        },
        {
            "title": "本溪",
            "code": "210500",
            "children": [{
                "title": "平山区",
                "code": "210502"
            },
            {
                "title": "溪湖区",
                "code": "210503"
            },
            {
                "title": "明山区",
                "code": "210504"
            },
            {
                "title": "南芬区",
                "code": "210505"
            },
            {
                "title": "本溪满族自治县",
                "code": "210521"
            },
            {
                "title": "桓仁满族自治县",
                "code": "210522"
            }
            ]
        },
        {
            "title": "丹东",
            "code": "210600",
            "children": [{
                "title": "元宝区",
                "code": "210602"
            },
            {
                "title": "振兴区",
                "code": "210603"
            },
            {
                "title": "振安区",
                "code": "210604"
            },
            {
                "title": "宽甸满族自治县",
                "code": "210624"
            },
            {
                "title": "东港市",
                "code": "210681"
            },
            {
                "title": "凤城市",
                "code": "210682"
            }
            ]
        },
        {
            "title": "锦州",
            "code": "210700",
            "children": [{
                "title": "古塔区",
                "code": "210702"
            },
            {
                "title": "凌河区",
                "code": "210703"
            },
            {
                "title": "太和区",
                "code": "210711"
            },
            {
                "title": "黑山县",
                "code": "210726"
            },
            {
                "title": "义县",
                "code": "210727"
            },
            {
                "title": "凌海市",
                "code": "210781"
            },
            {
                "title": "北镇市",
                "code": "210782"
            }
            ]
        },
        {
            "title": "营口",
            "code": "210800",
            "children": [{
                "title": "站前区",
                "code": "210802"
            },
            {
                "title": "西市区",
                "code": "210803"
            },
            {
                "title": "鲅鱼圈区",
                "code": "210804"
            },
            {
                "title": "老边区",
                "code": "210811"
            },
            {
                "title": "盖州市",
                "code": "210881"
            },
            {
                "title": "大石桥市",
                "code": "210882"
            }
            ]
        },
        {
            "title": "阜新",
            "code": "210900",
            "children": [{
                "title": "海州区",
                "code": "210902"
            },
            {
                "title": "新邱区",
                "code": "210903"
            },
            {
                "title": "太平区",
                "code": "210904"
            },
            {
                "title": "清河门区",
                "code": "210905"
            },
            {
                "title": "细河区",
                "code": "210911"
            },
            {
                "title": "阜新蒙古族自治县",
                "code": "210921"
            },
            {
                "title": "彰武县",
                "code": "210922"
            }
            ]
        },
        {
            "title": "辽阳",
            "code": "211000",
            "children": [{
                "title": "白塔区",
                "code": "211002"
            },
            {
                "title": "文圣区",
                "code": "211003"
            },
            {
                "title": "宏伟区",
                "code": "211004"
            },
            {
                "title": "弓长岭区",
                "code": "211005"
            },
            {
                "title": "太子河区",
                "code": "211011"
            },
            {
                "title": "辽阳县",
                "code": "211021"
            },
            {
                "title": "灯塔市",
                "code": "211081"
            }
            ]
        },
        {
            "title": "盘锦",
            "code": "211100",
            "children": [{
                "title": "双台子区",
                "code": "211102"
            },
            {
                "title": "兴隆台区",
                "code": "211103"
            },
            {
                "title": "大洼县",
                "code": "211121"
            },
            {
                "title": "盘山县",
                "code": "211122"
            }
            ]
        },
        {
            "title": "铁岭",
            "code": "211200",
            "children": [{
                "title": "银州区",
                "code": "211202"
            },
            {
                "title": "清河区",
                "code": "211204"
            },
            {
                "title": "铁岭县",
                "code": "211221"
            },
            {
                "title": "西丰县",
                "code": "211223"
            },
            {
                "title": "昌图县",
                "code": "211224"
            },
            {
                "title": "调兵山市",
                "code": "211281"
            },
            {
                "title": "开原市",
                "code": "211282"
            }
            ]
        },
        {
            "title": "朝阳",
            "code": "211300",
            "children": [{
                "title": "双塔区",
                "code": "211302"
            },
            {
                "title": "龙城区",
                "code": "211303"
            },
            {
                "title": "朝阳县",
                "code": "211321"
            },
            {
                "title": "建平县",
                "code": "211322"
            },
            {
                "title": "喀喇沁左翼蒙古族自治县",
                "code": "211324"
            },
            {
                "title": "北票市",
                "code": "211381"
            },
            {
                "title": "凌源市",
                "code": "211382"
            }
            ]
        },
        {
            "title": "葫芦岛",
            "code": "211400",
            "children": [{
                "title": "连山区",
                "code": "211402"
            },
            {
                "title": "龙港区",
                "code": "211403"
            },
            {
                "title": "南票区",
                "code": "211404"
            },
            {
                "title": "绥中县",
                "code": "211421"
            },
            {
                "title": "建昌县",
                "code": "211422"
            },
            {
                "title": "兴城市",
                "code": "211481"
            }
            ]
        }
        ]
    },
    {
        "title": "吉林",
        "code": "220000",
        "children": [{
            "title": "长春",
            "code": "220100",
            "children": [{
                "title": "南关区",
                "code": "220102"
            },
            {
                "title": "宽城区",
                "code": "220103"
            },
            {
                "title": "朝阳区",
                "code": "220104"
            },
            {
                "title": "二道区",
                "code": "220105"
            },
            {
                "title": "绿园区",
                "code": "220106"
            },
            {
                "title": "双阳区",
                "code": "220112"
            },
            {
                "title": "九台区",
                "code": "220113"
            },
            {
                "title": "农安县",
                "code": "220122"
            },
            {
                "title": "榆树市",
                "code": "220182"
            },
            {
                "title": "德惠市",
                "code": "220183"
            }
            ]
        },
        {
            "title": "吉林",
            "code": "220200",
            "children": [{
                "title": "昌邑区",
                "code": "220202"
            },
            {
                "title": "龙潭区",
                "code": "220203"
            },
            {
                "title": "船营区",
                "code": "220204"
            },
            {
                "title": "丰满区",
                "code": "220211"
            },
            {
                "title": "永吉县",
                "code": "220221"
            },
            {
                "title": "蛟河市",
                "code": "220281"
            },
            {
                "title": "桦甸市",
                "code": "220282"
            },
            {
                "title": "舒兰市",
                "code": "220283"
            },
            {
                "title": "磐石市",
                "code": "220284"
            }
            ]
        },
        {
            "title": "四平",
            "code": "220300",
            "children": [{
                "title": "铁西区",
                "code": "220302"
            },
            {
                "title": "铁东区",
                "code": "220303"
            },
            {
                "title": "梨树县",
                "code": "220322"
            },
            {
                "title": "伊通满族自治县",
                "code": "220323"
            },
            {
                "title": "公主岭市",
                "code": "220381"
            },
            {
                "title": "双辽市",
                "code": "220382"
            }
            ]
        },
        {
            "title": "辽源",
            "code": "220400",
            "children": [{
                "title": "龙山区",
                "code": "220402"
            },
            {
                "title": "西安区",
                "code": "220403"
            },
            {
                "title": "东丰县",
                "code": "220421"
            },
            {
                "title": "东辽县",
                "code": "220422"
            }
            ]
        },
        {
            "title": "通化",
            "code": "220500",
            "children": [{
                "title": "东昌区",
                "code": "220502"
            },
            {
                "title": "二道江区",
                "code": "220503"
            },
            {
                "title": "通化县",
                "code": "220521"
            },
            {
                "title": "辉南县",
                "code": "220523"
            },
            {
                "title": "柳河县",
                "code": "220524"
            },
            {
                "title": "梅河口市",
                "code": "220581"
            },
            {
                "title": "集安市",
                "code": "220582"
            }
            ]
        },
        {
            "title": "白山",
            "code": "220600",
            "children": [{
                "title": "浑江区",
                "code": "220602"
            },
            {
                "title": "江源区",
                "code": "220605"
            },
            {
                "title": "抚松县",
                "code": "220621"
            },
            {
                "title": "靖宇县",
                "code": "220622"
            },
            {
                "title": "长白朝鲜族自治县",
                "code": "220623"
            },
            {
                "title": "临江市",
                "code": "220681"
            }
            ]
        },
        {
            "title": "松原",
            "code": "220700",
            "children": [{
                "title": "宁江区",
                "code": "220702"
            },
            {
                "title": "前郭尔罗斯蒙古族自治县",
                "code": "220721"
            },
            {
                "title": "长岭县",
                "code": "220722"
            },
            {
                "title": "乾安县",
                "code": "220723"
            },
            {
                "title": "扶余市",
                "code": "220781"
            }
            ]
        },
        {
            "title": "白城",
            "code": "220800",
            "children": [{
                "title": "洮北区",
                "code": "220802"
            },
            {
                "title": "镇赉县",
                "code": "220821"
            },
            {
                "title": "通榆县",
                "code": "220822"
            },
            {
                "title": "洮南市",
                "code": "220881"
            },
            {
                "title": "大安市",
                "code": "220882"
            }
            ]
        },
        {
            "title": "延边",
            "code": "222400",
            "children": [{
                "title": "延吉市",
                "code": "222401"
            },
            {
                "title": "图们市",
                "code": "222402"
            },
            {
                "title": "敦化市",
                "code": "222403"
            },
            {
                "title": "珲春市",
                "code": "222404"
            },
            {
                "title": "龙井市",
                "code": "222405"
            },
            {
                "title": "和龙市",
                "code": "222406"
            },
            {
                "title": "汪清县",
                "code": "222424"
            },
            {
                "title": "安图县",
                "code": "222426"
            }
            ]
        }
        ]
    },
    {
        "title": "黑龙江",
        "code": "230000",
        "children": [{
            "title": "哈尔滨",
            "code": "230100",
            "children": [{
                "title": "道里区",
                "code": "230102"
            },
            {
                "title": "南岗区",
                "code": "230103"
            },
            {
                "title": "道外区",
                "code": "230104"
            },
            {
                "title": "平房区",
                "code": "230108"
            },
            {
                "title": "松北区",
                "code": "230109"
            },
            {
                "title": "香坊区",
                "code": "230110"
            },
            {
                "title": "呼兰区",
                "code": "230111"
            },
            {
                "title": "阿城区",
                "code": "230112"
            },
            {
                "title": "双城区",
                "code": "230113"
            },
            {
                "title": "依兰县",
                "code": "230123"
            },
            {
                "title": "方正县",
                "code": "230124"
            },
            {
                "title": "宾县",
                "code": "230125"
            },
            {
                "title": "巴彦县",
                "code": "230126"
            },
            {
                "title": "木兰县",
                "code": "230127"
            },
            {
                "title": "通河县",
                "code": "230128"
            },
            {
                "title": "延寿县",
                "code": "230129"
            },
            {
                "title": "尚志市",
                "code": "230183"
            },
            {
                "title": "五常市",
                "code": "230184"
            }
            ]
        },
        {
            "title": "齐齐哈尔",
            "code": "230200",
            "children": [{
                "title": "龙沙区",
                "code": "230202"
            },
            {
                "title": "建华区",
                "code": "230203"
            },
            {
                "title": "铁锋区",
                "code": "230204"
            },
            {
                "title": "昂昂溪区",
                "code": "230205"
            },
            {
                "title": "富拉尔基区",
                "code": "230206"
            },
            {
                "title": "碾子山区",
                "code": "230207"
            },
            {
                "title": "梅里斯达斡尔族区",
                "code": "230208"
            },
            {
                "title": "龙江县",
                "code": "230221"
            },
            {
                "title": "依安县",
                "code": "230223"
            },
            {
                "title": "泰来县",
                "code": "230224"
            },
            {
                "title": "甘南县",
                "code": "230225"
            },
            {
                "title": "富裕县",
                "code": "230227"
            },
            {
                "title": "克山县",
                "code": "230229"
            },
            {
                "title": "克东县",
                "code": "230230"
            },
            {
                "title": "拜泉县",
                "code": "230231"
            },
            {
                "title": "讷河市",
                "code": "230281"
            }
            ]
        },
        {
            "title": "鸡西",
            "code": "230300",
            "children": [{
                "title": "鸡冠区",
                "code": "230302"
            },
            {
                "title": "恒山区",
                "code": "230303"
            },
            {
                "title": "滴道区",
                "code": "230304"
            },
            {
                "title": "梨树区",
                "code": "230305"
            },
            {
                "title": "城子河区",
                "code": "230306"
            },
            {
                "title": "麻山区",
                "code": "230307"
            },
            {
                "title": "鸡东县",
                "code": "230321"
            },
            {
                "title": "虎林市",
                "code": "230381"
            },
            {
                "title": "密山市",
                "code": "230382"
            }
            ]
        },
        {
            "title": "鹤岗",
            "code": "230400",
            "children": [{
                "title": "向阳区",
                "code": "230402"
            },
            {
                "title": "工农区",
                "code": "230403"
            },
            {
                "title": "南山区",
                "code": "230404"
            },
            {
                "title": "兴安区",
                "code": "230405"
            },
            {
                "title": "东山区",
                "code": "230406"
            },
            {
                "title": "兴山区",
                "code": "230407"
            },
            {
                "title": "萝北县",
                "code": "230421"
            },
            {
                "title": "绥滨县",
                "code": "230422"
            }
            ]
        },
        {
            "title": "双鸭山",
            "code": "230500",
            "children": [{
                "title": "尖山区",
                "code": "230502"
            },
            {
                "title": "岭东区",
                "code": "230503"
            },
            {
                "title": "四方台区",
                "code": "230505"
            },
            {
                "title": "宝山区",
                "code": "230506"
            },
            {
                "title": "集贤县",
                "code": "230521"
            },
            {
                "title": "友谊县",
                "code": "230522"
            },
            {
                "title": "宝清县",
                "code": "230523"
            },
            {
                "title": "饶河县",
                "code": "230524"
            }
            ]
        },
        {
            "title": "大庆",
            "code": "230600",
            "children": [{
                "title": "萨尔图区",
                "code": "230602"
            },
            {
                "title": "龙凤区",
                "code": "230603"
            },
            {
                "title": "让胡路区",
                "code": "230604"
            },
            {
                "title": "红岗区",
                "code": "230605"
            },
            {
                "title": "大同区",
                "code": "230606"
            },
            {
                "title": "肇州县",
                "code": "230621"
            },
            {
                "title": "肇源县",
                "code": "230622"
            },
            {
                "title": "林甸县",
                "code": "230623"
            },
            {
                "title": "杜尔伯特蒙古族自治县",
                "code": "230624"
            }
            ]
        },
        {
            "title": "伊春",
            "code": "230700",
            "children": [{
                "title": "伊春区",
                "code": "230702"
            },
            {
                "title": "南岔区",
                "code": "230703"
            },
            {
                "title": "友好区",
                "code": "230704"
            },
            {
                "title": "西林区",
                "code": "230705"
            },
            {
                "title": "翠峦区",
                "code": "230706"
            },
            {
                "title": "新青区",
                "code": "230707"
            },
            {
                "title": "美溪区",
                "code": "230708"
            },
            {
                "title": "金山屯区",
                "code": "230709"
            },
            {
                "title": "五营区",
                "code": "230710"
            },
            {
                "title": "乌马河区",
                "code": "230711"
            },
            {
                "title": "汤旺河区",
                "code": "230712"
            },
            {
                "title": "带岭区",
                "code": "230713"
            },
            {
                "title": "乌伊岭区",
                "code": "230714"
            },
            {
                "title": "红星区",
                "code": "230715"
            },
            {
                "title": "上甘岭区",
                "code": "230716"
            },
            {
                "title": "嘉荫县",
                "code": "230722"
            },
            {
                "title": "铁力市",
                "code": "230781"
            }
            ]
        },
        {
            "title": "佳木斯",
            "code": "230800",
            "children": [{
                "title": "向阳区",
                "code": "230803"
            },
            {
                "title": "前进区",
                "code": "230804"
            },
            {
                "title": "东风区",
                "code": "230805"
            },
            {
                "title": "郊区",
                "code": "230811"
            },
            {
                "title": "桦南县",
                "code": "230822"
            },
            {
                "title": "桦川县",
                "code": "230826"
            },
            {
                "title": "汤原县",
                "code": "230828"
            },
            {
                "title": "抚远县",
                "code": "230833"
            },
            {
                "title": "同江市",
                "code": "230881"
            },
            {
                "title": "富锦市",
                "code": "230882"
            }
            ]
        },
        {
            "title": "七台河",
            "code": "230900",
            "children": [{
                "title": "新兴区",
                "code": "230902"
            },
            {
                "title": "桃山区",
                "code": "230903"
            },
            {
                "title": "茄子河区",
                "code": "230904"
            },
            {
                "title": "勃利县",
                "code": "230921"
            }
            ]
        },
        {
            "title": "牡丹江",
            "code": "231000",
            "children": [{
                "title": "东安区",
                "code": "231002"
            },
            {
                "title": "阳明区",
                "code": "231003"
            },
            {
                "title": "爱民区",
                "code": "231004"
            },
            {
                "title": "西安区",
                "code": "231005"
            },
            {
                "title": "东宁县",
                "code": "231024"
            },
            {
                "title": "林口县",
                "code": "231025"
            },
            {
                "title": "绥芬河市",
                "code": "231081"
            },
            {
                "title": "海林市",
                "code": "231083"
            },
            {
                "title": "宁安市",
                "code": "231084"
            },
            {
                "title": "穆棱市",
                "code": "231085"
            }
            ]
        },
        {
            "title": "黑河",
            "code": "231100",
            "children": [{
                "title": "爱辉区",
                "code": "231102"
            },
            {
                "title": "嫩江县",
                "code": "231121"
            },
            {
                "title": "逊克县",
                "code": "231123"
            },
            {
                "title": "孙吴县",
                "code": "231124"
            },
            {
                "title": "北安市",
                "code": "231181"
            },
            {
                "title": "五大连池市",
                "code": "231182"
            }
            ]
        },
        {
            "title": "绥化",
            "code": "231200",
            "children": [{
                "title": "北林区",
                "code": "231202"
            },
            {
                "title": "望奎县",
                "code": "231221"
            },
            {
                "title": "兰西县",
                "code": "231222"
            },
            {
                "title": "青冈县",
                "code": "231223"
            },
            {
                "title": "庆安县",
                "code": "231224"
            },
            {
                "title": "明水县",
                "code": "231225"
            },
            {
                "title": "绥棱县",
                "code": "231226"
            },
            {
                "title": "安达市",
                "code": "231281"
            },
            {
                "title": "肇东市",
                "code": "231282"
            },
            {
                "title": "海伦市",
                "code": "231283"
            }
            ]
        },
        {
            "title": "大兴安岭",
            "code": "232700",
            "children": [{
                "title": "呼玛县",
                "code": "232721"
            },
            {
                "title": "塔河县",
                "code": "232722"
            },
            {
                "title": "漠河县",
                "code": "232723"
            }
            ]
        }
        ]
    },
    {
        "title": "上海",
        "code": "310000",
        "children": [{
            "title": "黄浦区",
            "code": "310101"
        },
        {
            "title": "徐汇区",
            "code": "310104"
        },
        {
            "title": "长宁区",
            "code": "310105"
        },
        {
            "title": "静安区",
            "code": "310106"
        },
        {
            "title": "普陀区",
            "code": "310107"
        },
        {
            "title": "闸北区",
            "code": "310108"
        },
        {
            "title": "虹口区",
            "code": "310109"
        },
        {
            "title": "杨浦区",
            "code": "310110"
        },
        {
            "title": "闵行区",
            "code": "310112"
        },
        {
            "title": "宝山区",
            "code": "310113"
        },
        {
            "title": "嘉定区",
            "code": "310114"
        },
        {
            "title": "浦东新区",
            "code": "310115"
        },
        {
            "title": "金山区",
            "code": "310116"
        },
        {
            "title": "松江区",
            "code": "310117"
        },
        {
            "title": "青浦区",
            "code": "310118"
        },
        {
            "title": "奉贤区",
            "code": "310120"
        },
        {
            "title": "崇明县",
            "code": "310230"
        }
        ]
    },
    {
        "title": "江苏",
        "code": "320000",
        "children": [{
            "title": "南京",
            "code": "320100",
            "children": [{
                "title": "玄武区",
                "code": "320102"
            },
            {
                "title": "秦淮区",
                "code": "320104"
            },
            {
                "title": "建邺区",
                "code": "320105"
            },
            {
                "title": "鼓楼区",
                "code": "320106"
            },
            {
                "title": "浦口区",
                "code": "320111"
            },
            {
                "title": "栖霞区",
                "code": "320113"
            },
            {
                "title": "雨花台区",
                "code": "320114"
            },
            {
                "title": "江宁区",
                "code": "320115"
            },
            {
                "title": "六合区",
                "code": "320116"
            },
            {
                "title": "溧水区",
                "code": "320117"
            },
            {
                "title": "高淳区",
                "code": "320118"
            }
            ]
        },
        {
            "title": "无锡",
            "code": "320200",
            "children": [{
                "title": "崇安区",
                "code": "320202"
            },
            {
                "title": "南长区",
                "code": "320203"
            },
            {
                "title": "北塘区",
                "code": "320204"
            },
            {
                "title": "锡山区",
                "code": "320205"
            },
            {
                "title": "惠山区",
                "code": "320206"
            },
            {
                "title": "滨湖区",
                "code": "320211"
            },
            {
                "title": "江阴市",
                "code": "320281"
            },
            {
                "title": "宜兴市",
                "code": "320282"
            }
            ]
        },
        {
            "title": "徐州",
            "code": "320300",
            "children": [{
                "title": "鼓楼区",
                "code": "320302"
            },
            {
                "title": "云龙区",
                "code": "320303"
            },
            {
                "title": "贾汪区",
                "code": "320305"
            },
            {
                "title": "泉山区",
                "code": "320311"
            },
            {
                "title": "铜山区",
                "code": "320312"
            },
            {
                "title": "丰县",
                "code": "320321"
            },
            {
                "title": "沛县",
                "code": "320322"
            },
            {
                "title": "睢宁县",
                "code": "320324"
            },
            {
                "title": "新沂市",
                "code": "320381"
            },
            {
                "title": "邳州市",
                "code": "320382"
            }
            ]
        },
        {
            "title": "常州",
            "code": "320400",
            "children": [{
                "title": "天宁区",
                "code": "320402"
            },
            {
                "title": "钟楼区",
                "code": "320404"
            },
            {
                "title": "戚墅堰区",
                "code": "320405"
            },
            {
                "title": "新北区",
                "code": "320411"
            },
            {
                "title": "武进区",
                "code": "320412"
            },
            {
                "title": "溧阳市",
                "code": "320481"
            },
            {
                "title": "金坛市",
                "code": "320482"
            }
            ]
        },
        {
            "title": "苏州",
            "code": "320500",
            "children": [{
                "title": "虎丘区",
                "code": "320505"
            },
            {
                "title": "吴中区",
                "code": "320506"
            },
            {
                "title": "相城区",
                "code": "320507"
            },
            {
                "title": "姑苏区",
                "code": "320508"
            },
            {
                "title": "吴江区",
                "code": "320509"
            },
            {
                "title": "常熟市",
                "code": "320581"
            },
            {
                "title": "张家港市",
                "code": "320582"
            },
            {
                "title": "昆山市",
                "code": "320583"
            },
            {
                "title": "太仓市",
                "code": "320585"
            }
            ]
        },
        {
            "title": "南通",
            "code": "320600",
            "children": [{
                "title": "崇川区",
                "code": "320602"
            },
            {
                "title": "港闸区",
                "code": "320611"
            },
            {
                "title": "通州区",
                "code": "320612"
            },
            {
                "title": "海安县",
                "code": "320621"
            },
            {
                "title": "如东县",
                "code": "320623"
            },
            {
                "title": "启东市",
                "code": "320681"
            },
            {
                "title": "如皋市",
                "code": "320682"
            },
            {
                "title": "海门市",
                "code": "320684"
            }
            ]
        },
        {
            "title": "连云港",
            "code": "320700",
            "children": [{
                "title": "连云区",
                "code": "320703"
            },
            {
                "title": "海州区",
                "code": "320706"
            },
            {
                "title": "赣榆区",
                "code": "320707"
            },
            {
                "title": "东海县",
                "code": "320722"
            },
            {
                "title": "灌云县",
                "code": "320723"
            },
            {
                "title": "灌南县",
                "code": "320724"
            }
            ]
        },
        {
            "title": "淮安",
            "code": "320800",
            "children": [{
                "title": "清河区",
                "code": "320802"
            },
            {
                "title": "淮安区",
                "code": "320803"
            },
            {
                "title": "淮阴区",
                "code": "320804"
            },
            {
                "title": "清浦区",
                "code": "320811"
            },
            {
                "title": "涟水县",
                "code": "320826"
            },
            {
                "title": "洪泽县",
                "code": "320829"
            },
            {
                "title": "盱眙县",
                "code": "320830"
            },
            {
                "title": "金湖县",
                "code": "320831"
            }
            ]
        },
        {
            "title": "盐城",
            "code": "320900",
            "children": [{
                "title": "亭湖区",
                "code": "320902"
            },
            {
                "title": "盐都区",
                "code": "320903"
            },
            {
                "title": "响水县",
                "code": "320921"
            },
            {
                "title": "滨海县",
                "code": "320922"
            },
            {
                "title": "阜宁县",
                "code": "320923"
            },
            {
                "title": "射阳县",
                "code": "320924"
            },
            {
                "title": "建湖县",
                "code": "320925"
            },
            {
                "title": "东台市",
                "code": "320981"
            },
            {
                "title": "大丰市",
                "code": "320982"
            }
            ]
        },
        {
            "title": "扬州",
            "code": "321000",
            "children": [{
                "title": "广陵区",
                "code": "321002"
            },
            {
                "title": "邗江区",
                "code": "321003"
            },
            {
                "title": "江都区",
                "code": "321012"
            },
            {
                "title": "宝应县",
                "code": "321023"
            },
            {
                "title": "仪征市",
                "code": "321081"
            },
            {
                "title": "高邮市",
                "code": "321084"
            }
            ]
        },
        {
            "title": "镇江",
            "code": "321100",
            "children": [{
                "title": "京口区",
                "code": "321102"
            },
            {
                "title": "润州区",
                "code": "321111"
            },
            {
                "title": "丹徒区",
                "code": "321112"
            },
            {
                "title": "丹阳市",
                "code": "321181"
            },
            {
                "title": "扬中市",
                "code": "321182"
            },
            {
                "title": "句容市",
                "code": "321183"
            }
            ]
        },
        {
            "title": "泰州",
            "code": "321200",
            "children": [{
                "title": "海陵区",
                "code": "321202"
            },
            {
                "title": "高港区",
                "code": "321203"
            },
            {
                "title": "姜堰区",
                "code": "321204"
            },
            {
                "title": "兴化市",
                "code": "321281"
            },
            {
                "title": "靖江市",
                "code": "321282"
            },
            {
                "title": "泰兴市",
                "code": "321283"
            }
            ]
        },
        {
            "title": "宿迁",
            "code": "321300",
            "children": [{
                "title": "宿城区",
                "code": "321302"
            },
            {
                "title": "宿豫区",
                "code": "321311"
            },
            {
                "title": "沭阳县",
                "code": "321322"
            },
            {
                "title": "泗阳县",
                "code": "321323"
            },
            {
                "title": "泗洪县",
                "code": "321324"
            }
            ]
        }
        ]
    },
    {
        "title": "浙江",
        "code": "330000",
        "children": [{
            "title": "杭州",
            "code": "330100",
            "children": [{
                "title": "上城区",
                "code": "330102"
            },
            {
                "title": "下城区",
                "code": "330103"
            },
            {
                "title": "江干区",
                "code": "330104"
            },
            {
                "title": "拱墅区",
                "code": "330105"
            },
            {
                "title": "西湖区",
                "code": "330106"
            },
            {
                "title": "滨江区",
                "code": "330108"
            },
            {
                "title": "萧山区",
                "code": "330109"
            },
            {
                "title": "余杭区",
                "code": "330110"
            },
            {
                "title": "富阳区",
                "code": "330111"
            },
            {
                "title": "桐庐县",
                "code": "330122"
            },
            {
                "title": "淳安县",
                "code": "330127"
            },
            {
                "title": "建德市",
                "code": "330182"
            },
            {
                "title": "临安市",
                "code": "330185"
            }
            ]
        },
        {
            "title": "宁波",
            "code": "330200",
            "children": [{
                "title": "海曙区",
                "code": "330203"
            },
            {
                "title": "江东区",
                "code": "330204"
            },
            {
                "title": "江北区",
                "code": "330205"
            },
            {
                "title": "北仑区",
                "code": "330206"
            },
            {
                "title": "镇海区",
                "code": "330211"
            },
            {
                "title": "鄞州区",
                "code": "330212"
            },
            {
                "title": "象山县",
                "code": "330225"
            },
            {
                "title": "宁海县",
                "code": "330226"
            },
            {
                "title": "余姚市",
                "code": "330281"
            },
            {
                "title": "慈溪市",
                "code": "330282"
            },
            {
                "title": "奉化市",
                "code": "330283"
            }
            ]
        },
        {
            "title": "温州",
            "code": "330300",
            "children": [{
                "title": "鹿城区",
                "code": "330302"
            },
            {
                "title": "龙湾区",
                "code": "330303"
            },
            {
                "title": "瓯海区",
                "code": "330304"
            },
            {
                "title": "洞头县",
                "code": "330322"
            },
            {
                "title": "永嘉县",
                "code": "330324"
            },
            {
                "title": "平阳县",
                "code": "330326"
            },
            {
                "title": "苍南县",
                "code": "330327"
            },
            {
                "title": "文成县",
                "code": "330328"
            },
            {
                "title": "泰顺县",
                "code": "330329"
            },
            {
                "title": "瑞安市",
                "code": "330381"
            },
            {
                "title": "乐清市",
                "code": "330382"
            }
            ]
        },
        {
            "title": "嘉兴",
            "code": "330400",
            "children": [{
                "title": "南湖区",
                "code": "330402"
            },
            {
                "title": "秀洲区",
                "code": "330411"
            },
            {
                "title": "嘉善县",
                "code": "330421"
            },
            {
                "title": "海盐县",
                "code": "330424"
            },
            {
                "title": "海宁市",
                "code": "330481"
            },
            {
                "title": "平湖市",
                "code": "330482"
            },
            {
                "title": "桐乡市",
                "code": "330483"
            }
            ]
        },
        {
            "title": "湖州",
            "code": "330500",
            "children": [{
                "title": "吴兴区",
                "code": "330502"
            },
            {
                "title": "南浔区",
                "code": "330503"
            },
            {
                "title": "德清县",
                "code": "330521"
            },
            {
                "title": "长兴县",
                "code": "330522"
            },
            {
                "title": "安吉县",
                "code": "330523"
            }
            ]
        },
        {
            "title": "绍兴",
            "code": "330600",
            "children": [{
                "title": "越城区",
                "code": "330602"
            },
            {
                "title": "柯桥区",
                "code": "330603"
            },
            {
                "title": "上虞区",
                "code": "330604"
            },
            {
                "title": "新昌县",
                "code": "330624"
            },
            {
                "title": "诸暨市",
                "code": "330681"
            },
            {
                "title": "嵊州市",
                "code": "330683"
            }
            ]
        },
        {
            "title": "金华",
            "code": "330700",
            "children": [{
                "title": "婺城区",
                "code": "330702"
            },
            {
                "title": "金东区",
                "code": "330703"
            },
            {
                "title": "武义县",
                "code": "330723"
            },
            {
                "title": "浦江县",
                "code": "330726"
            },
            {
                "title": "磐安县",
                "code": "330727"
            },
            {
                "title": "兰溪市",
                "code": "330781"
            },
            {
                "title": "义乌市",
                "code": "330782"
            },
            {
                "title": "东阳市",
                "code": "330783"
            },
            {
                "title": "永康市",
                "code": "330784"
            }
            ]
        },
        {
            "title": "衢州",
            "code": "330800",
            "children": [{
                "title": "柯城区",
                "code": "330802"
            },
            {
                "title": "衢江区",
                "code": "330803"
            },
            {
                "title": "常山县",
                "code": "330822"
            },
            {
                "title": "开化县",
                "code": "330824"
            },
            {
                "title": "龙游县",
                "code": "330825"
            },
            {
                "title": "江山市",
                "code": "330881"
            }
            ]
        },
        {
            "title": "舟山",
            "code": "330900",
            "children": [{
                "title": "定海区",
                "code": "330902"
            },
            {
                "title": "普陀区",
                "code": "330903"
            },
            {
                "title": "岱山县",
                "code": "330921"
            },
            {
                "title": "嵊泗县",
                "code": "330922"
            }
            ]
        },
        {
            "title": "台州",
            "code": "331000",
            "children": [{
                "title": "椒江区",
                "code": "331002"
            },
            {
                "title": "黄岩区",
                "code": "331003"
            },
            {
                "title": "路桥区",
                "code": "331004"
            },
            {
                "title": "玉环县",
                "code": "331021"
            },
            {
                "title": "三门县",
                "code": "331022"
            },
            {
                "title": "天台县",
                "code": "331023"
            },
            {
                "title": "仙居县",
                "code": "331024"
            },
            {
                "title": "温岭市",
                "code": "331081"
            },
            {
                "title": "临海市",
                "code": "331082"
            }
            ]
        },
        {
            "title": "丽水",
            "code": "331100",
            "children": [{
                "title": "莲都区",
                "code": "331102"
            },
            {
                "title": "青田县",
                "code": "331121"
            },
            {
                "title": "缙云县",
                "code": "331122"
            },
            {
                "title": "遂昌县",
                "code": "331123"
            },
            {
                "title": "松阳县",
                "code": "331124"
            },
            {
                "title": "云和县",
                "code": "331125"
            },
            {
                "title": "庆元县",
                "code": "331126"
            },
            {
                "title": "景宁畲族自治县",
                "code": "331127"
            },
            {
                "title": "龙泉市",
                "code": "331181"
            }
            ]
        }
        ]
    },
    {
        "title": "安徽",
        "code": "340000",
        "children": [{
            "title": "合肥",
            "code": "340100",
            "children": [{
                "title": "瑶海区",
                "code": "340102"
            },
            {
                "title": "庐阳区",
                "code": "340103"
            },
            {
                "title": "蜀山区",
                "code": "340104"
            },
            {
                "title": "包河区",
                "code": "340111"
            },
            {
                "title": "长丰县",
                "code": "340121"
            },
            {
                "title": "肥东县",
                "code": "340122"
            },
            {
                "title": "肥西县",
                "code": "340123"
            },
            {
                "title": "庐江县",
                "code": "340124"
            },
            {
                "title": "巢湖市",
                "code": "340181"
            }
            ]
        },
        {
            "title": "芜湖",
            "code": "340200",
            "children": [{
                "title": "镜湖区",
                "code": "340202"
            },
            {
                "title": "弋江区",
                "code": "340203"
            },
            {
                "title": "鸠江区",
                "code": "340207"
            },
            {
                "title": "三山区",
                "code": "340208"
            },
            {
                "title": "芜湖县",
                "code": "340221"
            },
            {
                "title": "繁昌县",
                "code": "340222"
            },
            {
                "title": "南陵县",
                "code": "340223"
            },
            {
                "title": "无为县",
                "code": "340225"
            }
            ]
        },
        {
            "title": "蚌埠",
            "code": "340300",
            "children": [{
                "title": "龙子湖区",
                "code": "340302"
            },
            {
                "title": "蚌山区",
                "code": "340303"
            },
            {
                "title": "禹会区",
                "code": "340304"
            },
            {
                "title": "淮上区",
                "code": "340311"
            },
            {
                "title": "怀远县",
                "code": "340321"
            },
            {
                "title": "五河县",
                "code": "340322"
            },
            {
                "title": "固镇县",
                "code": "340323"
            }
            ]
        },
        {
            "title": "淮南",
            "code": "340400",
            "children": [{
                "title": "大通区",
                "code": "340402"
            },
            {
                "title": "田家庵区",
                "code": "340403"
            },
            {
                "title": "谢家集区",
                "code": "340404"
            },
            {
                "title": "八公山区",
                "code": "340405"
            },
            {
                "title": "潘集区",
                "code": "340406"
            },
            {
                "title": "凤台县",
                "code": "340421"
            }
            ]
        },
        {
            "title": "马鞍山",
            "code": "340500",
            "children": [{
                "title": "花山区",
                "code": "340503"
            },
            {
                "title": "雨山区",
                "code": "340504"
            },
            {
                "title": "博望区",
                "code": "340506"
            },
            {
                "title": "当涂县",
                "code": "340521"
            },
            {
                "title": "含山县",
                "code": "340522"
            },
            {
                "title": "和县",
                "code": "340523"
            }
            ]
        },
        {
            "title": "淮北",
            "code": "340600",
            "children": [{
                "title": "杜集区",
                "code": "340602"
            },
            {
                "title": "相山区",
                "code": "340603"
            },
            {
                "title": "烈山区",
                "code": "340604"
            },
            {
                "title": "濉溪县",
                "code": "340621"
            }
            ]
        },
        {
            "title": "铜陵",
            "code": "340700",
            "children": [{
                "title": "铜官山区",
                "code": "340702"
            },
            {
                "title": "狮子山区",
                "code": "340703"
            },
            {
                "title": "郊区",
                "code": "340711"
            },
            {
                "title": "铜陵县",
                "code": "340721"
            }
            ]
        },
        {
            "title": "安庆",
            "code": "340800",
            "children": [{
                "title": "迎江区",
                "code": "340802"
            },
            {
                "title": "大观区",
                "code": "340803"
            },
            {
                "title": "宜秀区",
                "code": "340811"
            },
            {
                "title": "怀宁县",
                "code": "340822"
            },
            {
                "title": "枞阳县",
                "code": "340823"
            },
            {
                "title": "潜山县",
                "code": "340824"
            },
            {
                "title": "太湖县",
                "code": "340825"
            },
            {
                "title": "宿松县",
                "code": "340826"
            },
            {
                "title": "望江县",
                "code": "340827"
            },
            {
                "title": "岳西县",
                "code": "340828"
            },
            {
                "title": "桐城市",
                "code": "340881"
            }
            ]
        },
        {
            "title": "黄山",
            "code": "341000",
            "children": [{
                "title": "屯溪区",
                "code": "341002"
            },
            {
                "title": "黄山区",
                "code": "341003"
            },
            {
                "title": "徽州区",
                "code": "341004"
            },
            {
                "title": "歙县",
                "code": "341021"
            },
            {
                "title": "休宁县",
                "code": "341022"
            },
            {
                "title": "黟县",
                "code": "341023"
            },
            {
                "title": "祁门县",
                "code": "341024"
            }
            ]
        },
        {
            "title": "滁州",
            "code": "341100",
            "children": [{
                "title": "琅琊区",
                "code": "341102"
            },
            {
                "title": "南谯区",
                "code": "341103"
            },
            {
                "title": "来安县",
                "code": "341122"
            },
            {
                "title": "全椒县",
                "code": "341124"
            },
            {
                "title": "定远县",
                "code": "341125"
            },
            {
                "title": "凤阳县",
                "code": "341126"
            },
            {
                "title": "天长市",
                "code": "341181"
            },
            {
                "title": "明光市",
                "code": "341182"
            }
            ]
        },
        {
            "title": "阜阳",
            "code": "341200",
            "children": [{
                "title": "颍州区",
                "code": "341202"
            },
            {
                "title": "颍东区",
                "code": "341203"
            },
            {
                "title": "颍泉区",
                "code": "341204"
            },
            {
                "title": "临泉县",
                "code": "341221"
            },
            {
                "title": "太和县",
                "code": "341222"
            },
            {
                "title": "阜南县",
                "code": "341225"
            },
            {
                "title": "颍上县",
                "code": "341226"
            },
            {
                "title": "界首市",
                "code": "341282"
            }
            ]
        },
        {
            "title": "宿州",
            "code": "341300",
            "children": [{
                "title": "埇桥区",
                "code": "341302"
            },
            {
                "title": "砀山县",
                "code": "341321"
            },
            {
                "title": "萧县",
                "code": "341322"
            },
            {
                "title": "灵璧县",
                "code": "341323"
            },
            {
                "title": "泗县",
                "code": "341324"
            }
            ]
        },
        {
            "title": "六安",
            "code": "341500",
            "children": [{
                "title": "金安区",
                "code": "341502"
            },
            {
                "title": "裕安区",
                "code": "341503"
            },
            {
                "title": "寿县",
                "code": "341521"
            },
            {
                "title": "霍邱县",
                "code": "341522"
            },
            {
                "title": "舒城县",
                "code": "341523"
            },
            {
                "title": "金寨县",
                "code": "341524"
            },
            {
                "title": "霍山县",
                "code": "341525"
            }
            ]
        },
        {
            "title": "亳州",
            "code": "341600",
            "children": [{
                "title": "谯城区",
                "code": "341602"
            },
            {
                "title": "涡阳县",
                "code": "341621"
            },
            {
                "title": "蒙城县",
                "code": "341622"
            },
            {
                "title": "利辛县",
                "code": "341623"
            }
            ]
        },
        {
            "title": "池州",
            "code": "341700",
            "children": [{
                "title": "贵池区",
                "code": "341702"
            },
            {
                "title": "东至县",
                "code": "341721"
            },
            {
                "title": "石台县",
                "code": "341722"
            },
            {
                "title": "青阳县",
                "code": "341723"
            }
            ]
        },
        {
            "title": "宣城",
            "code": "341800",
            "children": [{
                "title": "宣州区",
                "code": "341802"
            },
            {
                "title": "郎溪县",
                "code": "341821"
            },
            {
                "title": "广德县",
                "code": "341822"
            },
            {
                "title": "泾县",
                "code": "341823"
            },
            {
                "title": "绩溪县",
                "code": "341824"
            },
            {
                "title": "旌德县",
                "code": "341825"
            },
            {
                "title": "宁国市",
                "code": "341881"
            }
            ]
        }
        ]
    },
    {
        "title": "福建",
        "code": "350000",
        "children": [{
            "title": "福州",
            "code": "350100",
            "children": [{
                "title": "鼓楼区",
                "code": "350102"
            },
            {
                "title": "台江区",
                "code": "350103"
            },
            {
                "title": "仓山区",
                "code": "350104"
            },
            {
                "title": "马尾区",
                "code": "350105"
            },
            {
                "title": "晋安区",
                "code": "350111"
            },
            {
                "title": "闽侯县",
                "code": "350121"
            },
            {
                "title": "连江县",
                "code": "350122"
            },
            {
                "title": "罗源县",
                "code": "350123"
            },
            {
                "title": "闽清县",
                "code": "350124"
            },
            {
                "title": "永泰县",
                "code": "350125"
            },
            {
                "title": "平潭县",
                "code": "350128"
            },
            {
                "title": "福清市",
                "code": "350181"
            },
            {
                "title": "长乐市",
                "code": "350182"
            }
            ]
        },
        {
            "title": "厦门",
            "code": "350200",
            "children": [{
                "title": "思明区",
                "code": "350203"
            },
            {
                "title": "海沧区",
                "code": "350205"
            },
            {
                "title": "湖里区",
                "code": "350206"
            },
            {
                "title": "集美区",
                "code": "350211"
            },
            {
                "title": "同安区",
                "code": "350212"
            },
            {
                "title": "翔安区",
                "code": "350213"
            }
            ]
        },
        {
            "title": "莆田",
            "code": "350300",
            "children": [{
                "title": "城厢区",
                "code": "350302"
            },
            {
                "title": "涵江区",
                "code": "350303"
            },
            {
                "title": "荔城区",
                "code": "350304"
            },
            {
                "title": "秀屿区",
                "code": "350305"
            },
            {
                "title": "仙游县",
                "code": "350322"
            }
            ]
        },
        {
            "title": "三明",
            "code": "350400",
            "children": [{
                "title": "梅列区",
                "code": "350402"
            },
            {
                "title": "三元区",
                "code": "350403"
            },
            {
                "title": "明溪县",
                "code": "350421"
            },
            {
                "title": "清流县",
                "code": "350423"
            },
            {
                "title": "宁化县",
                "code": "350424"
            },
            {
                "title": "大田县",
                "code": "350425"
            },
            {
                "title": "尤溪县",
                "code": "350426"
            },
            {
                "title": "沙县",
                "code": "350427"
            },
            {
                "title": "将乐县",
                "code": "350428"
            },
            {
                "title": "泰宁县",
                "code": "350429"
            },
            {
                "title": "建宁县",
                "code": "350430"
            },
            {
                "title": "永安市",
                "code": "350481"
            }
            ]
        },
        {
            "title": "泉州",
            "code": "350500",
            "children": [{
                "title": "鲤城区",
                "code": "350502"
            },
            {
                "title": "丰泽区",
                "code": "350503"
            },
            {
                "title": "洛江区",
                "code": "350504"
            },
            {
                "title": "泉港区",
                "code": "350505"
            },
            {
                "title": "惠安县",
                "code": "350521"
            },
            {
                "title": "安溪县",
                "code": "350524"
            },
            {
                "title": "永春县",
                "code": "350525"
            },
            {
                "title": "德化县",
                "code": "350526"
            },
            {
                "title": "金门县",
                "code": "350527"
            },
            {
                "title": "石狮市",
                "code": "350581"
            },
            {
                "title": "晋江市",
                "code": "350582"
            },
            {
                "title": "南安市",
                "code": "350583"
            }
            ]
        },
        {
            "title": "漳州",
            "code": "350600",
            "children": [{
                "title": "芗城区",
                "code": "350602"
            },
            {
                "title": "龙文区",
                "code": "350603"
            },
            {
                "title": "云霄县",
                "code": "350622"
            },
            {
                "title": "漳浦县",
                "code": "350623"
            },
            {
                "title": "诏安县",
                "code": "350624"
            },
            {
                "title": "长泰县",
                "code": "350625"
            },
            {
                "title": "东山县",
                "code": "350626"
            },
            {
                "title": "南靖县",
                "code": "350627"
            },
            {
                "title": "平和县",
                "code": "350628"
            },
            {
                "title": "华安县",
                "code": "350629"
            },
            {
                "title": "龙海市",
                "code": "350681"
            }
            ]
        },
        {
            "title": "南平",
            "code": "350700",
            "children": [{
                "title": "延平区",
                "code": "350702"
            },
            {
                "title": "建阳区",
                "code": "350703"
            },
            {
                "title": "顺昌县",
                "code": "350721"
            },
            {
                "title": "浦城县",
                "code": "350722"
            },
            {
                "title": "光泽县",
                "code": "350723"
            },
            {
                "title": "松溪县",
                "code": "350724"
            },
            {
                "title": "政和县",
                "code": "350725"
            },
            {
                "title": "邵武市",
                "code": "350781"
            },
            {
                "title": "武夷山市",
                "code": "350782"
            },
            {
                "title": "建瓯市",
                "code": "350783"
            }
            ]
        },
        {
            "title": "龙岩",
            "code": "350800",
            "children": [{
                "title": "新罗区",
                "code": "350802"
            },
            {
                "title": "永定区",
                "code": "350803"
            },
            {
                "title": "长汀县",
                "code": "350821"
            },
            {
                "title": "上杭县",
                "code": "350823"
            },
            {
                "title": "武平县",
                "code": "350824"
            },
            {
                "title": "连城县",
                "code": "350825"
            },
            {
                "title": "漳平市",
                "code": "350881"
            }
            ]
        },
        {
            "title": "宁德",
            "code": "350900",
            "children": [{
                "title": "蕉城区",
                "code": "350902"
            },
            {
                "title": "霞浦县",
                "code": "350921"
            },
            {
                "title": "古田县",
                "code": "350922"
            },
            {
                "title": "屏南县",
                "code": "350923"
            },
            {
                "title": "寿宁县",
                "code": "350924"
            },
            {
                "title": "周宁县",
                "code": "350925"
            },
            {
                "title": "柘荣县",
                "code": "350926"
            },
            {
                "title": "福安市",
                "code": "350981"
            },
            {
                "title": "福鼎市",
                "code": "350982"
            }
            ]
        }
        ]
    },
    {
        "title": "江西",
        "code": "360000",
        "children": [{
            "title": "南昌",
            "code": "360100",
            "children": [{
                "title": "东湖区",
                "code": "360102"
            },
            {
                "title": "西湖区",
                "code": "360103"
            },
            {
                "title": "青云谱区",
                "code": "360104"
            },
            {
                "title": "湾里区",
                "code": "360105"
            },
            {
                "title": "青山湖区",
                "code": "360111"
            },
            {
                "title": "南昌县",
                "code": "360121"
            },
            {
                "title": "新建县",
                "code": "360122"
            },
            {
                "title": "安义县",
                "code": "360123"
            },
            {
                "title": "进贤县",
                "code": "360124"
            }
            ]
        },
        {
            "title": "景德镇",
            "code": "360200",
            "children": [{
                "title": "昌江区",
                "code": "360202"
            },
            {
                "title": "珠山区",
                "code": "360203"
            },
            {
                "title": "浮梁县",
                "code": "360222"
            },
            {
                "title": "乐平市",
                "code": "360281"
            }
            ]
        },
        {
            "title": "萍乡",
            "code": "360300",
            "children": [{
                "title": "安源区",
                "code": "360302"
            },
            {
                "title": "湘东区",
                "code": "360313"
            },
            {
                "title": "莲花县",
                "code": "360321"
            },
            {
                "title": "上栗县",
                "code": "360322"
            },
            {
                "title": "芦溪县",
                "code": "360323"
            }
            ]
        },
        {
            "title": "九江",
            "code": "360400",
            "children": [{
                "title": "庐山区",
                "code": "360402"
            },
            {
                "title": "浔阳区",
                "code": "360403"
            },
            {
                "title": "九江县",
                "code": "360421"
            },
            {
                "title": "武宁县",
                "code": "360423"
            },
            {
                "title": "修水县",
                "code": "360424"
            },
            {
                "title": "永修县",
                "code": "360425"
            },
            {
                "title": "德安县",
                "code": "360426"
            },
            {
                "title": "星子县",
                "code": "360427"
            },
            {
                "title": "都昌县",
                "code": "360428"
            },
            {
                "title": "湖口县",
                "code": "360429"
            },
            {
                "title": "彭泽县",
                "code": "360430"
            },
            {
                "title": "瑞昌市",
                "code": "360481"
            },
            {
                "title": "共青城市",
                "code": "360482"
            }
            ]
        },
        {
            "title": "新余",
            "code": "360500",
            "children": [{
                "title": "渝水区",
                "code": "360502"
            },
            {
                "title": "分宜县",
                "code": "360521"
            }
            ]
        },
        {
            "title": "鹰潭",
            "code": "360600",
            "children": [{
                "title": "月湖区",
                "code": "360602"
            },
            {
                "title": "余江县",
                "code": "360622"
            },
            {
                "title": "贵溪市",
                "code": "360681"
            }
            ]
        },
        {
            "title": "赣州",
            "code": "360700",
            "children": [{
                "title": "章贡区",
                "code": "360702"
            },
            {
                "title": "南康区",
                "code": "360703"
            },
            {
                "title": "赣县",
                "code": "360721"
            },
            {
                "title": "信丰县",
                "code": "360722"
            },
            {
                "title": "大余县",
                "code": "360723"
            },
            {
                "title": "上犹县",
                "code": "360724"
            },
            {
                "title": "崇义县",
                "code": "360725"
            },
            {
                "title": "安远县",
                "code": "360726"
            },
            {
                "title": "龙南县",
                "code": "360727"
            },
            {
                "title": "定南县",
                "code": "360728"
            },
            {
                "title": "全南县",
                "code": "360729"
            },
            {
                "title": "宁都县",
                "code": "360730"
            },
            {
                "title": "于都县",
                "code": "360731"
            },
            {
                "title": "兴国县",
                "code": "360732"
            },
            {
                "title": "会昌县",
                "code": "360733"
            },
            {
                "title": "寻乌县",
                "code": "360734"
            },
            {
                "title": "石城县",
                "code": "360735"
            },
            {
                "title": "瑞金市",
                "code": "360781"
            }
            ]
        },
        {
            "title": "吉安",
            "code": "360800",
            "children": [{
                "title": "吉州区",
                "code": "360802"
            },
            {
                "title": "青原区",
                "code": "360803"
            },
            {
                "title": "吉安县",
                "code": "360821"
            },
            {
                "title": "吉水县",
                "code": "360822"
            },
            {
                "title": "峡江县",
                "code": "360823"
            },
            {
                "title": "新干县",
                "code": "360824"
            },
            {
                "title": "永丰县",
                "code": "360825"
            },
            {
                "title": "泰和县",
                "code": "360826"
            },
            {
                "title": "遂川县",
                "code": "360827"
            },
            {
                "title": "万安县",
                "code": "360828"
            },
            {
                "title": "安福县",
                "code": "360829"
            },
            {
                "title": "永新县",
                "code": "360830"
            },
            {
                "title": "井冈山市",
                "code": "360881"
            }
            ]
        },
        {
            "title": "宜春",
            "code": "360900",
            "children": [{
                "title": "袁州区",
                "code": "360902"
            },
            {
                "title": "奉新县",
                "code": "360921"
            },
            {
                "title": "万载县",
                "code": "360922"
            },
            {
                "title": "上高县",
                "code": "360923"
            },
            {
                "title": "宜丰县",
                "code": "360924"
            },
            {
                "title": "靖安县",
                "code": "360925"
            },
            {
                "title": "铜鼓县",
                "code": "360926"
            },
            {
                "title": "丰城市",
                "code": "360981"
            },
            {
                "title": "樟树市",
                "code": "360982"
            },
            {
                "title": "高安市",
                "code": "360983"
            }
            ]
        },
        {
            "title": "抚州",
            "code": "361000",
            "children": [{
                "title": "临川区",
                "code": "361002"
            },
            {
                "title": "南城县",
                "code": "361021"
            },
            {
                "title": "黎川县",
                "code": "361022"
            },
            {
                "title": "南丰县",
                "code": "361023"
            },
            {
                "title": "崇仁县",
                "code": "361024"
            },
            {
                "title": "乐安县",
                "code": "361025"
            },
            {
                "title": "宜黄县",
                "code": "361026"
            },
            {
                "title": "金溪县",
                "code": "361027"
            },
            {
                "title": "资溪县",
                "code": "361028"
            },
            {
                "title": "东乡县",
                "code": "361029"
            },
            {
                "title": "广昌县",
                "code": "361030"
            }
            ]
        },
        {
            "title": "上饶",
            "code": "361100",
            "children": [{
                "title": "信州区",
                "code": "361102"
            },
            {
                "title": "上饶县",
                "code": "361121"
            },
            {
                "title": "广丰县",
                "code": "361122"
            },
            {
                "title": "玉山县",
                "code": "361123"
            },
            {
                "title": "铅山县",
                "code": "361124"
            },
            {
                "title": "横峰县",
                "code": "361125"
            },
            {
                "title": "弋阳县",
                "code": "361126"
            },
            {
                "title": "余干县",
                "code": "361127"
            },
            {
                "title": "鄱阳县",
                "code": "361128"
            },
            {
                "title": "万年县",
                "code": "361129"
            },
            {
                "title": "婺源县",
                "code": "361130"
            },
            {
                "title": "德兴市",
                "code": "361181"
            }
            ]
        }
        ]
    },
    {
        "title": "山东",
        "code": "370000",
        "children": [{
            "title": "济南",
            "code": "370100",
            "children": [{
                "title": "历下区",
                "code": "370102"
            },
            {
                "title": "市中区",
                "code": "370103"
            },
            {
                "title": "槐荫区",
                "code": "370104"
            },
            {
                "title": "天桥区",
                "code": "370105"
            },
            {
                "title": "历城区",
                "code": "370112"
            },
            {
                "title": "长清区",
                "code": "370113"
            },
            {
                "title": "平阴县",
                "code": "370124"
            },
            {
                "title": "济阳县",
                "code": "370125"
            },
            {
                "title": "商河县",
                "code": "370126"
            },
            {
                "title": "章丘市",
                "code": "370181"
            }
            ]
        },
        {
            "title": "青岛",
            "code": "370200",
            "children": [{
                "title": "市南区",
                "code": "370202"
            },
            {
                "title": "市北区",
                "code": "370203"
            },
            {
                "title": "黄岛区",
                "code": "370211"
            },
            {
                "title": "崂山区",
                "code": "370212"
            },
            {
                "title": "李沧区",
                "code": "370213"
            },
            {
                "title": "城阳区",
                "code": "370214"
            },
            {
                "title": "胶州市",
                "code": "370281"
            },
            {
                "title": "即墨市",
                "code": "370282"
            },
            {
                "title": "平度市",
                "code": "370283"
            },
            {
                "title": "莱西市",
                "code": "370285"
            }
            ]
        },
        {
            "title": "淄博",
            "code": "370300",
            "children": [{
                "title": "淄川区",
                "code": "370302"
            },
            {
                "title": "张店区",
                "code": "370303"
            },
            {
                "title": "博山区",
                "code": "370304"
            },
            {
                "title": "临淄区",
                "code": "370305"
            },
            {
                "title": "周村区",
                "code": "370306"
            },
            {
                "title": "桓台县",
                "code": "370321"
            },
            {
                "title": "高青县",
                "code": "370322"
            },
            {
                "title": "沂源县",
                "code": "370323"
            }
            ]
        },
        {
            "title": "枣庄",
            "code": "370400",
            "children": [{
                "title": "市中区",
                "code": "370402"
            },
            {
                "title": "薛城区",
                "code": "370403"
            },
            {
                "title": "峄城区",
                "code": "370404"
            },
            {
                "title": "台儿庄区",
                "code": "370405"
            },
            {
                "title": "山亭区",
                "code": "370406"
            },
            {
                "title": "滕州市",
                "code": "370481"
            }
            ]
        },
        {
            "title": "东营",
            "code": "370500",
            "children": [{
                "title": "东营区",
                "code": "370502"
            },
            {
                "title": "河口区",
                "code": "370503"
            },
            {
                "title": "垦利县",
                "code": "370521"
            },
            {
                "title": "利津县",
                "code": "370522"
            },
            {
                "title": "广饶县",
                "code": "370523"
            }
            ]
        },
        {
            "title": "烟台",
            "code": "370600",
            "children": [{
                "title": "芝罘区",
                "code": "370602"
            },
            {
                "title": "福山区",
                "code": "370611"
            },
            {
                "title": "牟平区",
                "code": "370612"
            },
            {
                "title": "莱山区",
                "code": "370613"
            },
            {
                "title": "长岛县",
                "code": "370634"
            },
            {
                "title": "龙口市",
                "code": "370681"
            },
            {
                "title": "莱阳市",
                "code": "370682"
            },
            {
                "title": "莱州市",
                "code": "370683"
            },
            {
                "title": "蓬莱市",
                "code": "370684"
            },
            {
                "title": "招远市",
                "code": "370685"
            },
            {
                "title": "栖霞市",
                "code": "370686"
            },
            {
                "title": "海阳市",
                "code": "370687"
            }
            ]
        },
        {
            "title": "潍坊",
            "code": "370700",
            "children": [{
                "title": "潍城区",
                "code": "370702"
            },
            {
                "title": "寒亭区",
                "code": "370703"
            },
            {
                "title": "坊子区",
                "code": "370704"
            },
            {
                "title": "奎文区",
                "code": "370705"
            },
            {
                "title": "临朐县",
                "code": "370724"
            },
            {
                "title": "昌乐县",
                "code": "370725"
            },
            {
                "title": "青州市",
                "code": "370781"
            },
            {
                "title": "诸城市",
                "code": "370782"
            },
            {
                "title": "寿光市",
                "code": "370783"
            },
            {
                "title": "安丘市",
                "code": "370784"
            },
            {
                "title": "高密市",
                "code": "370785"
            },
            {
                "title": "昌邑市",
                "code": "370786"
            }
            ]
        },
        {
            "title": "济宁",
            "code": "370800",
            "children": [{
                "title": "任城区",
                "code": "370811"
            },
            {
                "title": "兖州区",
                "code": "370812"
            },
            {
                "title": "微山县",
                "code": "370826"
            },
            {
                "title": "鱼台县",
                "code": "370827"
            },
            {
                "title": "金乡县",
                "code": "370828"
            },
            {
                "title": "嘉祥县",
                "code": "370829"
            },
            {
                "title": "汶上县",
                "code": "370830"
            },
            {
                "title": "泗水县",
                "code": "370831"
            },
            {
                "title": "梁山县",
                "code": "370832"
            },
            {
                "title": "曲阜市",
                "code": "370881"
            },
            {
                "title": "邹城市",
                "code": "370883"
            }
            ]
        },
        {
            "title": "泰安",
            "code": "370900",
            "children": [{
                "title": "泰山区",
                "code": "370902"
            },
            {
                "title": "岱岳区",
                "code": "370911"
            },
            {
                "title": "宁阳县",
                "code": "370921"
            },
            {
                "title": "东平县",
                "code": "370923"
            },
            {
                "title": "新泰市",
                "code": "370982"
            },
            {
                "title": "肥城市",
                "code": "370983"
            }
            ]
        },
        {
            "title": "威海",
            "code": "371000",
            "children": [{
                "title": "环翠区",
                "code": "371002"
            },
            {
                "title": "文登市",
                "code": "371081"
            },
            {
                "title": "荣成市",
                "code": "371082"
            },
            {
                "title": "乳山市",
                "code": "371083"
            }
            ]
        },
        {
            "title": "日照",
            "code": "371100",
            "children": [{
                "title": "东港区",
                "code": "371102"
            },
            {
                "title": "岚山区",
                "code": "371103"
            },
            {
                "title": "五莲县",
                "code": "371121"
            },
            {
                "title": "莒县",
                "code": "371122"
            }
            ]
        },
        {
            "title": "莱芜",
            "code": "371200",
            "children": [{
                "title": "莱城区",
                "code": "371202"
            },
            {
                "title": "钢城区",
                "code": "371203"
            }
            ]
        },
        {
            "title": "临沂",
            "code": "371300",
            "children": [{
                "title": "兰山区",
                "code": "371302"
            },
            {
                "title": "罗庄区",
                "code": "371311"
            },
            {
                "title": "河东区",
                "code": "371312"
            },
            {
                "title": "沂南县",
                "code": "371321"
            },
            {
                "title": "郯城县",
                "code": "371322"
            },
            {
                "title": "沂水县",
                "code": "371323"
            },
            {
                "title": "兰陵县",
                "code": "371324"
            },
            {
                "title": "费县",
                "code": "371325"
            },
            {
                "title": "平邑县",
                "code": "371326"
            },
            {
                "title": "莒南县",
                "code": "371327"
            },
            {
                "title": "蒙阴县",
                "code": "371328"
            },
            {
                "title": "临沭县",
                "code": "371329"
            }
            ]
        },
        {
            "title": "德州",
            "code": "371400",
            "children": [{
                "title": "德城区",
                "code": "371402"
            },
            {
                "title": "陵城区",
                "code": "371403"
            },
            {
                "title": "宁津县",
                "code": "371422"
            },
            {
                "title": "庆云县",
                "code": "371423"
            },
            {
                "title": "临邑县",
                "code": "371424"
            },
            {
                "title": "齐河县",
                "code": "371425"
            },
            {
                "title": "平原县",
                "code": "371426"
            },
            {
                "title": "夏津县",
                "code": "371427"
            },
            {
                "title": "武城县",
                "code": "371428"
            },
            {
                "title": "乐陵市",
                "code": "371481"
            },
            {
                "title": "禹城市",
                "code": "371482"
            }
            ]
        },
        {
            "title": "聊城",
            "code": "371500",
            "children": [{
                "title": "东昌府区",
                "code": "371502"
            },
            {
                "title": "阳谷县",
                "code": "371521"
            },
            {
                "title": "莘县",
                "code": "371522"
            },
            {
                "title": "茌平县",
                "code": "371523"
            },
            {
                "title": "东阿县",
                "code": "371524"
            },
            {
                "title": "冠县",
                "code": "371525"
            },
            {
                "title": "高唐县",
                "code": "371526"
            },
            {
                "title": "临清市",
                "code": "371581"
            }
            ]
        },
        {
            "title": "滨州",
            "code": "371600",
            "children": [{
                "title": "滨城区",
                "code": "371602"
            },
            {
                "title": "沾化区",
                "code": "371603"
            },
            {
                "title": "惠民县",
                "code": "371621"
            },
            {
                "title": "阳信县",
                "code": "371622"
            },
            {
                "title": "无棣县",
                "code": "371623"
            },
            {
                "title": "博兴县",
                "code": "371625"
            },
            {
                "title": "邹平县",
                "code": "371626"
            }
            ]
        },
        {
            "title": "菏泽",
            "code": "371700",
            "children": [{
                "title": "牡丹区",
                "code": "371702"
            },
            {
                "title": "曹县",
                "code": "371721"
            },
            {
                "title": "单县",
                "code": "371722"
            },
            {
                "title": "成武县",
                "code": "371723"
            },
            {
                "title": "巨野县",
                "code": "371724"
            },
            {
                "title": "郓城县",
                "code": "371725"
            },
            {
                "title": "鄄城县",
                "code": "371726"
            },
            {
                "title": "定陶县",
                "code": "371727"
            },
            {
                "title": "东明县",
                "code": "371728"
            }
            ]
        }
        ]
    },
    {
        "title": "河南",
        "code": "410000",
        "children": [{
            "title": "郑州",
            "code": "410100",
            "children": [{
                "title": "中原区",
                "code": "410102"
            },
            {
                "title": "二七区",
                "code": "410103"
            },
            {
                "title": "管城回族区",
                "code": "410104"
            },
            {
                "title": "金水区",
                "code": "410105"
            },
            {
                "title": "上街区",
                "code": "410106"
            },
            {
                "title": "惠济区",
                "code": "410108"
            },
            {
                "title": "中牟县",
                "code": "410122"
            },
            {
                "title": "巩义市",
                "code": "410181"
            },
            {
                "title": "荥阳市",
                "code": "410182"
            },
            {
                "title": "新密市",
                "code": "410183"
            },
            {
                "title": "新郑市",
                "code": "410184"
            },
            {
                "title": "登封市",
                "code": "410185"
            }
            ]
        },
        {
            "title": "开封",
            "code": "410200",
            "children": [{
                "title": "龙亭区",
                "code": "410202"
            },
            {
                "title": "顺河回族区",
                "code": "410203"
            },
            {
                "title": "鼓楼区",
                "code": "410204"
            },
            {
                "title": "禹王台区",
                "code": "410205"
            },
            {
                "title": "祥符区",
                "code": "410212"
            },
            {
                "title": "杞县",
                "code": "410221"
            },
            {
                "title": "通许县",
                "code": "410222"
            },
            {
                "title": "尉氏县",
                "code": "410223"
            },
            {
                "title": "兰考县",
                "code": "410225"
            }
            ]
        },
        {
            "title": "洛阳",
            "code": "410300",
            "children": [{
                "title": "老城区",
                "code": "410302"
            },
            {
                "title": "西工区",
                "code": "410303"
            },
            {
                "title": "瀍河回族区",
                "code": "410304"
            },
            {
                "title": "涧西区",
                "code": "410305"
            },
            {
                "title": "吉利区",
                "code": "410306"
            },
            {
                "title": "洛龙区",
                "code": "410311"
            },
            {
                "title": "孟津县",
                "code": "410322"
            },
            {
                "title": "新安县",
                "code": "410323"
            },
            {
                "title": "栾川县",
                "code": "410324"
            },
            {
                "title": "嵩县",
                "code": "410325"
            },
            {
                "title": "汝阳县",
                "code": "410326"
            },
            {
                "title": "宜阳县",
                "code": "410327"
            },
            {
                "title": "洛宁县",
                "code": "410328"
            },
            {
                "title": "伊川县",
                "code": "410329"
            },
            {
                "title": "偃师市",
                "code": "410381"
            }
            ]
        },
        {
            "title": "平顶山",
            "code": "410400",
            "children": [{
                "title": "新华区",
                "code": "410402"
            },
            {
                "title": "卫东区",
                "code": "410403"
            },
            {
                "title": "石龙区",
                "code": "410404"
            },
            {
                "title": "湛河区",
                "code": "410411"
            },
            {
                "title": "宝丰县",
                "code": "410421"
            },
            {
                "title": "叶县",
                "code": "410422"
            },
            {
                "title": "鲁山县",
                "code": "410423"
            },
            {
                "title": "郏县",
                "code": "410425"
            },
            {
                "title": "舞钢市",
                "code": "410481"
            },
            {
                "title": "汝州市",
                "code": "410482"
            }
            ]
        },
        {
            "title": "安阳",
            "code": "410500",
            "children": [{
                "title": "文峰区",
                "code": "410502"
            },
            {
                "title": "北关区",
                "code": "410503"
            },
            {
                "title": "殷都区",
                "code": "410505"
            },
            {
                "title": "龙安区",
                "code": "410506"
            },
            {
                "title": "安阳县",
                "code": "410522"
            },
            {
                "title": "汤阴县",
                "code": "410523"
            },
            {
                "title": "滑县",
                "code": "410526"
            },
            {
                "title": "内黄县",
                "code": "410527"
            },
            {
                "title": "林州市",
                "code": "410581"
            }
            ]
        },
        {
            "title": "鹤壁",
            "code": "410600",
            "children": [{
                "title": "鹤山区",
                "code": "410602"
            },
            {
                "title": "山城区",
                "code": "410603"
            },
            {
                "title": "淇滨区",
                "code": "410611"
            },
            {
                "title": "浚县",
                "code": "410621"
            },
            {
                "title": "淇县",
                "code": "410622"
            }
            ]
        },
        {
            "title": "新乡",
            "code": "410700",
            "children": [{
                "title": "红旗区",
                "code": "410702"
            },
            {
                "title": "卫滨区",
                "code": "410703"
            },
            {
                "title": "凤泉区",
                "code": "410704"
            },
            {
                "title": "牧野区",
                "code": "410711"
            },
            {
                "title": "新乡县",
                "code": "410721"
            },
            {
                "title": "获嘉县",
                "code": "410724"
            },
            {
                "title": "原阳县",
                "code": "410725"
            },
            {
                "title": "延津县",
                "code": "410726"
            },
            {
                "title": "封丘县",
                "code": "410727"
            },
            {
                "title": "长垣县",
                "code": "410728"
            },
            {
                "title": "卫辉市",
                "code": "410781"
            },
            {
                "title": "辉县市",
                "code": "410782"
            }
            ]
        },
        {
            "title": "焦作",
            "code": "410800",
            "children": [{
                "title": "解放区",
                "code": "410802"
            },
            {
                "title": "中站区",
                "code": "410803"
            },
            {
                "title": "马村区",
                "code": "410804"
            },
            {
                "title": "山阳区",
                "code": "410811"
            },
            {
                "title": "修武县",
                "code": "410821"
            },
            {
                "title": "博爱县",
                "code": "410822"
            },
            {
                "title": "武陟县",
                "code": "410823"
            },
            {
                "title": "温县",
                "code": "410825"
            },
            {
                "title": "沁阳市",
                "code": "410882"
            },
            {
                "title": "孟州市",
                "code": "410883"
            }
            ]
        },
        {
            "title": "濮阳",
            "code": "410900",
            "children": [{
                "title": "华龙区",
                "code": "410902"
            },
            {
                "title": "清丰县",
                "code": "410922"
            },
            {
                "title": "南乐县",
                "code": "410923"
            },
            {
                "title": "范县",
                "code": "410926"
            },
            {
                "title": "台前县",
                "code": "410927"
            },
            {
                "title": "濮阳县",
                "code": "410928"
            }
            ]
        },
        {
            "title": "许昌",
            "code": "411000",
            "children": [{
                "title": "魏都区",
                "code": "411002"
            },
            {
                "title": "许昌县",
                "code": "411023"
            },
            {
                "title": "鄢陵县",
                "code": "411024"
            },
            {
                "title": "襄城县",
                "code": "411025"
            },
            {
                "title": "禹州市",
                "code": "411081"
            },
            {
                "title": "长葛市",
                "code": "411082"
            }
            ]
        },
        {
            "title": "漯河",
            "code": "411100",
            "children": [{
                "title": "源汇区",
                "code": "411102"
            },
            {
                "title": "郾城区",
                "code": "411103"
            },
            {
                "title": "召陵区",
                "code": "411104"
            },
            {
                "title": "舞阳县",
                "code": "411121"
            },
            {
                "title": "临颍县",
                "code": "411122"
            }
            ]
        },
        {
            "title": "三门峡",
            "code": "411200",
            "children": [{
                "title": "湖滨区",
                "code": "411202"
            },
            {
                "title": "渑池县",
                "code": "411221"
            },
            {
                "title": "陕县",
                "code": "411222"
            },
            {
                "title": "卢氏县",
                "code": "411224"
            },
            {
                "title": "义马市",
                "code": "411281"
            },
            {
                "title": "灵宝市",
                "code": "411282"
            }
            ]
        },
        {
            "title": "南阳",
            "code": "411300",
            "children": [{
                "title": "宛城区",
                "code": "411302"
            },
            {
                "title": "卧龙区",
                "code": "411303"
            },
            {
                "title": "南召县",
                "code": "411321"
            },
            {
                "title": "方城县",
                "code": "411322"
            },
            {
                "title": "西峡县",
                "code": "411323"
            },
            {
                "title": "镇平县",
                "code": "411324"
            },
            {
                "title": "内乡县",
                "code": "411325"
            },
            {
                "title": "淅川县",
                "code": "411326"
            },
            {
                "title": "社旗县",
                "code": "411327"
            },
            {
                "title": "唐河县",
                "code": "411328"
            },
            {
                "title": "新野县",
                "code": "411329"
            },
            {
                "title": "桐柏县",
                "code": "411330"
            },
            {
                "title": "邓州市",
                "code": "411381"
            }
            ]
        },
        {
            "title": "商丘",
            "code": "411400",
            "children": [{
                "title": "梁园区",
                "code": "411402"
            },
            {
                "title": "睢阳区",
                "code": "411403"
            },
            {
                "title": "民权县",
                "code": "411421"
            },
            {
                "title": "睢县",
                "code": "411422"
            },
            {
                "title": "宁陵县",
                "code": "411423"
            },
            {
                "title": "柘城县",
                "code": "411424"
            },
            {
                "title": "虞城县",
                "code": "411425"
            },
            {
                "title": "夏邑县",
                "code": "411426"
            },
            {
                "title": "永城市",
                "code": "411481"
            }
            ]
        },
        {
            "title": "信阳",
            "code": "411500",
            "children": [{
                "title": "浉河区",
                "code": "411502"
            },
            {
                "title": "平桥区",
                "code": "411503"
            },
            {
                "title": "罗山县",
                "code": "411521"
            },
            {
                "title": "光山县",
                "code": "411522"
            },
            {
                "title": "新县",
                "code": "411523"
            },
            {
                "title": "商城县",
                "code": "411524"
            },
            {
                "title": "固始县",
                "code": "411525"
            },
            {
                "title": "潢川县",
                "code": "411526"
            },
            {
                "title": "淮滨县",
                "code": "411527"
            },
            {
                "title": "息县",
                "code": "411528"
            }
            ]
        },
        {
            "title": "周口",
            "code": "411600",
            "children": [{
                "title": "川汇区",
                "code": "411602"
            },
            {
                "title": "扶沟县",
                "code": "411621"
            },
            {
                "title": "西华县",
                "code": "411622"
            },
            {
                "title": "商水县",
                "code": "411623"
            },
            {
                "title": "沈丘县",
                "code": "411624"
            },
            {
                "title": "郸城县",
                "code": "411625"
            },
            {
                "title": "淮阳县",
                "code": "411626"
            },
            {
                "title": "太康县",
                "code": "411627"
            },
            {
                "title": "鹿邑县",
                "code": "411628"
            },
            {
                "title": "项城市",
                "code": "411681"
            }
            ]
        },
        {
            "title": "驻马店",
            "code": "411700",
            "children": [{
                "title": "驿城区",
                "code": "411702"
            },
            {
                "title": "西平县",
                "code": "411721"
            },
            {
                "title": "上蔡县",
                "code": "411722"
            },
            {
                "title": "平舆县",
                "code": "411723"
            },
            {
                "title": "正阳县",
                "code": "411724"
            },
            {
                "title": "确山县",
                "code": "411725"
            },
            {
                "title": "泌阳县",
                "code": "411726"
            },
            {
                "title": "汝南县",
                "code": "411727"
            },
            {
                "title": "遂平县",
                "code": "411728"
            },
            {
                "title": "新蔡县",
                "code": "411729"
            }
            ]
        },
        {
            "title": "济源",
            "code": "419001"
        }
        ]
    },
    {
        "title": "湖北",
        "code": "420000",
        "children": [{
            "title": "武汉",
            "code": "420100",
            "children": [{
                "title": "江岸区",
                "code": "420102"
            },
            {
                "title": "江汉区",
                "code": "420103"
            },
            {
                "title": "硚口区",
                "code": "420104"
            },
            {
                "title": "汉阳区",
                "code": "420105"
            },
            {
                "title": "武昌区",
                "code": "420106"
            },
            {
                "title": "青山区",
                "code": "420107"
            },
            {
                "title": "洪山区",
                "code": "420111"
            },
            {
                "title": "东西湖区",
                "code": "420112"
            },
            {
                "title": "汉南区",
                "code": "420113"
            },
            {
                "title": "蔡甸区",
                "code": "420114"
            },
            {
                "title": "江夏区",
                "code": "420115"
            },
            {
                "title": "黄陂区",
                "code": "420116"
            },
            {
                "title": "新洲区",
                "code": "420117"
            }
            ]
        },
        {
            "title": "黄石",
            "code": "420200",
            "children": [{
                "title": "黄石港区",
                "code": "420202"
            },
            {
                "title": "西塞山区",
                "code": "420203"
            },
            {
                "title": "下陆区",
                "code": "420204"
            },
            {
                "title": "铁山区",
                "code": "420205"
            },
            {
                "title": "阳新县",
                "code": "420222"
            },
            {
                "title": "大冶市",
                "code": "420281"
            }
            ]
        },
        {
            "title": "十堰",
            "code": "420300",
            "children": [{
                "title": "茅箭区",
                "code": "420302"
            },
            {
                "title": "张湾区",
                "code": "420303"
            },
            {
                "title": "郧阳区",
                "code": "420304"
            },
            {
                "title": "郧西县",
                "code": "420322"
            },
            {
                "title": "竹山县",
                "code": "420323"
            },
            {
                "title": "竹溪县",
                "code": "420324"
            },
            {
                "title": "房县",
                "code": "420325"
            },
            {
                "title": "丹江口市",
                "code": "420381"
            }
            ]
        },
        {
            "title": "宜昌",
            "code": "420500",
            "children": [{
                "title": "西陵区",
                "code": "420502"
            },
            {
                "title": "伍家岗区",
                "code": "420503"
            },
            {
                "title": "点军区",
                "code": "420504"
            },
            {
                "title": "猇亭区",
                "code": "420505"
            },
            {
                "title": "夷陵区",
                "code": "420506"
            },
            {
                "title": "远安县",
                "code": "420525"
            },
            {
                "title": "兴山县",
                "code": "420526"
            },
            {
                "title": "秭归县",
                "code": "420527"
            },
            {
                "title": "长阳土家族自治县",
                "code": "420528"
            },
            {
                "title": "五峰土家族自治县",
                "code": "420529"
            },
            {
                "title": "宜都市",
                "code": "420581"
            },
            {
                "title": "当阳市",
                "code": "420582"
            },
            {
                "title": "枝江市",
                "code": "420583"
            }
            ]
        },
        {
            "title": "襄阳",
            "code": "420600",
            "children": [{
                "title": "襄城区",
                "code": "420602"
            },
            {
                "title": "樊城区",
                "code": "420606"
            },
            {
                "title": "襄州区",
                "code": "420607"
            },
            {
                "title": "南漳县",
                "code": "420624"
            },
            {
                "title": "谷城县",
                "code": "420625"
            },
            {
                "title": "保康县",
                "code": "420626"
            },
            {
                "title": "老河口市",
                "code": "420682"
            },
            {
                "title": "枣阳市",
                "code": "420683"
            },
            {
                "title": "宜城市",
                "code": "420684"
            }
            ]
        },
        {
            "title": "鄂州",
            "code": "420700",
            "children": [{
                "title": "梁子湖区",
                "code": "420702"
            },
            {
                "title": "华容区",
                "code": "420703"
            },
            {
                "title": "鄂城区",
                "code": "420704"
            }
            ]
        },
        {
            "title": "荆门",
            "code": "420800",
            "children": [{
                "title": "东宝区",
                "code": "420802"
            },
            {
                "title": "掇刀区",
                "code": "420804"
            },
            {
                "title": "京山县",
                "code": "420821"
            },
            {
                "title": "沙洋县",
                "code": "420822"
            },
            {
                "title": "钟祥市",
                "code": "420881"
            }
            ]
        },
        {
            "title": "孝感",
            "code": "420900",
            "children": [{
                "title": "孝南区",
                "code": "420902"
            },
            {
                "title": "孝昌县",
                "code": "420921"
            },
            {
                "title": "大悟县",
                "code": "420922"
            },
            {
                "title": "云梦县",
                "code": "420923"
            },
            {
                "title": "应城市",
                "code": "420981"
            },
            {
                "title": "安陆市",
                "code": "420982"
            },
            {
                "title": "汉川市",
                "code": "420984"
            }
            ]
        },
        {
            "title": "荆州",
            "code": "421000",
            "children": [{
                "title": "沙市区",
                "code": "421002"
            },
            {
                "title": "荆州区",
                "code": "421003"
            },
            {
                "title": "公安县",
                "code": "421022"
            },
            {
                "title": "监利县",
                "code": "421023"
            },
            {
                "title": "江陵县",
                "code": "421024"
            },
            {
                "title": "石首市",
                "code": "421081"
            },
            {
                "title": "洪湖市",
                "code": "421083"
            },
            {
                "title": "松滋市",
                "code": "421087"
            }
            ]
        },
        {
            "title": "黄冈",
            "code": "421100",
            "children": [{
                "title": "黄州区",
                "code": "421102"
            },
            {
                "title": "团风县",
                "code": "421121"
            },
            {
                "title": "红安县",
                "code": "421122"
            },
            {
                "title": "罗田县",
                "code": "421123"
            },
            {
                "title": "英山县",
                "code": "421124"
            },
            {
                "title": "浠水县",
                "code": "421125"
            },
            {
                "title": "蕲春县",
                "code": "421126"
            },
            {
                "title": "黄梅县",
                "code": "421127"
            },
            {
                "title": "麻城市",
                "code": "421181"
            },
            {
                "title": "武穴市",
                "code": "421182"
            }
            ]
        },
        {
            "title": "咸宁",
            "code": "421200",
            "children": [{
                "title": "咸安区",
                "code": "421202"
            },
            {
                "title": "嘉鱼县",
                "code": "421221"
            },
            {
                "title": "通城县",
                "code": "421222"
            },
            {
                "title": "崇阳县",
                "code": "421223"
            },
            {
                "title": "通山县",
                "code": "421224"
            },
            {
                "title": "赤壁市",
                "code": "421281"
            }
            ]
        },
        {
            "title": "随州",
            "code": "421300",
            "children": [{
                "title": "曾都区",
                "code": "421303"
            },
            {
                "title": "随县",
                "code": "421321"
            },
            {
                "title": "广水市",
                "code": "421381"
            }
            ]
        },
        {
            "title": "恩施",
            "code": "422800",
            "children": [{
                "title": "恩施市",
                "code": "422801"
            },
            {
                "title": "利川市",
                "code": "422802"
            },
            {
                "title": "建始县",
                "code": "422822"
            },
            {
                "title": "巴东县",
                "code": "422823"
            },
            {
                "title": "宣恩县",
                "code": "422825"
            },
            {
                "title": "咸丰县",
                "code": "422826"
            },
            {
                "title": "来凤县",
                "code": "422827"
            },
            {
                "title": "鹤峰县",
                "code": "422828"
            }
            ]
        },
        {
            "title": "仙桃",
            "code": "429004"
        },
        {
            "title": "潜江",
            "code": "429005"
        },
        {
            "title": "天门",
            "code": "429006"
        },
        {
            "title": "神农架",
            "code": "429021"
        }
        ]
    },
    {
        "title": "湖南",
        "code": "430000",
        "children": [{
            "title": "长沙",
            "code": "430100",
            "children": [{
                "title": "芙蓉区",
                "code": "430102"
            },
            {
                "title": "天心区",
                "code": "430103"
            },
            {
                "title": "岳麓区",
                "code": "430104"
            },
            {
                "title": "开福区",
                "code": "430105"
            },
            {
                "title": "雨花区",
                "code": "430111"
            },
            {
                "title": "望城区",
                "code": "430112"
            },
            {
                "title": "长沙县",
                "code": "430121"
            },
            {
                "title": "宁乡县",
                "code": "430124"
            },
            {
                "title": "浏阳市",
                "code": "430181"
            }
            ]
        },
        {
            "title": "株洲",
            "code": "430200",
            "children": [{
                "title": "荷塘区",
                "code": "430202"
            },
            {
                "title": "芦淞区",
                "code": "430203"
            },
            {
                "title": "石峰区",
                "code": "430204"
            },
            {
                "title": "天元区",
                "code": "430211"
            },
            {
                "title": "株洲县",
                "code": "430221"
            },
            {
                "title": "攸县",
                "code": "430223"
            },
            {
                "title": "茶陵县",
                "code": "430224"
            },
            {
                "title": "炎陵县",
                "code": "430225"
            },
            {
                "title": "醴陵市",
                "code": "430281"
            }
            ]
        },
        {
            "title": "湘潭",
            "code": "430300",
            "children": [{
                "title": "雨湖区",
                "code": "430302"
            },
            {
                "title": "岳塘区",
                "code": "430304"
            },
            {
                "title": "湘潭县",
                "code": "430321"
            },
            {
                "title": "湘乡市",
                "code": "430381"
            },
            {
                "title": "韶山市",
                "code": "430382"
            }
            ]
        },
        {
            "title": "衡阳",
            "code": "430400",
            "children": [{
                "title": "珠晖区",
                "code": "430405"
            },
            {
                "title": "雁峰区",
                "code": "430406"
            },
            {
                "title": "石鼓区",
                "code": "430407"
            },
            {
                "title": "蒸湘区",
                "code": "430408"
            },
            {
                "title": "南岳区",
                "code": "430412"
            },
            {
                "title": "衡阳县",
                "code": "430421"
            },
            {
                "title": "衡南县",
                "code": "430422"
            },
            {
                "title": "衡山县",
                "code": "430423"
            },
            {
                "title": "衡东县",
                "code": "430424"
            },
            {
                "title": "祁东县",
                "code": "430426"
            },
            {
                "title": "耒阳市",
                "code": "430481"
            },
            {
                "title": "常宁市",
                "code": "430482"
            }
            ]
        },
        {
            "title": "邵阳",
            "code": "430500",
            "children": [{
                "title": "双清区",
                "code": "430502"
            },
            {
                "title": "大祥区",
                "code": "430503"
            },
            {
                "title": "北塔区",
                "code": "430511"
            },
            {
                "title": "邵东县",
                "code": "430521"
            },
            {
                "title": "新邵县",
                "code": "430522"
            },
            {
                "title": "邵阳县",
                "code": "430523"
            },
            {
                "title": "隆回县",
                "code": "430524"
            },
            {
                "title": "洞口县",
                "code": "430525"
            },
            {
                "title": "绥宁县",
                "code": "430527"
            },
            {
                "title": "新宁县",
                "code": "430528"
            },
            {
                "title": "城步苗族自治县",
                "code": "430529"
            },
            {
                "title": "武冈市",
                "code": "430581"
            }
            ]
        },
        {
            "title": "岳阳",
            "code": "430600",
            "children": [{
                "title": "岳阳楼区",
                "code": "430602"
            },
            {
                "title": "云溪区",
                "code": "430603"
            },
            {
                "title": "君山区",
                "code": "430611"
            },
            {
                "title": "岳阳县",
                "code": "430621"
            },
            {
                "title": "华容县",
                "code": "430623"
            },
            {
                "title": "湘阴县",
                "code": "430624"
            },
            {
                "title": "平江县",
                "code": "430626"
            },
            {
                "title": "汨罗市",
                "code": "430681"
            },
            {
                "title": "临湘市",
                "code": "430682"
            }
            ]
        },
        {
            "title": "常德",
            "code": "430700",
            "children": [{
                "title": "武陵区",
                "code": "430702"
            },
            {
                "title": "鼎城区",
                "code": "430703"
            },
            {
                "title": "安乡县",
                "code": "430721"
            },
            {
                "title": "汉寿县",
                "code": "430722"
            },
            {
                "title": "澧县",
                "code": "430723"
            },
            {
                "title": "临澧县",
                "code": "430724"
            },
            {
                "title": "桃源县",
                "code": "430725"
            },
            {
                "title": "石门县",
                "code": "430726"
            },
            {
                "title": "津市市",
                "code": "430781"
            }
            ]
        },
        {
            "title": "张家界",
            "code": "430800",
            "children": [{
                "title": "永定区",
                "code": "430802"
            },
            {
                "title": "武陵源区",
                "code": "430811"
            },
            {
                "title": "慈利县",
                "code": "430821"
            },
            {
                "title": "桑植县",
                "code": "430822"
            }
            ]
        },
        {
            "title": "益阳",
            "code": "430900",
            "children": [{
                "title": "资阳区",
                "code": "430902"
            },
            {
                "title": "赫山区",
                "code": "430903"
            },
            {
                "title": "南县",
                "code": "430921"
            },
            {
                "title": "桃江县",
                "code": "430922"
            },
            {
                "title": "安化县",
                "code": "430923"
            },
            {
                "title": "沅江市",
                "code": "430981"
            }
            ]
        },
        {
            "title": "郴州",
            "code": "431000",
            "children": [{
                "title": "北湖区",
                "code": "431002"
            },
            {
                "title": "苏仙区",
                "code": "431003"
            },
            {
                "title": "桂阳县",
                "code": "431021"
            },
            {
                "title": "宜章县",
                "code": "431022"
            },
            {
                "title": "永兴县",
                "code": "431023"
            },
            {
                "title": "嘉禾县",
                "code": "431024"
            },
            {
                "title": "临武县",
                "code": "431025"
            },
            {
                "title": "汝城县",
                "code": "431026"
            },
            {
                "title": "桂东县",
                "code": "431027"
            },
            {
                "title": "安仁县",
                "code": "431028"
            },
            {
                "title": "资兴市",
                "code": "431081"
            }
            ]
        },
        {
            "title": "永州",
            "code": "431100",
            "children": [{
                "title": "零陵区",
                "code": "431102"
            },
            {
                "title": "冷水滩区",
                "code": "431103"
            },
            {
                "title": "祁阳县",
                "code": "431121"
            },
            {
                "title": "东安县",
                "code": "431122"
            },
            {
                "title": "双牌县",
                "code": "431123"
            },
            {
                "title": "道县",
                "code": "431124"
            },
            {
                "title": "江永县",
                "code": "431125"
            },
            {
                "title": "宁远县",
                "code": "431126"
            },
            {
                "title": "蓝山县",
                "code": "431127"
            },
            {
                "title": "新田县",
                "code": "431128"
            },
            {
                "title": "江华瑶族自治县",
                "code": "431129"
            }
            ]
        },
        {
            "title": "怀化",
            "code": "431200",
            "children": [{
                "title": "鹤城区",
                "code": "431202"
            },
            {
                "title": "中方县",
                "code": "431221"
            },
            {
                "title": "沅陵县",
                "code": "431222"
            },
            {
                "title": "辰溪县",
                "code": "431223"
            },
            {
                "title": "溆浦县",
                "code": "431224"
            },
            {
                "title": "会同县",
                "code": "431225"
            },
            {
                "title": "麻阳苗族自治县",
                "code": "431226"
            },
            {
                "title": "新晃侗族自治县",
                "code": "431227"
            },
            {
                "title": "芷江侗族自治县",
                "code": "431228"
            },
            {
                "title": "靖州苗族侗族自治县",
                "code": "431229"
            },
            {
                "title": "通道侗族自治县",
                "code": "431230"
            },
            {
                "title": "洪江市",
                "code": "431281"
            }
            ]
        },
        {
            "title": "娄底",
            "code": "431300",
            "children": [{
                "title": "娄星区",
                "code": "431302"
            },
            {
                "title": "双峰县",
                "code": "431321"
            },
            {
                "title": "新化县",
                "code": "431322"
            },
            {
                "title": "冷水江市",
                "code": "431381"
            },
            {
                "title": "涟源市",
                "code": "431382"
            }
            ]
        },
        {
            "title": "湘西",
            "code": "433100",
            "children": [{
                "title": "吉首市",
                "code": "433101"
            },
            {
                "title": "泸溪县",
                "code": "433122"
            },
            {
                "title": "凤凰县",
                "code": "433123"
            },
            {
                "title": "花垣县",
                "code": "433124"
            },
            {
                "title": "保靖县",
                "code": "433125"
            },
            {
                "title": "古丈县",
                "code": "433126"
            },
            {
                "title": "永顺县",
                "code": "433127"
            },
            {
                "title": "龙山县",
                "code": "433130"
            }
            ]
        }
        ]
    },
    {
        "title": "广东",
        "code": "440000",
        "children": [{
            "title": "广州",
            "code": "440100",
            "children": [{
                "title": "荔湾区",
                "code": "440103"
            },
            {
                "title": "越秀区",
                "code": "440104"
            },
            {
                "title": "海珠区",
                "code": "440105"
            },
            {
                "title": "天河区",
                "code": "440106"
            },
            {
                "title": "白云区",
                "code": "440111"
            },
            {
                "title": "黄埔区",
                "code": "440112"
            },
            {
                "title": "番禺区",
                "code": "440113"
            },
            {
                "title": "花都区",
                "code": "440114"
            },
            {
                "title": "南沙区",
                "code": "440115"
            },
            {
                "title": "从化区",
                "code": "440117"
            },
            {
                "title": "增城区",
                "code": "440118"
            }
            ]
        },
        {
            "title": "韶关",
            "code": "440200",
            "children": [{
                "title": "武江区",
                "code": "440203"
            },
            {
                "title": "浈江区",
                "code": "440204"
            },
            {
                "title": "曲江区",
                "code": "440205"
            },
            {
                "title": "始兴县",
                "code": "440222"
            },
            {
                "title": "仁化县",
                "code": "440224"
            },
            {
                "title": "翁源县",
                "code": "440229"
            },
            {
                "title": "乳源瑶族自治县",
                "code": "440232"
            },
            {
                "title": "新丰县",
                "code": "440233"
            },
            {
                "title": "乐昌市",
                "code": "440281"
            },
            {
                "title": "南雄市",
                "code": "440282"
            }
            ]
        },
        {
            "title": "深圳",
            "code": "440300",
            "children": [{
                "title": "罗湖区",
                "code": "440303"
            },
            {
                "title": "福田区",
                "code": "440304"
            },
            {
                "title": "南山区",
                "code": "440305"
            },
            {
                "title": "宝安区",
                "code": "440306"
            },
            {
                "title": "龙岗区",
                "code": "440307"
            },
            {
                "title": "盐田区",
                "code": "440308"
            }
            ]
        },
        {
            "title": "珠海",
            "code": "440400",
            "children": [{
                "title": "香洲区",
                "code": "440402"
            },
            {
                "title": "斗门区",
                "code": "440403"
            },
            {
                "title": "金湾区",
                "code": "440404"
            }
            ]
        },
        {
            "title": "汕头",
            "code": "440500",
            "children": [{
                "title": "龙湖区",
                "code": "440507"
            },
            {
                "title": "金平区",
                "code": "440511"
            },
            {
                "title": "濠江区",
                "code": "440512"
            },
            {
                "title": "潮阳区",
                "code": "440513"
            },
            {
                "title": "潮南区",
                "code": "440514"
            },
            {
                "title": "澄海区",
                "code": "440515"
            },
            {
                "title": "南澳县",
                "code": "440523"
            }
            ]
        },
        {
            "title": "佛山",
            "code": "440600",
            "children": [{
                "title": "禅城区",
                "code": "440604"
            },
            {
                "title": "南海区",
                "code": "440605"
            },
            {
                "title": "顺德区",
                "code": "440606"
            },
            {
                "title": "三水区",
                "code": "440607"
            },
            {
                "title": "高明区",
                "code": "440608"
            }
            ]
        },
        {
            "title": "江门",
            "code": "440700",
            "children": [{
                "title": "蓬江区",
                "code": "440703"
            },
            {
                "title": "江海区",
                "code": "440704"
            },
            {
                "title": "新会区",
                "code": "440705"
            },
            {
                "title": "台山市",
                "code": "440781"
            },
            {
                "title": "开平市",
                "code": "440783"
            },
            {
                "title": "鹤山市",
                "code": "440784"
            },
            {
                "title": "恩平市",
                "code": "440785"
            }
            ]
        },
        {
            "title": "湛江",
            "code": "440800",
            "children": [{
                "title": "赤坎区",
                "code": "440802"
            },
            {
                "title": "霞山区",
                "code": "440803"
            },
            {
                "title": "坡头区",
                "code": "440804"
            },
            {
                "title": "麻章区",
                "code": "440811"
            },
            {
                "title": "遂溪县",
                "code": "440823"
            },
            {
                "title": "徐闻县",
                "code": "440825"
            },
            {
                "title": "廉江市",
                "code": "440881"
            },
            {
                "title": "雷州市",
                "code": "440882"
            },
            {
                "title": "吴川市",
                "code": "440883"
            }
            ]
        },
        {
            "title": "茂名",
            "code": "440900",
            "children": [{
                "title": "茂南区",
                "code": "440902"
            },
            {
                "title": "电白区",
                "code": "440904"
            },
            {
                "title": "高州市",
                "code": "440981"
            },
            {
                "title": "化州市",
                "code": "440982"
            },
            {
                "title": "信宜市",
                "code": "440983"
            }
            ]
        },
        {
            "title": "肇庆",
            "code": "441200",
            "children": [{
                "title": "端州区",
                "code": "441202"
            },
            {
                "title": "鼎湖区",
                "code": "441203"
            },
            {
                "title": "广宁县",
                "code": "441223"
            },
            {
                "title": "怀集县",
                "code": "441224"
            },
            {
                "title": "封开县",
                "code": "441225"
            },
            {
                "title": "德庆县",
                "code": "441226"
            },
            {
                "title": "高要市",
                "code": "441283"
            },
            {
                "title": "四会市",
                "code": "441284"
            }
            ]
        },
        {
            "title": "惠州",
            "code": "441300",
            "children": [{
                "title": "惠城区",
                "code": "441302"
            },
            {
                "title": "惠阳区",
                "code": "441303"
            },
            {
                "title": "博罗县",
                "code": "441322"
            },
            {
                "title": "惠东县",
                "code": "441323"
            },
            {
                "title": "龙门县",
                "code": "441324"
            }
            ]
        },
        {
            "title": "梅州",
            "code": "441400",
            "children": [{
                "title": "梅江区",
                "code": "441402"
            },
            {
                "title": "梅县区",
                "code": "441403"
            },
            {
                "title": "大埔县",
                "code": "441422"
            },
            {
                "title": "丰顺县",
                "code": "441423"
            },
            {
                "title": "五华县",
                "code": "441424"
            },
            {
                "title": "平远县",
                "code": "441426"
            },
            {
                "title": "蕉岭县",
                "code": "441427"
            },
            {
                "title": "兴宁市",
                "code": "441481"
            }
            ]
        },
        {
            "title": "汕尾",
            "code": "441500",
            "children": [{
                "title": "城区",
                "code": "441502"
            },
            {
                "title": "海丰县",
                "code": "441521"
            },
            {
                "title": "陆河县",
                "code": "441523"
            },
            {
                "title": "陆丰市",
                "code": "441581"
            }
            ]
        },
        {
            "title": "河源",
            "code": "441600",
            "children": [{
                "title": "源城区",
                "code": "441602"
            },
            {
                "title": "紫金县",
                "code": "441621"
            },
            {
                "title": "龙川县",
                "code": "441622"
            },
            {
                "title": "连平县",
                "code": "441623"
            },
            {
                "title": "和平县",
                "code": "441624"
            },
            {
                "title": "东源县",
                "code": "441625"
            }
            ]
        },
        {
            "title": "阳江",
            "code": "441700",
            "children": [{
                "title": "江城区",
                "code": "441702"
            },
            {
                "title": "阳东区",
                "code": "441704"
            },
            {
                "title": "阳西县",
                "code": "441721"
            },
            {
                "title": "阳春市",
                "code": "441781"
            }
            ]
        },
        {
            "title": "清远",
            "code": "441800",
            "children": [{
                "title": "清城区",
                "code": "441802"
            },
            {
                "title": "清新区",
                "code": "441803"
            },
            {
                "title": "佛冈县",
                "code": "441821"
            },
            {
                "title": "阳山县",
                "code": "441823"
            },
            {
                "title": "连山壮族瑶族自治县",
                "code": "441825"
            },
            {
                "title": "连南瑶族自治县",
                "code": "441826"
            },
            {
                "title": "英德市",
                "code": "441881"
            },
            {
                "title": "连州市",
                "code": "441882"
            }
            ]
        },
        {
            "title": "东莞",
            "code": "441900",
            "children": [

            ]
        },
        {
            "title": "中山",
            "code": "442000",
            "children": [

            ]
        },
        {
            "title": "潮州",
            "code": "445100",
            "children": [{
                "title": "湘桥区",
                "code": "445102"
            },
            {
                "title": "潮安区",
                "code": "445103"
            },
            {
                "title": "饶平县",
                "code": "445122"
            }
            ]
        },
        {
            "title": "揭阳",
            "code": "445200",
            "children": [{
                "title": "榕城区",
                "code": "445202"
            },
            {
                "title": "揭东区",
                "code": "445203"
            },
            {
                "title": "揭西县",
                "code": "445222"
            },
            {
                "title": "惠来县",
                "code": "445224"
            },
            {
                "title": "普宁市",
                "code": "445281"
            }
            ]
        },
        {
            "title": "云浮",
            "code": "445300",
            "children": [{
                "title": "云城区",
                "code": "445302"
            },
            {
                "title": "云安区",
                "code": "445303"
            },
            {
                "title": "新兴县",
                "code": "445321"
            },
            {
                "title": "郁南县",
                "code": "445322"
            },
            {
                "title": "罗定市",
                "code": "445381"
            }
            ]
        }
        ]
    },
    {
        "title": "广西",
        "code": "450000",
        "children": [{
            "title": "南宁",
            "code": "450100",
            "children": [{
                "title": "兴宁区",
                "code": "450102"
            },
            {
                "title": "青秀区",
                "code": "450103"
            },
            {
                "title": "江南区",
                "code": "450105"
            },
            {
                "title": "西乡塘区",
                "code": "450107"
            },
            {
                "title": "良庆区",
                "code": "450108"
            },
            {
                "title": "邕宁区",
                "code": "450109"
            },
            {
                "title": "武鸣县",
                "code": "450122"
            },
            {
                "title": "隆安县",
                "code": "450123"
            },
            {
                "title": "马山县",
                "code": "450124"
            },
            {
                "title": "上林县",
                "code": "450125"
            },
            {
                "title": "宾阳县",
                "code": "450126"
            },
            {
                "title": "横县",
                "code": "450127"
            }
            ]
        },
        {
            "title": "柳州",
            "code": "450200",
            "children": [{
                "title": "城中区",
                "code": "450202"
            },
            {
                "title": "鱼峰区",
                "code": "450203"
            },
            {
                "title": "柳南区",
                "code": "450204"
            },
            {
                "title": "柳北区",
                "code": "450205"
            },
            {
                "title": "柳江县",
                "code": "450221"
            },
            {
                "title": "柳城县",
                "code": "450222"
            },
            {
                "title": "鹿寨县",
                "code": "450223"
            },
            {
                "title": "融安县",
                "code": "450224"
            },
            {
                "title": "融水苗族自治县",
                "code": "450225"
            },
            {
                "title": "三江侗族自治县",
                "code": "450226"
            }
            ]
        },
        {
            "title": "桂林",
            "code": "450300",
            "children": [{
                "title": "秀峰区",
                "code": "450302"
            },
            {
                "title": "叠彩区",
                "code": "450303"
            },
            {
                "title": "象山区",
                "code": "450304"
            },
            {
                "title": "七星区",
                "code": "450305"
            },
            {
                "title": "雁山区",
                "code": "450311"
            },
            {
                "title": "临桂区",
                "code": "450312"
            },
            {
                "title": "阳朔县",
                "code": "450321"
            },
            {
                "title": "灵川县",
                "code": "450323"
            },
            {
                "title": "全州县",
                "code": "450324"
            },
            {
                "title": "兴安县",
                "code": "450325"
            },
            {
                "title": "永福县",
                "code": "450326"
            },
            {
                "title": "灌阳县",
                "code": "450327"
            },
            {
                "title": "龙胜各族自治县",
                "code": "450328"
            },
            {
                "title": "资源县",
                "code": "450329"
            },
            {
                "title": "平乐县",
                "code": "450330"
            },
            {
                "title": "荔浦县",
                "code": "450331"
            },
            {
                "title": "恭城瑶族自治县",
                "code": "450332"
            }
            ]
        },
        {
            "title": "梧州",
            "code": "450400",
            "children": [{
                "title": "万秀区",
                "code": "450403"
            },
            {
                "title": "长洲区",
                "code": "450405"
            },
            {
                "title": "龙圩区",
                "code": "450406"
            },
            {
                "title": "苍梧县",
                "code": "450421"
            },
            {
                "title": "藤县",
                "code": "450422"
            },
            {
                "title": "蒙山县",
                "code": "450423"
            },
            {
                "title": "岑溪市",
                "code": "450481"
            }
            ]
        },
        {
            "title": "北海",
            "code": "450500",
            "children": [{
                "title": "海城区",
                "code": "450502"
            },
            {
                "title": "银海区",
                "code": "450503"
            },
            {
                "title": "铁山港区",
                "code": "450512"
            },
            {
                "title": "合浦县",
                "code": "450521"
            }
            ]
        },
        {
            "title": "防城港",
            "code": "450600",
            "children": [{
                "title": "港口区",
                "code": "450602"
            },
            {
                "title": "防城区",
                "code": "450603"
            },
            {
                "title": "上思县",
                "code": "450621"
            },
            {
                "title": "东兴市",
                "code": "450681"
            }
            ]
        },
        {
            "title": "钦州",
            "code": "450700",
            "children": [{
                "title": "钦南区",
                "code": "450702"
            },
            {
                "title": "钦北区",
                "code": "450703"
            },
            {
                "title": "灵山县",
                "code": "450721"
            },
            {
                "title": "浦北县",
                "code": "450722"
            }
            ]
        },
        {
            "title": "贵港",
            "code": "450800",
            "children": [{
                "title": "港北区",
                "code": "450802"
            },
            {
                "title": "港南区",
                "code": "450803"
            },
            {
                "title": "覃塘区",
                "code": "450804"
            },
            {
                "title": "平南县",
                "code": "450821"
            },
            {
                "title": "桂平市",
                "code": "450881"
            }
            ]
        },
        {
            "title": "玉林",
            "code": "450900",
            "children": [{
                "title": "玉州区",
                "code": "450902"
            },
            {
                "title": "福绵区",
                "code": "450903"
            },
            {
                "title": "容县",
                "code": "450921"
            },
            {
                "title": "陆川县",
                "code": "450922"
            },
            {
                "title": "博白县",
                "code": "450923"
            },
            {
                "title": "兴业县",
                "code": "450924"
            },
            {
                "title": "北流市",
                "code": "450981"
            }
            ]
        },
        {
            "title": "百色",
            "code": "451000",
            "children": [{
                "title": "右江区",
                "code": "451002"
            },
            {
                "title": "田阳县",
                "code": "451021"
            },
            {
                "title": "田东县",
                "code": "451022"
            },
            {
                "title": "平果县",
                "code": "451023"
            },
            {
                "title": "德保县",
                "code": "451024"
            },
            {
                "title": "靖西县",
                "code": "451025"
            },
            {
                "title": "那坡县",
                "code": "451026"
            },
            {
                "title": "凌云县",
                "code": "451027"
            },
            {
                "title": "乐业县",
                "code": "451028"
            },
            {
                "title": "田林县",
                "code": "451029"
            },
            {
                "title": "西林县",
                "code": "451030"
            },
            {
                "title": "隆林各族自治县",
                "code": "451031"
            }
            ]
        },
        {
            "title": "贺州",
            "code": "451100",
            "children": [{
                "title": "八步区",
                "code": "451102"
            },
            {
                "title": "平桂管理区",
                "code": "451119"
            },
            {
                "title": "昭平县",
                "code": "451121"
            },
            {
                "title": "钟山县",
                "code": "451122"
            },
            {
                "title": "富川瑶族自治县",
                "code": "451123"
            }
            ]
        },
        {
            "title": "河池",
            "code": "451200",
            "children": [{
                "title": "金城江区",
                "code": "451202"
            },
            {
                "title": "南丹县",
                "code": "451221"
            },
            {
                "title": "天峨县",
                "code": "451222"
            },
            {
                "title": "凤山县",
                "code": "451223"
            },
            {
                "title": "东兰县",
                "code": "451224"
            },
            {
                "title": "罗城仫佬族自治县",
                "code": "451225"
            },
            {
                "title": "环江毛南族自治县",
                "code": "451226"
            },
            {
                "title": "巴马瑶族自治县",
                "code": "451227"
            },
            {
                "title": "都安瑶族自治县",
                "code": "451228"
            },
            {
                "title": "大化瑶族自治县",
                "code": "451229"
            },
            {
                "title": "宜州市",
                "code": "451281"
            }
            ]
        },
        {
            "title": "来宾",
            "code": "451300",
            "children": [{
                "title": "兴宾区",
                "code": "451302"
            },
            {
                "title": "忻城县",
                "code": "451321"
            },
            {
                "title": "象州县",
                "code": "451322"
            },
            {
                "title": "武宣县",
                "code": "451323"
            },
            {
                "title": "金秀瑶族自治县",
                "code": "451324"
            },
            {
                "title": "合山市",
                "code": "451381"
            }
            ]
        },
        {
            "title": "崇左",
            "code": "451400",
            "children": [{
                "title": "江州区",
                "code": "451402"
            },
            {
                "title": "扶绥县",
                "code": "451421"
            },
            {
                "title": "宁明县",
                "code": "451422"
            },
            {
                "title": "龙州县",
                "code": "451423"
            },
            {
                "title": "大新县",
                "code": "451424"
            },
            {
                "title": "天等县",
                "code": "451425"
            },
            {
                "title": "凭祥市",
                "code": "451481"
            }
            ]
        }
        ]
    },
    {
        "title": "海南",
        "code": "460000",
        "children": [{
            "title": "海口",
            "code": "460100",
            "children": [{
                "title": "秀英区",
                "code": "460105"
            },
            {
                "title": "龙华区",
                "code": "460106"
            },
            {
                "title": "琼山区",
                "code": "460107"
            },
            {
                "title": "美兰区",
                "code": "460108"
            }
            ]
        },
        {
            "title": "三亚",
            "code": "460200",
            "children": [{
                "title": "海棠区",
                "code": "460202"
            },
            {
                "title": "吉阳区",
                "code": "460203"
            },
            {
                "title": "天涯区",
                "code": "460204"
            },
            {
                "title": "崖州区",
                "code": "460205"
            }
            ]
        },
        {
            "title": "三沙",
            "code": "460300",
            "children": [{
                "title": "西沙群岛",
                "code": "460321"
            },
            {
                "title": "南沙群岛",
                "code": "460322"
            },
            {
                "title": "中沙群岛的岛礁及其海域",
                "code": "460323"
            }
            ]
        },
        {
            "title": "五指山",
            "code": "469001"
        },
        {
            "title": "琼海",
            "code": "469002"
        },
        {
            "title": "儋州",
            "code": "469003"
        },
        {
            "title": "文昌",
            "code": "469005"
        },
        {
            "title": "万宁",
            "code": "469006"
        },
        {
            "title": "东方",
            "code": "469007"
        },
        {
            "title": "定安县",
            "code": "469021"
        },
        {
            "title": "屯昌县",
            "code": "469022"
        },
        {
            "title": "澄迈县",
            "code": "469023"
        },
        {
            "title": "临高县",
            "code": "469024"
        },
        {
            "title": "白沙县",
            "code": "469025"
        },
        {
            "title": "昌江县",
            "code": "469026"
        },
        {
            "title": "乐东县",
            "code": "469027"
        },
        {
            "title": "陵水县",
            "code": "469028"
        },
        {
            "title": "保亭县",
            "code": "469029"
        },
        {
            "title": "琼中县",
            "code": "469030"
        }
        ]
    },
    {
        "title": "重庆",
        "code": "500000",
        "children": [{
            "title": "万州区",
            "code": "500101"
        },
        {
            "title": "涪陵区",
            "code": "500102"
        },
        {
            "title": "渝中区",
            "code": "500103"
        },
        {
            "title": "大渡口区",
            "code": "500104"
        },
        {
            "title": "江北区",
            "code": "500105"
        },
        {
            "title": "沙坪坝区",
            "code": "500106"
        },
        {
            "title": "九龙坡区",
            "code": "500107"
        },
        {
            "title": "南岸区",
            "code": "500108"
        },
        {
            "title": "北碚区",
            "code": "500109"
        },
        {
            "title": "綦江区",
            "code": "500110"
        },
        {
            "title": "大足区",
            "code": "500111"
        },
        {
            "title": "渝北区",
            "code": "500112"
        },
        {
            "title": "巴南区",
            "code": "500113"
        },
        {
            "title": "黔江区",
            "code": "500114"
        },
        {
            "title": "长寿区",
            "code": "500115"
        },
        {
            "title": "江津区",
            "code": "500116"
        },
        {
            "title": "合川区",
            "code": "500117"
        },
        {
            "title": "永川区",
            "code": "500118"
        },
        {
            "title": "南川区",
            "code": "500119"
        },
        {
            "title": "璧山区",
            "code": "500120"
        },
        {
            "title": "铜梁区",
            "code": "500151"
        },
        {
            "title": "潼南县",
            "code": "500223"
        },
        {
            "title": "荣昌县",
            "code": "500226"
        },
        {
            "title": "梁平县",
            "code": "500228"
        },
        {
            "title": "城口县",
            "code": "500229"
        },
        {
            "title": "丰都县",
            "code": "500230"
        },
        {
            "title": "垫江县",
            "code": "500231"
        },
        {
            "title": "武隆县",
            "code": "500232"
        },
        {
            "title": "忠县",
            "code": "500233"
        },
        {
            "title": "开县",
            "code": "500234"
        },
        {
            "title": "云阳县",
            "code": "500235"
        },
        {
            "title": "奉节县",
            "code": "500236"
        },
        {
            "title": "巫山县",
            "code": "500237"
        },
        {
            "title": "巫溪县",
            "code": "500238"
        },
        {
            "title": "石柱县",
            "code": "500240"
        },
        {
            "title": "秀山县",
            "code": "500241"
        },
        {
            "title": "酉阳县",
            "code": "500242"
        },
        {
            "title": "彭水县",
            "code": "500243"
        }
        ]
    },
    {
        "title": "四川",
        "code": "510000",
        "children": [{
            "title": "成都",
            "code": "510100",
            "children": [{
                "title": "锦江区",
                "code": "510104"
            },
            {
                "title": "青羊区",
                "code": "510105"
            },
            {
                "title": "金牛区",
                "code": "510106"
            },
            {
                "title": "武侯区",
                "code": "510107"
            },
            {
                "title": "成华区",
                "code": "510108"
            },
            {
                "title": "龙泉驿区",
                "code": "510112"
            },
            {
                "title": "青白江区",
                "code": "510113"
            },
            {
                "title": "新都区",
                "code": "510114"
            },
            {
                "title": "温江区",
                "code": "510115"
            },
            {
                "title": "金堂县",
                "code": "510121"
            },
            {
                "title": "双流县",
                "code": "510122"
            },
            {
                "title": "郫县",
                "code": "510124"
            },
            {
                "title": "大邑县",
                "code": "510129"
            },
            {
                "title": "蒲江县",
                "code": "510131"
            },
            {
                "title": "新津县",
                "code": "510132"
            },
            {
                "title": "都江堰市",
                "code": "510181"
            },
            {
                "title": "彭州市",
                "code": "510182"
            },
            {
                "title": "邛崃市",
                "code": "510183"
            },
            {
                "title": "崇州市",
                "code": "510184"
            }
            ]
        },
        {
            "title": "自贡",
            "code": "510300",
            "children": [{
                "title": "自流井区",
                "code": "510302"
            },
            {
                "title": "贡井区",
                "code": "510303"
            },
            {
                "title": "大安区",
                "code": "510304"
            },
            {
                "title": "沿滩区",
                "code": "510311"
            },
            {
                "title": "荣县",
                "code": "510321"
            },
            {
                "title": "富顺县",
                "code": "510322"
            }
            ]
        },
        {
            "title": "攀枝花",
            "code": "510400",
            "children": [{
                "title": "东区",
                "code": "510402"
            },
            {
                "title": "西区",
                "code": "510403"
            },
            {
                "title": "仁和区",
                "code": "510411"
            },
            {
                "title": "米易县",
                "code": "510421"
            },
            {
                "title": "盐边县",
                "code": "510422"
            }
            ]
        },
        {
            "title": "泸州",
            "code": "510500",
            "children": [{
                "title": "江阳区",
                "code": "510502"
            },
            {
                "title": "纳溪区",
                "code": "510503"
            },
            {
                "title": "龙马潭区",
                "code": "510504"
            },
            {
                "title": "泸县",
                "code": "510521"
            },
            {
                "title": "合江县",
                "code": "510522"
            },
            {
                "title": "叙永县",
                "code": "510524"
            },
            {
                "title": "古蔺县",
                "code": "510525"
            }
            ]
        },
        {
            "title": "德阳",
            "code": "510600",
            "children": [{
                "title": "旌阳区",
                "code": "510603"
            },
            {
                "title": "中江县",
                "code": "510623"
            },
            {
                "title": "罗江县",
                "code": "510626"
            },
            {
                "title": "广汉市",
                "code": "510681"
            },
            {
                "title": "什邡市",
                "code": "510682"
            },
            {
                "title": "绵竹市",
                "code": "510683"
            }
            ]
        },
        {
            "title": "绵阳",
            "code": "510700",
            "children": [{
                "title": "涪城区",
                "code": "510703"
            },
            {
                "title": "游仙区",
                "code": "510704"
            },
            {
                "title": "三台县",
                "code": "510722"
            },
            {
                "title": "盐亭县",
                "code": "510723"
            },
            {
                "title": "安县",
                "code": "510724"
            },
            {
                "title": "梓潼县",
                "code": "510725"
            },
            {
                "title": "北川羌族自治县",
                "code": "510726"
            },
            {
                "title": "平武县",
                "code": "510727"
            },
            {
                "title": "江油市",
                "code": "510781"
            }
            ]
        },
        {
            "title": "广元",
            "code": "510800",
            "children": [{
                "title": "利州区",
                "code": "510802"
            },
            {
                "title": "昭化区",
                "code": "510811"
            },
            {
                "title": "朝天区",
                "code": "510812"
            },
            {
                "title": "旺苍县",
                "code": "510821"
            },
            {
                "title": "青川县",
                "code": "510822"
            },
            {
                "title": "剑阁县",
                "code": "510823"
            },
            {
                "title": "苍溪县",
                "code": "510824"
            }
            ]
        },
        {
            "title": "遂宁",
            "code": "510900",
            "children": [{
                "title": "船山区",
                "code": "510903"
            },
            {
                "title": "安居区",
                "code": "510904"
            },
            {
                "title": "蓬溪县",
                "code": "510921"
            },
            {
                "title": "射洪县",
                "code": "510922"
            },
            {
                "title": "大英县",
                "code": "510923"
            }
            ]
        },
        {
            "title": "内江",
            "code": "511000",
            "children": [{
                "title": "市中区",
                "code": "511002"
            },
            {
                "title": "东兴区",
                "code": "511011"
            },
            {
                "title": "威远县",
                "code": "511024"
            },
            {
                "title": "资中县",
                "code": "511025"
            },
            {
                "title": "隆昌县",
                "code": "511028"
            }
            ]
        },
        {
            "title": "乐山",
            "code": "511100",
            "children": [{
                "title": "市中区",
                "code": "511102"
            },
            {
                "title": "沙湾区",
                "code": "511111"
            },
            {
                "title": "五通桥区",
                "code": "511112"
            },
            {
                "title": "金口河区",
                "code": "511113"
            },
            {
                "title": "犍为县",
                "code": "511123"
            },
            {
                "title": "井研县",
                "code": "511124"
            },
            {
                "title": "夹江县",
                "code": "511126"
            },
            {
                "title": "沐川县",
                "code": "511129"
            },
            {
                "title": "峨边彝族自治县",
                "code": "511132"
            },
            {
                "title": "马边彝族自治县",
                "code": "511133"
            },
            {
                "title": "峨眉山市",
                "code": "511181"
            }
            ]
        },
        {
            "title": "南充",
            "code": "511300",
            "children": [{
                "title": "顺庆区",
                "code": "511302"
            },
            {
                "title": "高坪区",
                "code": "511303"
            },
            {
                "title": "嘉陵区",
                "code": "511304"
            },
            {
                "title": "南部县",
                "code": "511321"
            },
            {
                "title": "营山县",
                "code": "511322"
            },
            {
                "title": "蓬安县",
                "code": "511323"
            },
            {
                "title": "仪陇县",
                "code": "511324"
            },
            {
                "title": "西充县",
                "code": "511325"
            },
            {
                "title": "阆中市",
                "code": "511381"
            }
            ]
        },
        {
            "title": "眉山",
            "code": "511400",
            "children": [{
                "title": "东坡区",
                "code": "511402"
            },
            {
                "title": "彭山区",
                "code": "511403"
            },
            {
                "title": "仁寿县",
                "code": "511421"
            },
            {
                "title": "洪雅县",
                "code": "511423"
            },
            {
                "title": "丹棱县",
                "code": "511424"
            },
            {
                "title": "青神县",
                "code": "511425"
            }
            ]
        },
        {
            "title": "宜宾",
            "code": "511500",
            "children": [{
                "title": "翠屏区",
                "code": "511502"
            },
            {
                "title": "南溪区",
                "code": "511503"
            },
            {
                "title": "宜宾县",
                "code": "511521"
            },
            {
                "title": "江安县",
                "code": "511523"
            },
            {
                "title": "长宁县",
                "code": "511524"
            },
            {
                "title": "高县",
                "code": "511525"
            },
            {
                "title": "珙县",
                "code": "511526"
            },
            {
                "title": "筠连县",
                "code": "511527"
            },
            {
                "title": "兴文县",
                "code": "511528"
            },
            {
                "title": "屏山县",
                "code": "511529"
            }
            ]
        },
        {
            "title": "广安",
            "code": "511600",
            "children": [{
                "title": "广安区",
                "code": "511602"
            },
            {
                "title": "前锋区",
                "code": "511603"
            },
            {
                "title": "岳池县",
                "code": "511621"
            },
            {
                "title": "武胜县",
                "code": "511622"
            },
            {
                "title": "邻水县",
                "code": "511623"
            },
            {
                "title": "华蓥市",
                "code": "511681"
            }
            ]
        },
        {
            "title": "达州",
            "code": "511700",
            "children": [{
                "title": "通川区",
                "code": "511702"
            },
            {
                "title": "达川区",
                "code": "511703"
            },
            {
                "title": "宣汉县",
                "code": "511722"
            },
            {
                "title": "开江县",
                "code": "511723"
            },
            {
                "title": "大竹县",
                "code": "511724"
            },
            {
                "title": "渠县",
                "code": "511725"
            },
            {
                "title": "万源市",
                "code": "511781"
            }
            ]
        },
        {
            "title": "雅安",
            "code": "511800",
            "children": [{
                "title": "雨城区",
                "code": "511802"
            },
            {
                "title": "名山区",
                "code": "511803"
            },
            {
                "title": "荥经县",
                "code": "511822"
            },
            {
                "title": "汉源县",
                "code": "511823"
            },
            {
                "title": "石棉县",
                "code": "511824"
            },
            {
                "title": "天全县",
                "code": "511825"
            },
            {
                "title": "芦山县",
                "code": "511826"
            },
            {
                "title": "宝兴县",
                "code": "511827"
            }
            ]
        },
        {
            "title": "巴中",
            "code": "511900",
            "children": [{
                "title": "巴州区",
                "code": "511902"
            },
            {
                "title": "恩阳区",
                "code": "511903"
            },
            {
                "title": "通江县",
                "code": "511921"
            },
            {
                "title": "南江县",
                "code": "511922"
            },
            {
                "title": "平昌县",
                "code": "511923"
            }
            ]
        },
        {
            "title": "资阳",
            "code": "512000",
            "children": [{
                "title": "雁江区",
                "code": "512002"
            },
            {
                "title": "安岳县",
                "code": "512021"
            },
            {
                "title": "乐至县",
                "code": "512022"
            },
            {
                "title": "简阳市",
                "code": "512081"
            }
            ]
        },
        {
            "title": "阿坝",
            "code": "513200",
            "children": [{
                "title": "汶川县",
                "code": "513221"
            },
            {
                "title": "理县",
                "code": "513222"
            },
            {
                "title": "茂县",
                "code": "513223"
            },
            {
                "title": "松潘县",
                "code": "513224"
            },
            {
                "title": "九寨沟县",
                "code": "513225"
            },
            {
                "title": "金川县",
                "code": "513226"
            },
            {
                "title": "小金县",
                "code": "513227"
            },
            {
                "title": "黑水县",
                "code": "513228"
            },
            {
                "title": "马尔康县",
                "code": "513229"
            },
            {
                "title": "壤塘县",
                "code": "513230"
            },
            {
                "title": "阿坝县",
                "code": "513231"
            },
            {
                "title": "若尔盖县",
                "code": "513232"
            },
            {
                "title": "红原县",
                "code": "513233"
            }
            ]
        },
        {
            "title": "甘孜",
            "code": "513300",
            "children": [{
                "title": "康定县",
                "code": "513321"
            },
            {
                "title": "泸定县",
                "code": "513322"
            },
            {
                "title": "丹巴县",
                "code": "513323"
            },
            {
                "title": "九龙县",
                "code": "513324"
            },
            {
                "title": "雅江县",
                "code": "513325"
            },
            {
                "title": "道孚县",
                "code": "513326"
            },
            {
                "title": "炉霍县",
                "code": "513327"
            },
            {
                "title": "甘孜县",
                "code": "513328"
            },
            {
                "title": "新龙县",
                "code": "513329"
            },
            {
                "title": "德格县",
                "code": "513330"
            },
            {
                "title": "白玉县",
                "code": "513331"
            },
            {
                "title": "石渠县",
                "code": "513332"
            },
            {
                "title": "色达县",
                "code": "513333"
            },
            {
                "title": "理塘县",
                "code": "513334"
            },
            {
                "title": "巴塘县",
                "code": "513335"
            },
            {
                "title": "乡城县",
                "code": "513336"
            },
            {
                "title": "稻城县",
                "code": "513337"
            },
            {
                "title": "得荣县",
                "code": "513338"
            }
            ]
        },
        {
            "title": "凉山",
            "code": "513400",
            "children": [{
                "title": "西昌市",
                "code": "513401"
            },
            {
                "title": "木里藏族自治县",
                "code": "513422"
            },
            {
                "title": "盐源县",
                "code": "513423"
            },
            {
                "title": "德昌县",
                "code": "513424"
            },
            {
                "title": "会理县",
                "code": "513425"
            },
            {
                "title": "会东县",
                "code": "513426"
            },
            {
                "title": "宁南县",
                "code": "513427"
            },
            {
                "title": "普格县",
                "code": "513428"
            },
            {
                "title": "布拖县",
                "code": "513429"
            },
            {
                "title": "金阳县",
                "code": "513430"
            },
            {
                "title": "昭觉县",
                "code": "513431"
            },
            {
                "title": "喜德县",
                "code": "513432"
            },
            {
                "title": "冕宁县",
                "code": "513433"
            },
            {
                "title": "越西县",
                "code": "513434"
            },
            {
                "title": "甘洛县",
                "code": "513435"
            },
            {
                "title": "美姑县",
                "code": "513436"
            },
            {
                "title": "雷波县",
                "code": "513437"
            }
            ]
        }
        ]
    },
    {
        "title": "贵州",
        "code": "520000",
        "children": [{
            "title": "贵阳",
            "code": "520100",
            "children": [{
                "title": "南明区",
                "code": "520102"
            },
            {
                "title": "云岩区",
                "code": "520103"
            },
            {
                "title": "花溪区",
                "code": "520111"
            },
            {
                "title": "乌当区",
                "code": "520112"
            },
            {
                "title": "白云区",
                "code": "520113"
            },
            {
                "title": "观山湖区",
                "code": "520115"
            },
            {
                "title": "开阳县",
                "code": "520121"
            },
            {
                "title": "息烽县",
                "code": "520122"
            },
            {
                "title": "修文县",
                "code": "520123"
            },
            {
                "title": "清镇市",
                "code": "520181"
            }
            ]
        },
        {
            "title": "六盘水",
            "code": "520200",
            "children": [{
                "title": "钟山区",
                "code": "520201"
            },
            {
                "title": "六枝特区",
                "code": "520203"
            },
            {
                "title": "水城县",
                "code": "520221"
            },
            {
                "title": "盘县",
                "code": "520222"
            }
            ]
        },
        {
            "title": "遵义",
            "code": "520300",
            "children": [{
                "title": "红花岗区",
                "code": "520302"
            },
            {
                "title": "汇川区",
                "code": "520303"
            },
            {
                "title": "遵义县",
                "code": "520321"
            },
            {
                "title": "桐梓县",
                "code": "520322"
            },
            {
                "title": "绥阳县",
                "code": "520323"
            },
            {
                "title": "正安县",
                "code": "520324"
            },
            {
                "title": "道真仡佬族苗族自治县",
                "code": "520325"
            },
            {
                "title": "务川仡佬族苗族自治县",
                "code": "520326"
            },
            {
                "title": "凤冈县",
                "code": "520327"
            },
            {
                "title": "湄潭县",
                "code": "520328"
            },
            {
                "title": "余庆县",
                "code": "520329"
            },
            {
                "title": "习水县",
                "code": "520330"
            },
            {
                "title": "赤水市",
                "code": "520381"
            },
            {
                "title": "仁怀市",
                "code": "520382"
            }
            ]
        },
        {
            "title": "安顺",
            "code": "520400",
            "children": [{
                "title": "西秀区",
                "code": "520402"
            },
            {
                "title": "平坝区",
                "code": "520403"
            },
            {
                "title": "普定县",
                "code": "520422"
            },
            {
                "title": "镇宁布依族苗族自治县",
                "code": "520423"
            },
            {
                "title": "关岭布依族苗族自治县",
                "code": "520424"
            },
            {
                "title": "紫云苗族布依族自治县",
                "code": "520425"
            }
            ]
        },
        {
            "title": "毕节",
            "code": "520500",
            "children": [{
                "title": "七星关区",
                "code": "520502"
            },
            {
                "title": "大方县",
                "code": "520521"
            },
            {
                "title": "黔西县",
                "code": "520522"
            },
            {
                "title": "金沙县",
                "code": "520523"
            },
            {
                "title": "织金县",
                "code": "520524"
            },
            {
                "title": "纳雍县",
                "code": "520525"
            },
            {
                "title": "威宁彝族回族苗族自治县",
                "code": "520526"
            },
            {
                "title": "赫章县",
                "code": "520527"
            }
            ]
        },
        {
            "title": "铜仁",
            "code": "520600",
            "children": [{
                "title": "碧江区",
                "code": "520602"
            },
            {
                "title": "万山区",
                "code": "520603"
            },
            {
                "title": "江口县",
                "code": "520621"
            },
            {
                "title": "玉屏侗族自治县",
                "code": "520622"
            },
            {
                "title": "石阡县",
                "code": "520623"
            },
            {
                "title": "思南县",
                "code": "520624"
            },
            {
                "title": "印江土家族苗族自治县",
                "code": "520625"
            },
            {
                "title": "德江县",
                "code": "520626"
            },
            {
                "title": "沿河土家族自治县",
                "code": "520627"
            },
            {
                "title": "松桃苗族自治县",
                "code": "520628"
            }
            ]
        },
        {
            "title": "黔西",
            "code": "522300",
            "children": [{
                "title": "兴义市",
                "code": "522301"
            },
            {
                "title": "兴仁县",
                "code": "522322"
            },
            {
                "title": "普安县",
                "code": "522323"
            },
            {
                "title": "晴隆县",
                "code": "522324"
            },
            {
                "title": "贞丰县",
                "code": "522325"
            },
            {
                "title": "望谟县",
                "code": "522326"
            },
            {
                "title": "册亨县",
                "code": "522327"
            },
            {
                "title": "安龙县",
                "code": "522328"
            }
            ]
        },
        {
            "title": "黔东",
            "code": "522600",
            "children": [{
                "title": "凯里市",
                "code": "522601"
            },
            {
                "title": "黄平县",
                "code": "522622"
            },
            {
                "title": "施秉县",
                "code": "522623"
            },
            {
                "title": "三穗县",
                "code": "522624"
            },
            {
                "title": "镇远县",
                "code": "522625"
            },
            {
                "title": "岑巩县",
                "code": "522626"
            },
            {
                "title": "天柱县",
                "code": "522627"
            },
            {
                "title": "锦屏县",
                "code": "522628"
            },
            {
                "title": "剑河县",
                "code": "522629"
            },
            {
                "title": "台江县",
                "code": "522630"
            },
            {
                "title": "黎平县",
                "code": "522631"
            },
            {
                "title": "榕江县",
                "code": "522632"
            },
            {
                "title": "从江县",
                "code": "522633"
            },
            {
                "title": "雷山县",
                "code": "522634"
            },
            {
                "title": "麻江县",
                "code": "522635"
            },
            {
                "title": "丹寨县",
                "code": "522636"
            }
            ]
        },
        {
            "title": "黔南",
            "code": "522700",
            "children": [{
                "title": "都匀市",
                "code": "522701"
            },
            {
                "title": "福泉市",
                "code": "522702"
            },
            {
                "title": "荔波县",
                "code": "522722"
            },
            {
                "title": "贵定县",
                "code": "522723"
            },
            {
                "title": "瓮安县",
                "code": "522725"
            },
            {
                "title": "独山县",
                "code": "522726"
            },
            {
                "title": "平塘县",
                "code": "522727"
            },
            {
                "title": "罗甸县",
                "code": "522728"
            },
            {
                "title": "长顺县",
                "code": "522729"
            },
            {
                "title": "龙里县",
                "code": "522730"
            },
            {
                "title": "惠水县",
                "code": "522731"
            },
            {
                "title": "三都水族自治县",
                "code": "522732"
            }
            ]
        }
        ]
    },
    {
        "title": "云南",
        "code": "530000",
        "children": [{
            "title": "昆明",
            "code": "530100",
            "children": [{
                "title": "五华区",
                "code": "530102"
            },
            {
                "title": "盘龙区",
                "code": "530103"
            },
            {
                "title": "官渡区",
                "code": "530111"
            },
            {
                "title": "西山区",
                "code": "530112"
            },
            {
                "title": "东川区",
                "code": "530113"
            },
            {
                "title": "呈贡区",
                "code": "530114"
            },
            {
                "title": "晋宁县",
                "code": "530122"
            },
            {
                "title": "富民县",
                "code": "530124"
            },
            {
                "title": "宜良县",
                "code": "530125"
            },
            {
                "title": "石林彝族自治县",
                "code": "530126"
            },
            {
                "title": "嵩明县",
                "code": "530127"
            },
            {
                "title": "禄劝彝族苗族自治县",
                "code": "530128"
            },
            {
                "title": "寻甸回族彝族自治县",
                "code": "530129"
            },
            {
                "title": "安宁市",
                "code": "530181"
            }
            ]
        },
        {
            "title": "曲靖",
            "code": "530300",
            "children": [{
                "title": "麒麟区",
                "code": "530302"
            },
            {
                "title": "马龙县",
                "code": "530321"
            },
            {
                "title": "陆良县",
                "code": "530322"
            },
            {
                "title": "师宗县",
                "code": "530323"
            },
            {
                "title": "罗平县",
                "code": "530324"
            },
            {
                "title": "富源县",
                "code": "530325"
            },
            {
                "title": "会泽县",
                "code": "530326"
            },
            {
                "title": "沾益县",
                "code": "530328"
            },
            {
                "title": "宣威市",
                "code": "530381"
            }
            ]
        },
        {
            "title": "玉溪",
            "code": "530400",
            "children": [{
                "title": "红塔区",
                "code": "530402"
            },
            {
                "title": "江川县",
                "code": "530421"
            },
            {
                "title": "澄江县",
                "code": "530422"
            },
            {
                "title": "通海县",
                "code": "530423"
            },
            {
                "title": "华宁县",
                "code": "530424"
            },
            {
                "title": "易门县",
                "code": "530425"
            },
            {
                "title": "峨山彝族自治县",
                "code": "530426"
            },
            {
                "title": "新平彝族傣族自治县",
                "code": "530427"
            },
            {
                "title": "元江哈尼族彝族傣族自治县",
                "code": "530428"
            }
            ]
        },
        {
            "title": "保山",
            "code": "530500",
            "children": [{
                "title": "隆阳区",
                "code": "530502"
            },
            {
                "title": "施甸县",
                "code": "530521"
            },
            {
                "title": "腾冲县",
                "code": "530522"
            },
            {
                "title": "龙陵县",
                "code": "530523"
            },
            {
                "title": "昌宁县",
                "code": "530524"
            }
            ]
        },
        {
            "title": "昭通",
            "code": "530600",
            "children": [{
                "title": "昭阳区",
                "code": "530602"
            },
            {
                "title": "鲁甸县",
                "code": "530621"
            },
            {
                "title": "巧家县",
                "code": "530622"
            },
            {
                "title": "盐津县",
                "code": "530623"
            },
            {
                "title": "大关县",
                "code": "530624"
            },
            {
                "title": "永善县",
                "code": "530625"
            },
            {
                "title": "绥江县",
                "code": "530626"
            },
            {
                "title": "镇雄县",
                "code": "530627"
            },
            {
                "title": "彝良县",
                "code": "530628"
            },
            {
                "title": "威信县",
                "code": "530629"
            },
            {
                "title": "水富县",
                "code": "530630"
            }
            ]
        },
        {
            "title": "丽江",
            "code": "530700",
            "children": [{
                "title": "古城区",
                "code": "530702"
            },
            {
                "title": "玉龙纳西族自治县",
                "code": "530721"
            },
            {
                "title": "永胜县",
                "code": "530722"
            },
            {
                "title": "华坪县",
                "code": "530723"
            },
            {
                "title": "宁蒗彝族自治县",
                "code": "530724"
            }
            ]
        },
        {
            "title": "普洱",
            "code": "530800",
            "children": [{
                "title": "思茅区",
                "code": "530802"
            },
            {
                "title": "宁洱哈尼族彝族自治县",
                "code": "530821"
            },
            {
                "title": "墨江哈尼族自治县",
                "code": "530822"
            },
            {
                "title": "景东彝族自治县",
                "code": "530823"
            },
            {
                "title": "景谷傣族彝族自治县",
                "code": "530824"
            },
            {
                "title": "镇沅彝族哈尼族拉祜族自治县",
                "code": "530825"
            },
            {
                "title": "江城哈尼族彝族自治县",
                "code": "530826"
            },
            {
                "title": "孟连傣族拉祜族佤族自治县",
                "code": "530827"
            },
            {
                "title": "澜沧拉祜族自治县",
                "code": "530828"
            },
            {
                "title": "西盟佤族自治县",
                "code": "530829"
            }
            ]
        },
        {
            "title": "临沧",
            "code": "530900",
            "children": [{
                "title": "临翔区",
                "code": "530902"
            },
            {
                "title": "凤庆县",
                "code": "530921"
            },
            {
                "title": "云县",
                "code": "530922"
            },
            {
                "title": "永德县",
                "code": "530923"
            },
            {
                "title": "镇康县",
                "code": "530924"
            },
            {
                "title": "双江拉祜族佤族布朗族傣族自治县",
                "code": "530925"
            },
            {
                "title": "耿马傣族佤族自治县",
                "code": "530926"
            },
            {
                "title": "沧源佤族自治县",
                "code": "530927"
            }
            ]
        },
        {
            "title": "楚雄",
            "code": "532300",
            "children": [{
                "title": "楚雄市",
                "code": "532301"
            },
            {
                "title": "双柏县",
                "code": "532322"
            },
            {
                "title": "牟定县",
                "code": "532323"
            },
            {
                "title": "南华县",
                "code": "532324"
            },
            {
                "title": "姚安县",
                "code": "532325"
            },
            {
                "title": "大姚县",
                "code": "532326"
            },
            {
                "title": "永仁县",
                "code": "532327"
            },
            {
                "title": "元谋县",
                "code": "532328"
            },
            {
                "title": "武定县",
                "code": "532329"
            },
            {
                "title": "禄丰县",
                "code": "532331"
            }
            ]
        },
        {
            "title": "红河",
            "code": "532500",
            "children": [{
                "title": "个旧市",
                "code": "532501"
            },
            {
                "title": "开远市",
                "code": "532502"
            },
            {
                "title": "蒙自市",
                "code": "532503"
            },
            {
                "title": "弥勒市",
                "code": "532504"
            },
            {
                "title": "屏边苗族自治县",
                "code": "532523"
            },
            {
                "title": "建水县",
                "code": "532524"
            },
            {
                "title": "石屏县",
                "code": "532525"
            },
            {
                "title": "泸西县",
                "code": "532527"
            },
            {
                "title": "元阳县",
                "code": "532528"
            },
            {
                "title": "红河县",
                "code": "532529"
            },
            {
                "title": "金平苗族瑶族傣族自治县",
                "code": "532530"
            },
            {
                "title": "绿春县",
                "code": "532531"
            },
            {
                "title": "河口瑶族自治县",
                "code": "532532"
            }
            ]
        },
        {
            "title": "文山",
            "code": "532600",
            "children": [{
                "title": "文山市",
                "code": "532601"
            },
            {
                "title": "砚山县",
                "code": "532622"
            },
            {
                "title": "西畴县",
                "code": "532623"
            },
            {
                "title": "麻栗坡县",
                "code": "532624"
            },
            {
                "title": "马关县",
                "code": "532625"
            },
            {
                "title": "丘北县",
                "code": "532626"
            },
            {
                "title": "广南县",
                "code": "532627"
            },
            {
                "title": "富宁县",
                "code": "532628"
            }
            ]
        },
        {
            "title": "西双版纳",
            "code": "532800",
            "children": [{
                "title": "景洪市",
                "code": "532801"
            },
            {
                "title": "勐海县",
                "code": "532822"
            },
            {
                "title": "勐腊县",
                "code": "532823"
            }
            ]
        },
        {
            "title": "大理",
            "code": "532900",
            "children": [{
                "title": "大理市",
                "code": "532901"
            },
            {
                "title": "漾濞彝族自治县",
                "code": "532922"
            },
            {
                "title": "祥云县",
                "code": "532923"
            },
            {
                "title": "宾川县",
                "code": "532924"
            },
            {
                "title": "弥渡县",
                "code": "532925"
            },
            {
                "title": "南涧彝族自治县",
                "code": "532926"
            },
            {
                "title": "巍山彝族回族自治县",
                "code": "532927"
            },
            {
                "title": "永平县",
                "code": "532928"
            },
            {
                "title": "云龙县",
                "code": "532929"
            },
            {
                "title": "洱源县",
                "code": "532930"
            },
            {
                "title": "剑川县",
                "code": "532931"
            },
            {
                "title": "鹤庆县",
                "code": "532932"
            }
            ]
        },
        {
            "title": "德宏",
            "code": "533100",
            "children": [{
                "title": "瑞丽市",
                "code": "533102"
            },
            {
                "title": "芒市",
                "code": "533103"
            },
            {
                "title": "梁河县",
                "code": "533122"
            },
            {
                "title": "盈江县",
                "code": "533123"
            },
            {
                "title": "陇川县",
                "code": "533124"
            }
            ]
        },
        {
            "title": "怒江",
            "code": "533300",
            "children": [{
                "title": "泸水县",
                "code": "533321"
            },
            {
                "title": "福贡县",
                "code": "533323"
            },
            {
                "title": "贡山独龙族怒族自治县",
                "code": "533324"
            },
            {
                "title": "兰坪白族普米族自治县",
                "code": "533325"
            }
            ]
        },
        {
            "title": "迪庆",
            "code": "533400",
            "children": [{
                "title": "香格里拉市",
                "code": "533401"
            },
            {
                "title": "德钦县",
                "code": "533422"
            },
            {
                "title": "维西傈僳族自治县",
                "code": "533423"
            }
            ]
        }
        ]
    },
    {
        "title": "西藏",
        "code": "540000",
        "children": [{
            "title": "拉萨",
            "code": "540100",
            "children": [{
                "title": "城关区",
                "code": "540102"
            },
            {
                "title": "林周县",
                "code": "540121"
            },
            {
                "title": "当雄县",
                "code": "540122"
            },
            {
                "title": "尼木县",
                "code": "540123"
            },
            {
                "title": "曲水县",
                "code": "540124"
            },
            {
                "title": "堆龙德庆县",
                "code": "540125"
            },
            {
                "title": "达孜县",
                "code": "540126"
            },
            {
                "title": "墨竹工卡县",
                "code": "540127"
            }
            ]
        },
        {
            "title": "日喀则",
            "code": "540200",
            "children": [{
                "title": "桑珠孜区",
                "code": "540202"
            },
            {
                "title": "南木林县",
                "code": "540221"
            },
            {
                "title": "江孜县",
                "code": "540222"
            },
            {
                "title": "定日县",
                "code": "540223"
            },
            {
                "title": "萨迦县",
                "code": "540224"
            },
            {
                "title": "拉孜县",
                "code": "540225"
            },
            {
                "title": "昂仁县",
                "code": "540226"
            },
            {
                "title": "谢通门县",
                "code": "540227"
            },
            {
                "title": "白朗县",
                "code": "540228"
            },
            {
                "title": "仁布县",
                "code": "540229"
            },
            {
                "title": "康马县",
                "code": "540230"
            },
            {
                "title": "定结县",
                "code": "540231"
            },
            {
                "title": "仲巴县",
                "code": "540232"
            },
            {
                "title": "亚东县",
                "code": "540233"
            },
            {
                "title": "吉隆县",
                "code": "540234"
            },
            {
                "title": "聂拉木县",
                "code": "540235"
            },
            {
                "title": "萨嘎县",
                "code": "540236"
            },
            {
                "title": "岗巴县",
                "code": "540237"
            }
            ]
        },
        {
            "title": "昌都",
            "code": "540300",
            "children": [{
                "title": "卡若区",
                "code": "540302"
            },
            {
                "title": "江达县",
                "code": "540321"
            },
            {
                "title": "贡觉县",
                "code": "540322"
            },
            {
                "title": "类乌齐县",
                "code": "540323"
            },
            {
                "title": "丁青县",
                "code": "540324"
            },
            {
                "title": "察雅县",
                "code": "540325"
            },
            {
                "title": "八宿县",
                "code": "540326"
            },
            {
                "title": "左贡县",
                "code": "540327"
            },
            {
                "title": "芒康县",
                "code": "540328"
            },
            {
                "title": "洛隆县",
                "code": "540329"
            },
            {
                "title": "边坝县",
                "code": "540330"
            }
            ]
        },
        {
            "title": "山南",
            "code": "542200",
            "children": [{
                "title": "乃东县",
                "code": "542221"
            },
            {
                "title": "扎囊县",
                "code": "542222"
            },
            {
                "title": "贡嘎县",
                "code": "542223"
            },
            {
                "title": "桑日县",
                "code": "542224"
            },
            {
                "title": "琼结县",
                "code": "542225"
            },
            {
                "title": "曲松县",
                "code": "542226"
            },
            {
                "title": "措美县",
                "code": "542227"
            },
            {
                "title": "洛扎县",
                "code": "542228"
            },
            {
                "title": "加查县",
                "code": "542229"
            },
            {
                "title": "隆子县",
                "code": "542231"
            },
            {
                "title": "错那县",
                "code": "542232"
            },
            {
                "title": "浪卡子县",
                "code": "542233"
            }
            ]
        },
        {
            "title": "那曲",
            "code": "542400",
            "children": [{
                "title": "那曲县",
                "code": "542421"
            },
            {
                "title": "嘉黎县",
                "code": "542422"
            },
            {
                "title": "比如县",
                "code": "542423"
            },
            {
                "title": "聂荣县",
                "code": "542424"
            },
            {
                "title": "安多县",
                "code": "542425"
            },
            {
                "title": "申扎县",
                "code": "542426"
            },
            {
                "title": "索县",
                "code": "542427"
            },
            {
                "title": "班戈县",
                "code": "542428"
            },
            {
                "title": "巴青县",
                "code": "542429"
            },
            {
                "title": "尼玛县",
                "code": "542430"
            },
            {
                "title": "双湖县",
                "code": "542431"
            }
            ]
        },
        {
            "title": "阿里",
            "code": "542500",
            "children": [{
                "title": "普兰县",
                "code": "542521"
            },
            {
                "title": "札达县",
                "code": "542522"
            },
            {
                "title": "噶尔县",
                "code": "542523"
            },
            {
                "title": "日土县",
                "code": "542524"
            },
            {
                "title": "革吉县",
                "code": "542525"
            },
            {
                "title": "改则县",
                "code": "542526"
            },
            {
                "title": "措勤县",
                "code": "542527"
            }
            ]
        },
        {
            "title": "林芝",
            "code": "542600",
            "children": [{
                "title": "林芝县",
                "code": "542621"
            },
            {
                "title": "工布江达县",
                "code": "542622"
            },
            {
                "title": "米林县",
                "code": "542623"
            },
            {
                "title": "墨脱县",
                "code": "542624"
            },
            {
                "title": "波密县",
                "code": "542625"
            },
            {
                "title": "察隅县",
                "code": "542626"
            },
            {
                "title": "朗县",
                "code": "542627"
            }
            ]
        }
        ]
    },
    {
        "title": "陕西",
        "code": "610000",
        "children": [{
            "title": "西安",
            "code": "610100",
            "children": [{
                "title": "新城区",
                "code": "610102"
            },
            {
                "title": "碑林区",
                "code": "610103"
            },
            {
                "title": "莲湖区",
                "code": "610104"
            },
            {
                "title": "灞桥区",
                "code": "610111"
            },
            {
                "title": "未央区",
                "code": "610112"
            },
            {
                "title": "雁塔区",
                "code": "610113"
            },
            {
                "title": "阎良区",
                "code": "610114"
            },
            {
                "title": "临潼区",
                "code": "610115"
            },
            {
                "title": "长安区",
                "code": "610116"
            },
            {
                "title": "高陵区",
                "code": "610117"
            },
            {
                "title": "蓝田县",
                "code": "610122"
            },
            {
                "title": "周至县",
                "code": "610124"
            },
            {
                "title": "户县",
                "code": "610125"
            }
            ]
        },
        {
            "title": "铜川",
            "code": "610200",
            "children": [{
                "title": "王益区",
                "code": "610202"
            },
            {
                "title": "印台区",
                "code": "610203"
            },
            {
                "title": "耀州区",
                "code": "610204"
            },
            {
                "title": "宜君县",
                "code": "610222"
            }
            ]
        },
        {
            "title": "宝鸡",
            "code": "610300",
            "children": [{
                "title": "渭滨区",
                "code": "610302"
            },
            {
                "title": "金台区",
                "code": "610303"
            },
            {
                "title": "陈仓区",
                "code": "610304"
            },
            {
                "title": "凤翔县",
                "code": "610322"
            },
            {
                "title": "岐山县",
                "code": "610323"
            },
            {
                "title": "扶风县",
                "code": "610324"
            },
            {
                "title": "眉县",
                "code": "610326"
            },
            {
                "title": "陇县",
                "code": "610327"
            },
            {
                "title": "千阳县",
                "code": "610328"
            },
            {
                "title": "麟游县",
                "code": "610329"
            },
            {
                "title": "凤县",
                "code": "610330"
            },
            {
                "title": "太白县",
                "code": "610331"
            }
            ]
        },
        {
            "title": "咸阳",
            "code": "610400",
            "children": [{
                "title": "秦都区",
                "code": "610402"
            },
            {
                "title": "杨陵区",
                "code": "610403"
            },
            {
                "title": "渭城区",
                "code": "610404"
            },
            {
                "title": "三原县",
                "code": "610422"
            },
            {
                "title": "泾阳县",
                "code": "610423"
            },
            {
                "title": "乾县",
                "code": "610424"
            },
            {
                "title": "礼泉县",
                "code": "610425"
            },
            {
                "title": "永寿县",
                "code": "610426"
            },
            {
                "title": "彬县",
                "code": "610427"
            },
            {
                "title": "长武县",
                "code": "610428"
            },
            {
                "title": "旬邑县",
                "code": "610429"
            },
            {
                "title": "淳化县",
                "code": "610430"
            },
            {
                "title": "武功县",
                "code": "610431"
            },
            {
                "title": "兴平市",
                "code": "610481"
            }
            ]
        },
        {
            "title": "渭南",
            "code": "610500",
            "children": [{
                "title": "临渭区",
                "code": "610502"
            },
            {
                "title": "华县",
                "code": "610521"
            },
            {
                "title": "潼关县",
                "code": "610522"
            },
            {
                "title": "大荔县",
                "code": "610523"
            },
            {
                "title": "合阳县",
                "code": "610524"
            },
            {
                "title": "澄城县",
                "code": "610525"
            },
            {
                "title": "蒲城县",
                "code": "610526"
            },
            {
                "title": "白水县",
                "code": "610527"
            },
            {
                "title": "富平县",
                "code": "610528"
            },
            {
                "title": "韩城市",
                "code": "610581"
            },
            {
                "title": "华阴市",
                "code": "610582"
            }
            ]
        },
        {
            "title": "延安",
            "code": "610600",
            "children": [{
                "title": "宝塔区",
                "code": "610602"
            },
            {
                "title": "延长县",
                "code": "610621"
            },
            {
                "title": "延川县",
                "code": "610622"
            },
            {
                "title": "子长县",
                "code": "610623"
            },
            {
                "title": "安塞县",
                "code": "610624"
            },
            {
                "title": "志丹县",
                "code": "610625"
            },
            {
                "title": "吴起县",
                "code": "610626"
            },
            {
                "title": "甘泉县",
                "code": "610627"
            },
            {
                "title": "富县",
                "code": "610628"
            },
            {
                "title": "洛川县",
                "code": "610629"
            },
            {
                "title": "宜川县",
                "code": "610630"
            },
            {
                "title": "黄龙县",
                "code": "610631"
            },
            {
                "title": "黄陵县",
                "code": "610632"
            }
            ]
        },
        {
            "title": "汉中",
            "code": "610700",
            "children": [{
                "title": "汉台区",
                "code": "610702"
            },
            {
                "title": "南郑县",
                "code": "610721"
            },
            {
                "title": "城固县",
                "code": "610722"
            },
            {
                "title": "洋县",
                "code": "610723"
            },
            {
                "title": "西乡县",
                "code": "610724"
            },
            {
                "title": "勉县",
                "code": "610725"
            },
            {
                "title": "宁强县",
                "code": "610726"
            },
            {
                "title": "略阳县",
                "code": "610727"
            },
            {
                "title": "镇巴县",
                "code": "610728"
            },
            {
                "title": "留坝县",
                "code": "610729"
            },
            {
                "title": "佛坪县",
                "code": "610730"
            }
            ]
        },
        {
            "title": "榆林",
            "code": "610800",
            "children": [{
                "title": "榆阳区",
                "code": "610802"
            },
            {
                "title": "神木县",
                "code": "610821"
            },
            {
                "title": "府谷县",
                "code": "610822"
            },
            {
                "title": "横山县",
                "code": "610823"
            },
            {
                "title": "靖边县",
                "code": "610824"
            },
            {
                "title": "定边县",
                "code": "610825"
            },
            {
                "title": "绥德县",
                "code": "610826"
            },
            {
                "title": "米脂县",
                "code": "610827"
            },
            {
                "title": "佳县",
                "code": "610828"
            },
            {
                "title": "吴堡县",
                "code": "610829"
            },
            {
                "title": "清涧县",
                "code": "610830"
            },
            {
                "title": "子洲县",
                "code": "610831"
            }
            ]
        },
        {
            "title": "安康",
            "code": "610900",
            "children": [{
                "title": "汉阴县",
                "code": "610921"
            },
            {
                "title": "石泉县",
                "code": "610922"
            },
            {
                "title": "宁陕县",
                "code": "610923"
            },
            {
                "title": "紫阳县",
                "code": "610924"
            },
            {
                "title": "岚皋县",
                "code": "610925"
            },
            {
                "title": "平利县",
                "code": "610926"
            },
            {
                "title": "镇坪县",
                "code": "610927"
            },
            {
                "title": "旬阳县",
                "code": "610928"
            },
            {
                "title": "白河县",
                "code": "610929"
            }
            ]
        },
        {
            "title": "商洛",
            "code": "611000",
            "children": [{
                "title": "商州区",
                "code": "611002"
            },
            {
                "title": "洛南县",
                "code": "611021"
            },
            {
                "title": "丹凤县",
                "code": "611022"
            },
            {
                "title": "商南县",
                "code": "611023"
            },
            {
                "title": "山阳县",
                "code": "611024"
            },
            {
                "title": "镇安县",
                "code": "611025"
            },
            {
                "title": "柞水县",
                "code": "611026"
            }
            ]
        }
        ]
    },
    {
        "title": "甘肃",
        "code": "620000",
        "children": [{
            "title": "兰州",
            "code": "620100",
            "children": [{
                "title": "城关区",
                "code": "620102"
            },
            {
                "title": "七里河区",
                "code": "620103"
            },
            {
                "title": "西固区",
                "code": "620104"
            },
            {
                "title": "安宁区",
                "code": "620105"
            },
            {
                "title": "红古区",
                "code": "620111"
            },
            {
                "title": "永登县",
                "code": "620121"
            },
            {
                "title": "皋兰县",
                "code": "620122"
            },
            {
                "title": "榆中县",
                "code": "620123"
            }
            ]
        },
        {
            "title": "嘉峪关",
            "code": "620200"
        },
        {
            "title": "金昌",
            "code": "620300",
            "children": [{
                "title": "金川区",
                "code": "620302"
            },
            {
                "title": "永昌县",
                "code": "620321"
            }
            ]
        },
        {
            "title": "白银",
            "code": "620400",
            "children": [{
                "title": "白银区",
                "code": "620402"
            },
            {
                "title": "平川区",
                "code": "620403"
            },
            {
                "title": "靖远县",
                "code": "620421"
            },
            {
                "title": "会宁县",
                "code": "620422"
            },
            {
                "title": "景泰县",
                "code": "620423"
            }
            ]
        },
        {
            "title": "天水",
            "code": "620500",
            "children": [{
                "title": "秦州区",
                "code": "620502"
            },
            {
                "title": "麦积区",
                "code": "620503"
            },
            {
                "title": "清水县",
                "code": "620521"
            },
            {
                "title": "秦安县",
                "code": "620522"
            },
            {
                "title": "甘谷县",
                "code": "620523"
            },
            {
                "title": "武山县",
                "code": "620524"
            },
            {
                "title": "张家川回族自治县",
                "code": "620525"
            }
            ]
        },
        {
            "title": "武威",
            "code": "620600",
            "children": [{
                "title": "凉州区",
                "code": "620602"
            },
            {
                "title": "民勤县",
                "code": "620621"
            },
            {
                "title": "古浪县",
                "code": "620622"
            },
            {
                "title": "天祝藏族自治县",
                "code": "620623"
            }
            ]
        },
        {
            "title": "张掖",
            "code": "620700",
            "children": [{
                "title": "甘州区",
                "code": "620702"
            },
            {
                "title": "肃南裕固族自治县",
                "code": "620721"
            },
            {
                "title": "民乐县",
                "code": "620722"
            },
            {
                "title": "临泽县",
                "code": "620723"
            },
            {
                "title": "高台县",
                "code": "620724"
            },
            {
                "title": "山丹县",
                "code": "620725"
            }
            ]
        },
        {
            "title": "平凉",
            "code": "620800",
            "children": [{
                "title": "崆峒区",
                "code": "620802"
            },
            {
                "title": "泾川县",
                "code": "620821"
            },
            {
                "title": "灵台县",
                "code": "620822"
            },
            {
                "title": "崇信县",
                "code": "620823"
            },
            {
                "title": "华亭县",
                "code": "620824"
            },
            {
                "title": "庄浪县",
                "code": "620825"
            },
            {
                "title": "静宁县",
                "code": "620826"
            }
            ]
        },
        {
            "title": "酒泉",
            "code": "620900",
            "children": [{
                "title": "肃州区",
                "code": "620902"
            },
            {
                "title": "金塔县",
                "code": "620921"
            },
            {
                "title": "瓜州县",
                "code": "620922"
            },
            {
                "title": "肃北蒙古族自治县",
                "code": "620923"
            },
            {
                "title": "阿克塞哈萨克族自治县",
                "code": "620924"
            },
            {
                "title": "玉门市",
                "code": "620981"
            },
            {
                "title": "敦煌市",
                "code": "620982"
            }
            ]
        },
        {
            "title": "庆阳",
            "code": "621000",
            "children": [{
                "title": "西峰区",
                "code": "621002"
            },
            {
                "title": "庆城县",
                "code": "621021"
            },
            {
                "title": "环县",
                "code": "621022"
            },
            {
                "title": "华池县",
                "code": "621023"
            },
            {
                "title": "合水县",
                "code": "621024"
            },
            {
                "title": "正宁县",
                "code": "621025"
            },
            {
                "title": "宁县",
                "code": "621026"
            },
            {
                "title": "镇原县",
                "code": "621027"
            }
            ]
        },
        {
            "title": "定西",
            "code": "621100",
            "children": [{
                "title": "安定区",
                "code": "621102"
            },
            {
                "title": "通渭县",
                "code": "621121"
            },
            {
                "title": "陇西县",
                "code": "621122"
            },
            {
                "title": "渭源县",
                "code": "621123"
            },
            {
                "title": "临洮县",
                "code": "621124"
            },
            {
                "title": "漳县",
                "code": "621125"
            },
            {
                "title": "岷县",
                "code": "621126"
            }
            ]
        },
        {
            "title": "陇南",
            "code": "621200",
            "children": [{
                "title": "武都区",
                "code": "621202"
            },
            {
                "title": "成县",
                "code": "621221"
            },
            {
                "title": "文县",
                "code": "621222"
            },
            {
                "title": "宕昌县",
                "code": "621223"
            },
            {
                "title": "康县",
                "code": "621224"
            },
            {
                "title": "西和县",
                "code": "621225"
            },
            {
                "title": "礼县",
                "code": "621226"
            },
            {
                "title": "徽县",
                "code": "621227"
            },
            {
                "title": "两当县",
                "code": "621228"
            }
            ]
        },
        {
            "title": "临夏",
            "code": "622900",
            "children": [{
                "title": "临夏市",
                "code": "622901"
            },
            {
                "title": "临夏县",
                "code": "622921"
            },
            {
                "title": "康乐县",
                "code": "622922"
            },
            {
                "title": "永靖县",
                "code": "622923"
            },
            {
                "title": "广河县",
                "code": "622924"
            },
            {
                "title": "和政县",
                "code": "622925"
            },
            {
                "title": "东乡族自治县",
                "code": "622926"
            },
            {
                "title": "积石山保安族东乡族撒拉族自治县",
                "code": "622927"
            }
            ]
        },
        {
            "title": "甘南",
            "code": "623000",
            "children": [{
                "title": "合作市",
                "code": "623001"
            },
            {
                "title": "临潭县",
                "code": "623021"
            },
            {
                "title": "卓尼县",
                "code": "623022"
            },
            {
                "title": "舟曲县",
                "code": "623023"
            },
            {
                "title": "迭部县",
                "code": "623024"
            },
            {
                "title": "玛曲县",
                "code": "623025"
            },
            {
                "title": "碌曲县",
                "code": "623026"
            },
            {
                "title": "夏河县",
                "code": "623027"
            }
            ]
        }
        ]
    },
    {
        "title": "青海",
        "code": "630000",
        "children": [{
            "title": "西宁",
            "code": "630100",
            "children": [{
                "title": "城东区",
                "code": "630102"
            },
            {
                "title": "城中区",
                "code": "630103"
            },
            {
                "title": "城西区",
                "code": "630104"
            },
            {
                "title": "城北区",
                "code": "630105"
            },
            {
                "title": "大通回族土族自治县",
                "code": "630121"
            },
            {
                "title": "湟中县",
                "code": "630122"
            },
            {
                "title": "湟源县",
                "code": "630123"
            }
            ]
        },
        {
            "title": "海东",
            "code": "630200",
            "children": [{
                "title": "乐都区",
                "code": "630202"
            },
            {
                "title": "平安县",
                "code": "630221"
            },
            {
                "title": "民和回族土族自治县",
                "code": "630222"
            },
            {
                "title": "互助土族自治县",
                "code": "630223"
            },
            {
                "title": "化隆回族自治县",
                "code": "630224"
            },
            {
                "title": "循化撒拉族自治县",
                "code": "630225"
            }
            ]
        },
        {
            "title": "海北",
            "code": "632200",
            "children": [{
                "title": "门源回族自治县",
                "code": "632221"
            },
            {
                "title": "祁连县",
                "code": "632222"
            },
            {
                "title": "海晏县",
                "code": "632223"
            },
            {
                "title": "刚察县",
                "code": "632224"
            }
            ]
        },
        {
            "title": "黄南",
            "code": "632300",
            "children": [{
                "title": "同仁县",
                "code": "632321"
            },
            {
                "title": "尖扎县",
                "code": "632322"
            },
            {
                "title": "泽库县",
                "code": "632323"
            },
            {
                "title": "河南蒙古族自治县",
                "code": "632324"
            }
            ]
        },
        {
            "title": "海南",
            "code": "632500",
            "children": [{
                "title": "共和县",
                "code": "632521"
            },
            {
                "title": "同德县",
                "code": "632522"
            },
            {
                "title": "贵德县",
                "code": "632523"
            },
            {
                "title": "兴海县",
                "code": "632524"
            },
            {
                "title": "贵南县",
                "code": "632525"
            }
            ]
        },
        {
            "title": "果洛",
            "code": "632600",
            "children": [{
                "title": "玛沁县",
                "code": "632621"
            },
            {
                "title": "班玛县",
                "code": "632622"
            },
            {
                "title": "甘德县",
                "code": "632623"
            },
            {
                "title": "达日县",
                "code": "632624"
            },
            {
                "title": "久治县",
                "code": "632625"
            },
            {
                "title": "玛多县",
                "code": "632626"
            }
            ]
        },
        {
            "title": "玉树",
            "code": "632700",
            "children": [{
                "title": "玉树市",
                "code": "632701"
            },
            {
                "title": "杂多县",
                "code": "632722"
            },
            {
                "title": "称多县",
                "code": "632723"
            },
            {
                "title": "治多县",
                "code": "632724"
            },
            {
                "title": "囊谦县",
                "code": "632725"
            },
            {
                "title": "曲麻莱县",
                "code": "632726"
            }
            ]
        },
        {
            "title": "海西",
            "code": "632800",
            "children": [{
                "title": "格尔木市",
                "code": "632801"
            },
            {
                "title": "德令哈市",
                "code": "632802"
            },
            {
                "title": "乌兰县",
                "code": "632821"
            },
            {
                "title": "都兰县",
                "code": "632822"
            },
            {
                "title": "天峻县",
                "code": "632823"
            }
            ]
        }
        ]
    },
    {
        "title": "宁夏",
        "code": "640000",
        "children": [{
            "title": "银川",
            "code": "640100",
            "children": [{
                "title": "兴庆区",
                "code": "640104"
            },
            {
                "title": "西夏区",
                "code": "640105"
            },
            {
                "title": "金凤区",
                "code": "640106"
            },
            {
                "title": "永宁县",
                "code": "640121"
            },
            {
                "title": "贺兰县",
                "code": "640122"
            },
            {
                "title": "灵武市",
                "code": "640181"
            }
            ]
        },
        {
            "title": "石嘴山",
            "code": "640200",
            "children": [{
                "title": "大武口区",
                "code": "640202"
            },
            {
                "title": "惠农区",
                "code": "640205"
            },
            {
                "title": "平罗县",
                "code": "640221"
            }
            ]
        },
        {
            "title": "吴忠",
            "code": "640300",
            "children": [{
                "title": "利通区",
                "code": "640302"
            },
            {
                "title": "红寺堡区",
                "code": "640303"
            },
            {
                "title": "盐池县",
                "code": "640323"
            },
            {
                "title": "同心县",
                "code": "640324"
            },
            {
                "title": "青铜峡市",
                "code": "640381"
            }
            ]
        },
        {
            "title": "固原",
            "code": "640400",
            "children": [{
                "title": "原州区",
                "code": "640402"
            },
            {
                "title": "西吉县",
                "code": "640422"
            },
            {
                "title": "隆德县",
                "code": "640423"
            },
            {
                "title": "泾源县",
                "code": "640424"
            },
            {
                "title": "彭阳县",
                "code": "640425"
            }
            ]
        },
        {
            "title": "中卫",
            "code": "640500",
            "children": [{
                "title": "沙坡头区",
                "code": "640502"
            },
            {
                "title": "中宁县",
                "code": "640521"
            },
            {
                "title": "海原县",
                "code": "640522"
            }
            ]
        }
        ]
    },
    {
        "title": "新疆",
        "code": "650000",
        "children": [{
            "title": "乌鲁木齐",
            "code": "650100",
            "children": [{
                "title": "天山区",
                "code": "650102"
            },
            {
                "title": "沙依巴克区",
                "code": "650103"
            },
            {
                "title": "新市区",
                "code": "650104"
            },
            {
                "title": "水磨沟区",
                "code": "650105"
            },
            {
                "title": "头屯河区",
                "code": "650106"
            },
            {
                "title": "达坂城区",
                "code": "650107"
            },
            {
                "title": "米东区",
                "code": "650109"
            },
            {
                "title": "乌鲁木齐县",
                "code": "650121"
            }
            ]
        },
        {
            "title": "克拉玛依",
            "code": "650200",
            "children": [{
                "title": "独山子区",
                "code": "650202"
            },
            {
                "title": "克拉玛依区",
                "code": "650203"
            },
            {
                "title": "白碱滩区",
                "code": "650204"
            },
            {
                "title": "乌尔禾区",
                "code": "650205"
            }
            ]
        },
        {
            "title": "吐鲁番",
            "code": "652100",
            "children": [{
                "title": "吐鲁番市",
                "code": "652101"
            },
            {
                "title": "鄯善县",
                "code": "652122"
            },
            {
                "title": "托克逊县",
                "code": "652123"
            }
            ]
        },
        {
            "title": "哈密",
            "code": "652200",
            "children": [{
                "title": "哈密市",
                "code": "652201"
            },
            {
                "title": "巴里坤哈萨克自治县",
                "code": "652222"
            },
            {
                "title": "伊吾县",
                "code": "652223"
            }
            ]
        },
        {
            "title": "昌吉",
            "code": "652300",
            "children": [{
                "title": "昌吉市",
                "code": "652301"
            },
            {
                "title": "阜康市",
                "code": "652302"
            },
            {
                "title": "呼图壁县",
                "code": "652323"
            },
            {
                "title": "玛纳斯县",
                "code": "652324"
            },
            {
                "title": "奇台县",
                "code": "652325"
            },
            {
                "title": "吉木萨尔县",
                "code": "652327"
            },
            {
                "title": "木垒哈萨克自治县",
                "code": "652328"
            }
            ]
        },
        {
            "title": "博尔塔拉",
            "code": "652700",
            "children": [{
                "title": "博乐市",
                "code": "652701"
            },
            {
                "title": "阿拉山口市",
                "code": "652702"
            },
            {
                "title": "精河县",
                "code": "652722"
            },
            {
                "title": "温泉县",
                "code": "652723"
            }
            ]
        },
        {
            "title": "巴音郭楞",
            "code": "652800",
            "children": [{
                "title": "库尔勒市",
                "code": "652801"
            },
            {
                "title": "轮台县",
                "code": "652822"
            },
            {
                "title": "尉犁县",
                "code": "652823"
            },
            {
                "title": "若羌县",
                "code": "652824"
            },
            {
                "title": "且末县",
                "code": "652825"
            },
            {
                "title": "焉耆回族自治县",
                "code": "652826"
            },
            {
                "title": "和静县",
                "code": "652827"
            },
            {
                "title": "和硕县",
                "code": "652828"
            },
            {
                "title": "博湖县",
                "code": "652829"
            }
            ]
        },
        {
            "title": "阿克苏",
            "code": "652900",
            "children": [{
                "title": "阿克苏市",
                "code": "652901"
            },
            {
                "title": "温宿县",
                "code": "652922"
            },
            {
                "title": "库车县",
                "code": "652923"
            },
            {
                "title": "沙雅县",
                "code": "652924"
            },
            {
                "title": "新和县",
                "code": "652925"
            },
            {
                "title": "拜城县",
                "code": "652926"
            },
            {
                "title": "乌什县",
                "code": "652927"
            },
            {
                "title": "阿瓦提县",
                "code": "652928"
            },
            {
                "title": "柯坪县",
                "code": "652929"
            }
            ]
        },
        {
            "title": "克孜勒苏柯尔",
            "code": "653000",
            "children": [{
                "title": "阿图什市",
                "code": "653001"
            },
            {
                "title": "阿克陶县",
                "code": "653022"
            },
            {
                "title": "阿合奇县",
                "code": "653023"
            },
            {
                "title": "乌恰县",
                "code": "653024"
            }
            ]
        },
        {
            "title": "喀什",
            "code": "653100",
            "children": [{
                "title": "喀什市",
                "code": "653101"
            },
            {
                "title": "疏附县",
                "code": "653121"
            },
            {
                "title": "疏勒县",
                "code": "653122"
            },
            {
                "title": "英吉沙县",
                "code": "653123"
            },
            {
                "title": "泽普县",
                "code": "653124"
            },
            {
                "title": "莎车县",
                "code": "653125"
            },
            {
                "title": "叶城县",
                "code": "653126"
            },
            {
                "title": "麦盖提县",
                "code": "653127"
            },
            {
                "title": "岳普湖县",
                "code": "653128"
            },
            {
                "title": "伽师县",
                "code": "653129"
            },
            {
                "title": "巴楚县",
                "code": "653130"
            },
            {
                "title": "塔什库尔干塔吉克自治县",
                "code": "653131"
            }
            ]
        },
        {
            "title": "和田",
            "code": "653200",
            "children": [{
                "title": "和田市",
                "code": "653201"
            },
            {
                "title": "和田县",
                "code": "653221"
            },
            {
                "title": "墨玉县",
                "code": "653222"
            },
            {
                "title": "皮山县",
                "code": "653223"
            },
            {
                "title": "洛浦县",
                "code": "653224"
            },
            {
                "title": "策勒县",
                "code": "653225"
            },
            {
                "title": "于田县",
                "code": "653226"
            },
            {
                "title": "民丰县",
                "code": "653227"
            }
            ]
        },
        {
            "title": "伊犁",
            "code": "654000",
            "children": [{
                "title": "伊宁市",
                "code": "654002"
            },
            {
                "title": "奎屯市",
                "code": "654003"
            },
            {
                "title": "霍尔果斯市",
                "code": "654004"
            },
            {
                "title": "伊宁县",
                "code": "654021"
            },
            {
                "title": "察布查尔锡伯自治县",
                "code": "654022"
            },
            {
                "title": "霍城县",
                "code": "654023"
            },
            {
                "title": "巩留县",
                "code": "654024"
            },
            {
                "title": "新源县",
                "code": "654025"
            },
            {
                "title": "昭苏县",
                "code": "654026"
            },
            {
                "title": "特克斯县",
                "code": "654027"
            },
            {
                "title": "尼勒克县",
                "code": "654028"
            },
            {
                "title": "塔城地区",
                "code": "654200"
            },
            {
                "title": "塔城市",
                "code": "654201"
            },
            {
                "title": "乌苏市",
                "code": "654202"
            },
            {
                "title": "额敏县",
                "code": "654221"
            },
            {
                "title": "沙湾县",
                "code": "654223"
            },
            {
                "title": "托里县",
                "code": "654224"
            },
            {
                "title": "裕民县",
                "code": "654225"
            },
            {
                "title": "和布克赛尔蒙古自治县",
                "code": "654226"
            },
            {
                "title": "阿勒泰地区",
                "code": "654300"
            },
            {
                "title": "阿勒泰市",
                "code": "654301"
            },
            {
                "title": "布尔津县",
                "code": "654321"
            },
            {
                "title": "富蕴县",
                "code": "654322"
            },
            {
                "title": "福海县",
                "code": "654323"
            },
            {
                "title": "哈巴河县",
                "code": "654324"
            },
            {
                "title": "青河县",
                "code": "654325"
            },
            {
                "title": "吉木乃县",
                "code": "654326"
            }
            ]
        },
        {
            "title": "自治区直辖县",
            "code": "659000",
            "children": [{
                "title": "石河子市",
                "code": "659001"
            },
            {
                "title": "阿拉尔市",
                "code": "659002"
            },
            {
                "title": "图木舒克市",
                "code": "659003"
            },
            {
                "title": "五家渠市",
                "code": "659004"
            },
            {
                "title": "北屯市",
                "code": "659005"
            },
            {
                "title": "铁门关市",
                "code": "659006"
            },
            {
                "title": "双河市",
                "code": "659007"
            }
            ]
        }
        ]
    },
    {
        "title": "台湾",
        "code": "710000",
        "children": [{
            "title": "台北",
            "code": "710100",
            "children": [{
                "title": "松山区",
                "code": "710101"
            },
            {
                "title": "信义区",
                "code": "710102"
            },
            {
                "title": "大安区",
                "code": "710103"
            },
            {
                "title": "中山区",
                "code": "710104"
            },
            {
                "title": "中正区",
                "code": "710105"
            },
            {
                "title": "大同区",
                "code": "710106"
            },
            {
                "title": "万华区",
                "code": "710107"
            },
            {
                "title": "文山区",
                "code": "710108"
            },
            {
                "title": "南港区",
                "code": "710109"
            },
            {
                "title": "内湖区",
                "code": "710110"
            },
            {
                "title": "士林区",
                "code": "710111"
            },
            {
                "title": "北投区",
                "code": "710112"
            }
            ]
        },
        {
            "title": "高雄",
            "code": "710200",
            "children": [{
                "title": "盐埕区",
                "code": "710201"
            },
            {
                "title": "鼓山区",
                "code": "710202"
            },
            {
                "title": "左营区",
                "code": "710203"
            },
            {
                "title": "楠梓区",
                "code": "710204"
            },
            {
                "title": "三民区",
                "code": "710205"
            },
            {
                "title": "新兴区",
                "code": "710206"
            },
            {
                "title": "前金区",
                "code": "710207"
            },
            {
                "title": "苓雅区",
                "code": "710208"
            },
            {
                "title": "前镇区",
                "code": "710209"
            },
            {
                "title": "旗津区",
                "code": "710210"
            },
            {
                "title": "小港区",
                "code": "710211"
            },
            {
                "title": "凤山区",
                "code": "710212"
            },
            {
                "title": "林园区",
                "code": "710213"
            },
            {
                "title": "大寮区",
                "code": "710214"
            },
            {
                "title": "大树区",
                "code": "710215"
            },
            {
                "title": "大社区",
                "code": "710216"
            },
            {
                "title": "仁武区",
                "code": "710217"
            },
            {
                "title": "鸟松区",
                "code": "710218"
            },
            {
                "title": "冈山区",
                "code": "710219"
            },
            {
                "title": "桥头区",
                "code": "710220"
            },
            {
                "title": "燕巢区",
                "code": "710221"
            },
            {
                "title": "田寮区",
                "code": "710222"
            },
            {
                "title": "阿莲区",
                "code": "710223"
            },
            {
                "title": "路竹区",
                "code": "710224"
            },
            {
                "title": "湖内区",
                "code": "710225"
            },
            {
                "title": "茄萣区",
                "code": "710226"
            },
            {
                "title": "永安区",
                "code": "710227"
            },
            {
                "title": "弥陀区",
                "code": "710228"
            },
            {
                "title": "梓官区",
                "code": "710229"
            },
            {
                "title": "旗山区",
                "code": "710230"
            },
            {
                "title": "美浓区",
                "code": "710231"
            },
            {
                "title": "六龟区",
                "code": "710232"
            },
            {
                "title": "甲仙区",
                "code": "710233"
            },
            {
                "title": "杉林区",
                "code": "710234"
            },
            {
                "title": "内门区",
                "code": "710235"
            },
            {
                "title": "茂林区",
                "code": "710236"
            },
            {
                "title": "桃源区",
                "code": "710237"
            },
            {
                "title": "那玛夏区",
                "code": "710238"
            }
            ]
        },
        {
            "title": "基隆",
            "code": "710300",
            "children": [{
                "title": "中正区",
                "code": "710301"
            },
            {
                "title": "七堵区",
                "code": "710302"
            },
            {
                "title": "暖暖区",
                "code": "710303"
            },
            {
                "title": "仁爱区",
                "code": "710304"
            },
            {
                "title": "中山区",
                "code": "710305"
            },
            {
                "title": "安乐区",
                "code": "710306"
            },
            {
                "title": "信义区",
                "code": "710307"
            }
            ]
        },
        {
            "title": "台中",
            "code": "710400",
            "children": [{
                "title": "中区",
                "code": "710401"
            },
            {
                "title": "东区",
                "code": "710402"
            },
            {
                "title": "南区",
                "code": "710403"
            },
            {
                "title": "西区",
                "code": "710404"
            },
            {
                "title": "北区",
                "code": "710405"
            },
            {
                "title": "西屯区",
                "code": "710406"
            },
            {
                "title": "南屯区",
                "code": "710407"
            },
            {
                "title": "北屯区",
                "code": "710408"
            },
            {
                "title": "丰原区",
                "code": "710409"
            },
            {
                "title": "东势区",
                "code": "710410"
            },
            {
                "title": "大甲区",
                "code": "710411"
            },
            {
                "title": "清水区",
                "code": "710412"
            },
            {
                "title": "沙鹿区",
                "code": "710413"
            },
            {
                "title": "梧栖区",
                "code": "710414"
            },
            {
                "title": "后里区",
                "code": "710415"
            },
            {
                "title": "神冈区",
                "code": "710416"
            },
            {
                "title": "潭子区",
                "code": "710417"
            },
            {
                "title": "大雅区",
                "code": "710418"
            },
            {
                "title": "新社区",
                "code": "710419"
            },
            {
                "title": "石冈区",
                "code": "710420"
            },
            {
                "title": "外埔区",
                "code": "710421"
            },
            {
                "title": "大安区",
                "code": "710422"
            },
            {
                "title": "乌日区",
                "code": "710423"
            },
            {
                "title": "大肚区",
                "code": "710424"
            },
            {
                "title": "龙井区",
                "code": "710425"
            },
            {
                "title": "雾峰区",
                "code": "710426"
            },
            {
                "title": "太平区",
                "code": "710427"
            },
            {
                "title": "大里区",
                "code": "710428"
            },
            {
                "title": "和平区",
                "code": "710429"
            }
            ]
        },
        {
            "title": "台南",
            "code": "710500",
            "children": [{
                "title": "东区",
                "code": "710501"
            },
            {
                "title": "南区",
                "code": "710502"
            },
            {
                "title": "北区",
                "code": "710504"
            },
            {
                "title": "安南区",
                "code": "710506"
            },
            {
                "title": "安平区",
                "code": "710507"
            },
            {
                "title": "中西区",
                "code": "710508"
            },
            {
                "title": "新营区",
                "code": "710509"
            },
            {
                "title": "盐水区",
                "code": "710510"
            },
            {
                "title": "白河区",
                "code": "710511"
            },
            {
                "title": "柳营区",
                "code": "710512"
            },
            {
                "title": "后壁区",
                "code": "710513"
            },
            {
                "title": "东山区",
                "code": "710514"
            },
            {
                "title": "麻豆区",
                "code": "710515"
            },
            {
                "title": "下营区",
                "code": "710516"
            },
            {
                "title": "六甲区",
                "code": "710517"
            },
            {
                "title": "官田区",
                "code": "710518"
            },
            {
                "title": "大内区",
                "code": "710519"
            },
            {
                "title": "佳里区",
                "code": "710520"
            },
            {
                "title": "学甲区",
                "code": "710521"
            },
            {
                "title": "西港区",
                "code": "710522"
            },
            {
                "title": "七股区",
                "code": "710523"
            },
            {
                "title": "将军区",
                "code": "710524"
            },
            {
                "title": "北门区",
                "code": "710525"
            },
            {
                "title": "新化区",
                "code": "710526"
            },
            {
                "title": "善化区",
                "code": "710527"
            },
            {
                "title": "新市区",
                "code": "710528"
            },
            {
                "title": "安定区",
                "code": "710529"
            },
            {
                "title": "山上区",
                "code": "710530"
            },
            {
                "title": "玉井区",
                "code": "710531"
            },
            {
                "title": "楠西区",
                "code": "710532"
            },
            {
                "title": "南化区",
                "code": "710533"
            },
            {
                "title": "左镇区",
                "code": "710534"
            },
            {
                "title": "仁德区",
                "code": "710535"
            },
            {
                "title": "归仁区",
                "code": "710536"
            },
            {
                "title": "关庙区",
                "code": "710537"
            },
            {
                "title": "龙崎区",
                "code": "710538"
            },
            {
                "title": "永康区",
                "code": "710539"
            }
            ]
        },
        {
            "title": "新竹",
            "code": "710600",
            "children": [{
                "title": "东区",
                "code": "710601"
            },
            {
                "title": "北区",
                "code": "710602"
            },
            {
                "title": "香山区",
                "code": "710603"
            }
            ]
        },
        {
            "title": "嘉义",
            "code": "710700",
            "children": [{
                "title": "东区",
                "code": "710701"
            },
            {
                "title": "西区",
                "code": "710702"
            }
            ]
        },
        {
            "title": "新北",
            "code": "710800",
            "children": [{
                "title": "板桥区",
                "code": "710801"
            },
            {
                "title": "三重区",
                "code": "710802"
            },
            {
                "title": "中和区",
                "code": "710803"
            },
            {
                "title": "永和区",
                "code": "710804"
            },
            {
                "title": "新庄区",
                "code": "710805"
            },
            {
                "title": "新店区",
                "code": "710806"
            },
            {
                "title": "树林区",
                "code": "710807"
            },
            {
                "title": "莺歌区",
                "code": "710808"
            },
            {
                "title": "三峡区",
                "code": "710809"
            },
            {
                "title": "淡水区",
                "code": "710810"
            },
            {
                "title": "汐止区",
                "code": "710811"
            },
            {
                "title": "瑞芳区",
                "code": "710812"
            },
            {
                "title": "土城区",
                "code": "710813"
            },
            {
                "title": "芦洲区",
                "code": "710814"
            },
            {
                "title": "五股区",
                "code": "710815"
            },
            {
                "title": "泰山区",
                "code": "710816"
            },
            {
                "title": "林口区",
                "code": "710817"
            },
            {
                "title": "深坑区",
                "code": "710818"
            },
            {
                "title": "石碇区",
                "code": "710819"
            },
            {
                "title": "坪林区",
                "code": "710820"
            },
            {
                "title": "三芝区",
                "code": "710821"
            },
            {
                "title": "石门区",
                "code": "710822"
            },
            {
                "title": "八里区",
                "code": "710823"
            },
            {
                "title": "平溪区",
                "code": "710824"
            },
            {
                "title": "双溪区",
                "code": "710825"
            },
            {
                "title": "贡寮区",
                "code": "710826"
            },
            {
                "title": "金山区",
                "code": "710827"
            },
            {
                "title": "万里区",
                "code": "710828"
            },
            {
                "title": "乌来区",
                "code": "710829"
            }
            ]
        },
        {
            "title": "宜兰县",
            "code": "712200",
            "children": [{
                "title": "宜兰市",
                "code": "712201"
            },
            {
                "title": "罗东镇",
                "code": "712221"
            },
            {
                "title": "苏澳镇",
                "code": "712222"
            },
            {
                "title": "头城镇",
                "code": "712223"
            },
            {
                "title": "礁溪乡",
                "code": "712224"
            },
            {
                "title": "壮围乡",
                "code": "712225"
            },
            {
                "title": "员山乡",
                "code": "712226"
            },
            {
                "title": "冬山乡",
                "code": "712227"
            },
            {
                "title": "五结乡",
                "code": "712228"
            },
            {
                "title": "三星乡",
                "code": "712229"
            },
            {
                "title": "大同乡",
                "code": "712230"
            },
            {
                "title": "南澳乡",
                "code": "712231"
            }
            ]
        },
        {
            "title": "桃园县",
            "code": "712300",
            "children": [{
                "title": "桃园市",
                "code": "712301"
            },
            {
                "title": "中坜市",
                "code": "712302"
            },
            {
                "title": "平镇市",
                "code": "712303"
            },
            {
                "title": "八德市",
                "code": "712304"
            },
            {
                "title": "杨梅市",
                "code": "712305"
            },
            {
                "title": "大溪镇",
                "code": "712321"
            },
            {
                "title": "芦竹乡",
                "code": "712323"
            },
            {
                "title": "大园乡",
                "code": "712324"
            },
            {
                "title": "龟山乡",
                "code": "712325"
            },
            {
                "title": "龙潭乡",
                "code": "712327"
            },
            {
                "title": "新屋乡",
                "code": "712329"
            },
            {
                "title": "观音乡",
                "code": "712330"
            },
            {
                "title": "复兴乡",
                "code": "712331"
            }
            ]
        },
        {
            "title": "新竹县",
            "code": "712400",
            "children": [{
                "title": "竹北市",
                "code": "712401"
            },
            {
                "title": "竹东镇",
                "code": "712421"
            },
            {
                "title": "新埔镇",
                "code": "712422"
            },
            {
                "title": "关西镇",
                "code": "712423"
            },
            {
                "title": "湖口乡",
                "code": "712424"
            },
            {
                "title": "新丰乡",
                "code": "712425"
            },
            {
                "title": "芎林乡",
                "code": "712426"
            },
            {
                "title": "橫山乡",
                "code": "712427"
            },
            {
                "title": "北埔乡",
                "code": "712428"
            },
            {
                "title": "宝山乡",
                "code": "712429"
            },
            {
                "title": "峨眉乡",
                "code": "712430"
            },
            {
                "title": "尖石乡",
                "code": "712431"
            },
            {
                "title": "五峰乡",
                "code": "712432"
            }
            ]
        },
        {
            "title": "苗栗县",
            "code": "712500",
            "children": [{
                "title": "苗栗市",
                "code": "712501"
            },
            {
                "title": "苑里镇",
                "code": "712521"
            },
            {
                "title": "通霄镇",
                "code": "712522"
            },
            {
                "title": "竹南镇",
                "code": "712523"
            },
            {
                "title": "头份镇",
                "code": "712524"
            },
            {
                "title": "后龙镇",
                "code": "712525"
            },
            {
                "title": "卓兰镇",
                "code": "712526"
            },
            {
                "title": "大湖乡",
                "code": "712527"
            },
            {
                "title": "公馆乡",
                "code": "712528"
            },
            {
                "title": "铜锣乡",
                "code": "712529"
            },
            {
                "title": "南庄乡",
                "code": "712530"
            },
            {
                "title": "头屋乡",
                "code": "712531"
            },
            {
                "title": "三义乡",
                "code": "712532"
            },
            {
                "title": "西湖乡",
                "code": "712533"
            },
            {
                "title": "造桥乡",
                "code": "712534"
            },
            {
                "title": "三湾乡",
                "code": "712535"
            },
            {
                "title": "狮潭乡",
                "code": "712536"
            },
            {
                "title": "泰安乡",
                "code": "712537"
            }
            ]
        },
        {
            "title": "彰化县",
            "code": "712700",
            "children": [{
                "title": "彰化市",
                "code": "712701"
            },
            {
                "title": "鹿港镇",
                "code": "712721"
            },
            {
                "title": "和美镇",
                "code": "712722"
            },
            {
                "title": "线西乡",
                "code": "712723"
            },
            {
                "title": "伸港乡",
                "code": "712724"
            },
            {
                "title": "福兴乡",
                "code": "712725"
            },
            {
                "title": "秀水乡",
                "code": "712726"
            },
            {
                "title": "花坛乡",
                "code": "712727"
            },
            {
                "title": "芬园乡",
                "code": "712728"
            },
            {
                "title": "员林镇",
                "code": "712729"
            },
            {
                "title": "溪湖镇",
                "code": "712730"
            },
            {
                "title": "田中镇",
                "code": "712731"
            },
            {
                "title": "大村乡",
                "code": "712732"
            },
            {
                "title": "埔盐乡",
                "code": "712733"
            },
            {
                "title": "埔心乡",
                "code": "712734"
            },
            {
                "title": "永靖乡",
                "code": "712735"
            },
            {
                "title": "社头乡",
                "code": "712736"
            },
            {
                "title": "二水乡",
                "code": "712737"
            },
            {
                "title": "北斗镇",
                "code": "712738"
            },
            {
                "title": "二林镇",
                "code": "712739"
            },
            {
                "title": "田尾乡",
                "code": "712740"
            },
            {
                "title": "埤头乡",
                "code": "712741"
            },
            {
                "title": "芳苑乡",
                "code": "712742"
            },
            {
                "title": "大城乡",
                "code": "712743"
            },
            {
                "title": "竹塘乡",
                "code": "712744"
            },
            {
                "title": "溪州乡",
                "code": "712745"
            }
            ]
        },
        {
            "title": "南投县",
            "code": "712800",
            "children": [{
                "title": "南投市",
                "code": "712801"
            },
            {
                "title": "埔里镇",
                "code": "712821"
            },
            {
                "title": "草屯镇",
                "code": "712822"
            },
            {
                "title": "竹山镇",
                "code": "712823"
            },
            {
                "title": "集集镇",
                "code": "712824"
            },
            {
                "title": "名间乡",
                "code": "712825"
            },
            {
                "title": "鹿谷乡",
                "code": "712826"
            },
            {
                "title": "中寮乡",
                "code": "712827"
            },
            {
                "title": "鱼池乡",
                "code": "712828"
            },
            {
                "title": "国姓乡",
                "code": "712829"
            },
            {
                "title": "水里乡",
                "code": "712830"
            },
            {
                "title": "信义乡",
                "code": "712831"
            },
            {
                "title": "仁爱乡",
                "code": "712832"
            }
            ]
        },
        {
            "title": "云林县",
            "code": "712900",
            "children": [{
                "title": "斗六市",
                "code": "712901"
            },
            {
                "title": "斗南镇",
                "code": "712921"
            },
            {
                "title": "虎尾镇",
                "code": "712922"
            },
            {
                "title": "西螺镇",
                "code": "712923"
            },
            {
                "title": "土库镇",
                "code": "712924"
            },
            {
                "title": "北港镇",
                "code": "712925"
            },
            {
                "title": "古坑乡",
                "code": "712926"
            },
            {
                "title": "大埤乡",
                "code": "712927"
            },
            {
                "title": "莿桐乡",
                "code": "712928"
            },
            {
                "title": "林内乡",
                "code": "712929"
            },
            {
                "title": "二仑乡",
                "code": "712930"
            },
            {
                "title": "仑背乡",
                "code": "712931"
            },
            {
                "title": "麦寮乡",
                "code": "712932"
            },
            {
                "title": "东势乡",
                "code": "712933"
            },
            {
                "title": "褒忠乡",
                "code": "712934"
            },
            {
                "title": "台西乡",
                "code": "712935"
            },
            {
                "title": "元长乡",
                "code": "712936"
            },
            {
                "title": "四湖乡",
                "code": "712937"
            },
            {
                "title": "口湖乡",
                "code": "712938"
            },
            {
                "title": "水林乡",
                "code": "712939"
            }
            ]
        },
        {
            "title": "嘉义县",
            "code": "713000",
            "children": [{
                "title": "太保市",
                "code": "713001"
            },
            {
                "title": "朴子市",
                "code": "713002"
            },
            {
                "title": "布袋镇",
                "code": "713023"
            },
            {
                "title": "大林镇",
                "code": "713024"
            },
            {
                "title": "民雄乡",
                "code": "713025"
            },
            {
                "title": "溪口乡",
                "code": "713026"
            },
            {
                "title": "新港乡",
                "code": "713027"
            },
            {
                "title": "六脚乡",
                "code": "713028"
            },
            {
                "title": "东石乡",
                "code": "713029"
            },
            {
                "title": "义竹乡",
                "code": "713030"
            },
            {
                "title": "鹿草乡",
                "code": "713031"
            },
            {
                "title": "水上乡",
                "code": "713032"
            },
            {
                "title": "中埔乡",
                "code": "713033"
            },
            {
                "title": "竹崎乡",
                "code": "713034"
            },
            {
                "title": "梅山乡",
                "code": "713035"
            },
            {
                "title": "番路乡",
                "code": "713036"
            },
            {
                "title": "大埔乡",
                "code": "713037"
            },
            {
                "title": "阿里山乡",
                "code": "713038"
            }
            ]
        },
        {
            "title": "屏东县",
            "code": "713300",
            "children": [{
                "title": "屏东市",
                "code": "713301"
            },
            {
                "title": "潮州镇",
                "code": "713321"
            },
            {
                "title": "东港镇",
                "code": "713322"
            },
            {
                "title": "恒春镇",
                "code": "713323"
            },
            {
                "title": "万丹乡",
                "code": "713324"
            },
            {
                "title": "长治乡",
                "code": "713325"
            },
            {
                "title": "麟洛乡",
                "code": "713326"
            },
            {
                "title": "九如乡",
                "code": "713327"
            },
            {
                "title": "里港乡",
                "code": "713328"
            },
            {
                "title": "盐埔乡",
                "code": "713329"
            },
            {
                "title": "高树乡",
                "code": "713330"
            },
            {
                "title": "万峦乡",
                "code": "713331"
            },
            {
                "title": "内埔乡",
                "code": "713332"
            },
            {
                "title": "竹田乡",
                "code": "713333"
            },
            {
                "title": "新埤乡",
                "code": "713334"
            },
            {
                "title": "枋寮乡",
                "code": "713335"
            },
            {
                "title": "新园乡",
                "code": "713336"
            },
            {
                "title": "崁顶乡",
                "code": "713337"
            },
            {
                "title": "林边乡",
                "code": "713338"
            },
            {
                "title": "南州乡",
                "code": "713339"
            },
            {
                "title": "佳冬乡",
                "code": "713340"
            },
            {
                "title": "琉球乡",
                "code": "713341"
            },
            {
                "title": "车城乡",
                "code": "713342"
            },
            {
                "title": "满州乡",
                "code": "713343"
            },
            {
                "title": "枋山乡",
                "code": "713344"
            },
            {
                "title": "三地门乡",
                "code": "713345"
            },
            {
                "title": "雾台乡",
                "code": "713346"
            },
            {
                "title": "玛家乡",
                "code": "713347"
            },
            {
                "title": "泰武乡",
                "code": "713348"
            },
            {
                "title": "来义乡",
                "code": "713349"
            },
            {
                "title": "春日乡",
                "code": "713350"
            },
            {
                "title": "狮子乡",
                "code": "713351"
            },
            {
                "title": "牡丹乡",
                "code": "713352"
            }
            ]
        },
        {
            "title": "台东县",
            "code": "713400",
            "children": [{
                "title": "台东市",
                "code": "713401"
            },
            {
                "title": "成功镇",
                "code": "713421"
            },
            {
                "title": "关山镇",
                "code": "713422"
            },
            {
                "title": "卑南乡",
                "code": "713423"
            },
            {
                "title": "鹿野乡",
                "code": "713424"
            },
            {
                "title": "池上乡",
                "code": "713425"
            },
            {
                "title": "东河乡",
                "code": "713426"
            },
            {
                "title": "长滨乡",
                "code": "713427"
            },
            {
                "title": "太麻里乡",
                "code": "713428"
            },
            {
                "title": "大武乡",
                "code": "713429"
            },
            {
                "title": "绿岛乡",
                "code": "713430"
            },
            {
                "title": "海端乡",
                "code": "713431"
            },
            {
                "title": "延平乡",
                "code": "713432"
            },
            {
                "title": "金峰乡",
                "code": "713433"
            },
            {
                "title": "达仁乡",
                "code": "713434"
            },
            {
                "title": "兰屿乡",
                "code": "713435"
            }
            ]
        },
        {
            "title": "花莲县",
            "code": "713500",
            "children": [{
                "title": "花莲市",
                "code": "713501"
            },
            {
                "title": "凤林镇",
                "code": "713521"
            },
            {
                "title": "玉里镇",
                "code": "713522"
            },
            {
                "title": "新城乡",
                "code": "713523"
            },
            {
                "title": "吉安乡",
                "code": "713524"
            },
            {
                "title": "寿丰乡",
                "code": "713525"
            },
            {
                "title": "光复乡",
                "code": "713526"
            },
            {
                "title": "丰滨乡",
                "code": "713527"
            },
            {
                "title": "瑞穗乡",
                "code": "713528"
            },
            {
                "title": "富里乡",
                "code": "713529"
            },
            {
                "title": "秀林乡",
                "code": "713530"
            },
            {
                "title": "万荣乡",
                "code": "713531"
            },
            {
                "title": "卓溪乡",
                "code": "713532"
            }
            ]
        },
        {
            "title": "澎湖县",
            "code": "713600",
            "children": [{
                "title": "马公市",
                "code": "713601"
            },
            {
                "title": "湖西乡",
                "code": "713621"
            },
            {
                "title": "白沙乡",
                "code": "713622"
            },
            {
                "title": "西屿乡",
                "code": "713623"
            },
            {
                "title": "望安乡",
                "code": "713624"
            },
            {
                "title": "七美乡",
                "code": "713625"
            }
            ]
        }
        ]
    },
    {
        "title": "香港",
        "code": "810000",
        "children": [{
            "title": "香港岛",
            "code": "810100",
            "children": [{
                "title": "中西区",
                "code": "810101"
            },
            {
                "title": "湾仔区",
                "code": "810102"
            },
            {
                "title": "东区",
                "code": "810103"
            },
            {
                "title": "南区",
                "code": "810104"
            }
            ]
        },
        {
            "title": "九龙",
            "code": "810200",
            "children": [{
                "title": "油尖旺区",
                "code": "810201"
            },
            {
                "title": "深水埗区",
                "code": "810202"
            },
            {
                "title": "九龙城区",
                "code": "810203"
            },
            {
                "title": "黄大仙区",
                "code": "810204"
            },
            {
                "title": "观塘区",
                "code": "810205"
            }
            ]
        },
        {
            "title": "新界",
            "code": "810300",
            "children": [{
                "title": "荃湾区",
                "code": "810301"
            },
            {
                "title": "屯门区",
                "code": "810302"
            },
            {
                "title": "元朗区",
                "code": "810303"
            },
            {
                "title": "北区",
                "code": "810304"
            },
            {
                "title": "大埔区",
                "code": "810305"
            },
            {
                "title": "西贡区",
                "code": "810306"
            },
            {
                "title": "沙田区",
                "code": "810307"
            },
            {
                "title": "葵青区",
                "code": "810308"
            },
            {
                "title": "离岛区",
                "code": "810309"
            }
            ]
        }
        ]
    },
    {
        "title": "澳门",
        "code": "820000",
        "children": [{
            "title": "澳门半岛",
            "code": "820100",
            "children": [{
                "title": "花地玛堂区",
                "code": "820101"
            },
            {
                "title": "圣安多尼堂区",
                "code": "820102"
            },
            {
                "title": "大堂区",
                "code": "820103"
            },
            {
                "title": "望德堂区",
                "code": "820104"
            },
            {
                "title": "风顺堂区",
                "code": "820105"
            }
            ]
        },
        {
            "title": "氹仔岛",
            "code": "820200",
            "children": [{
                "title": "嘉模堂区",
                "code": "820201"
            }]
        },
        {
            "title": "路环岛",
            "code": "820300",
            "children": [{
                "title": "圣方济各堂区",
                "code": "820301"
            }]
        }
        ]
    }
    ],

    getTree() {
        let cityArray = this.cityTree;
        let cityTree = [];
        for (let i = 0; i < cityArray.length; i++) {
            let tree = {};
            let cityList = [];
            tree.code = cityArray[i].code;
            tree.title = cityArray[i].title;
            tree.site = cityArray[i].title;

            if (!cityArray[i].children)
                tree.children = [];
            else {
                for (let j = 0; j < cityArray[i].children.length; j++) {
                    let city = {};
                    let areaList = [];
                    city.code = cityArray[i].children[j].code;
                    city.title = cityArray[i].children[j].title;
                    city.site = cityArray[i].title + "/" + cityArray[i].children[j].title;

                    if (!cityArray[i].children[j].children)
                        city.children = [];
                    else {
                        for (let k = 0; k < cityArray[i].children[j].children.length; k++) {
                            let city = {};
                            city.code = cityArray[i].children[j].children[k].code;
                            city.title = cityArray[i].children[j].children[k].title;
                            city.site = cityArray[i].title + "/" + cityArray[i].children[j].title + "/" + cityArray[i].children[j].children[k].title;
                            areaList.push(city)
                        }
                        city.children = areaList;
                    }
                    cityList.push(city);
                }
                tree.children = cityList;
            }
            cityTree.push(tree)
        }
        //console.log('cityTree',cityTree);
        return cityTree;
    },
    convert(cityTree, code) {
        let result = ''
        for (let i in cityTree) {
            let item = cityTree[i];
            if (code == item.code) {
                result = item.site;
                break;
            } else if (item.children && item.children.length > 0) {
                convert(item.children, code)
            }
        }
        return result;
    },
    getList() {
        let cityList = [];
        let cityArray = this.cityTree;
        for (let i = 0; i < cityArray.length; i++) {
            let city = {};
            city.code = cityArray[i].code;
            city.site = cityArray[i].title;
            cityList.push(city);

            if (!cityArray[i].children)
                continue;
            else {
                for (let j = 0; j < cityArray[i].children.length; j++) {
                    let city = {};
                    city.code = cityArray[i].children[j].code;
                    city.site = cityArray[i].title + "/" + cityArray[i].children[j].title;
                    cityList.push(city);

                    if (!cityArray[i].children[j].children)
                        continue;
                    else {
                        for (let k = 0; k < cityArray[i].children[j].children.length; k++) {
                            if (cityArray[i].children[j].children[k].title == '市辖区')
                                continue;
                            let city = {};
                            city.code = cityArray[i].children[j].children[k].code;
                            city.site = cityArray[i].title + "/" + cityArray[i].children[j].title + "/" + cityArray[i].children[j].children[k].title;
                            cityList.push(city);
                        }
                    }
                }
            }

        }
        //console.log("cityList",cityList)
        return cityList;
    },
    hasCity(city) {
        let cityList = this.getList();
        for (let item of cityList) {
            if (item.site === city) {
                return true;
            }
        }
        return false;
    },
}

export default city;